{
  "kb_meta": {
    "segmented_at": "2026-01-14",
    "segmentation_version": "justyna-3.3",
    "kb_change_type": "regeneration",
    "kb_note": "Ponowne wygenerowanie bez zmian w treści rozdziałów, w celu ujednolicenia struktury KB.",
    "source_last_updated": "2022-04-08"
  },
  "chapters": [
    {
      "article_id": "3d-printing-in-school",
      "post_slug": "druk-3d-robotyka-w-szkole",
      "chapter_id": "1",
      "language": "pl",
      "heading": "Drukarka 3D w szkole – możliwości, mity i lekcja krok po kroku",
      "text": "Drukarka 3D stała się obowiązkowym wyposażeniem pracowni dla każdej publicznej szkoły podstawowej. Część szkół już odebrało nowy sprzęt od kuriera, a filamenty cierpliwie czekają na zapleczu; jest nawet nauczyciel, który podjął się wziąć na swoje barki druk 3D w szkole. Teoretycznie wszystko jest gotowe.\n\n**Ale jak wykorzystać ten sprzęt w praktyce, na lekcji z uczniami?**\n\nNiestety informacji o praktycznym zastosowaniu druku 3D w szkole brakuje. Jest sprzęt, ale mało kto pomyślał o przygotowaniu, o materiałach dydaktycznych, o tym jak używanie drukarki w szkole będzie wyglądało na co dzień.\n\nDlatego w tym artykule, napisanym na podstawie doświadczeń własnych oraz prac naukowych opublikowanych przez dydaktyków z całego świata w przeciągu kilku ostatnich lat, analizujemy jak rzeczywiście można wykorzystać druk 3D w szkole podstawowej – jakie są prawdziwe możliwości oraz ograniczenia edukacyjne drukarki 3D.\n\nDowiesz się co możesz osiągnąć przy pomocy nowego wyposażenia. Poznasz wady i zalety różnych sposobów wykorzystania drukarki 3D. Zobaczysz jak może wyglądać przykładowa lekcja.\n\n**Jeżeli chcesz zacząć używać szkolnej drukarki 3D, ten artykuł jest dla Ciebie.**",
      "summary": "Rozdział opisuje sytuację, w której drukarka 3D stała się obowiązkowym wyposażeniem publicznych szkół podstawowych, a szkoły mają już sprzęt i filamenty, oraz wskazanego nauczyciela do obsługi. Podkreśla, że brakuje informacji o praktycznym wykorzystaniu druku 3D na lekcjach, w tym materiałów dydaktycznych i przygotowania do codziennej pracy. Autor zapowiada analizę rzeczywistych możliwości i ograniczeń edukacyjnych drukarki 3D, opartą na doświadczeniach własnych i pracach naukowych dydaktyków z ostatnich lat.",
      "primary_questions": [
        "Jaki problem praktyczny stawia rozdział w kontekście posiadania drukarki 3D i filamentów w szkole podstawowej?",
        "Jakie braki w przygotowaniu do codziennego używania drukarki 3D w szkole wskazuje autor (materiały, przygotowanie, organizacja)?",
        "Na jakich dwóch typach źródeł autor opiera artykuł (doświadczenia własne i prace naukowe dydaktyków) oraz jaki jest ich ogólny zakres czasowy?",
        "Jakie dwa obszary ma obejmować analiza wykorzystania druku 3D w szkole podstawowej według zapowiedzi (możliwości i ograniczenia)?",
        "Jakie rezultaty dla czytelnika deklaruje rozdział wprost (poznanie wad i zalet sposobów użycia, przykład lekcji)?",
        "Do kogo bezpośrednio kierowany jest artykuł według końcowego zdania rozdziału?"
      ],
      "canonical_url": "https://www.robocamp.pl/pl/blog/druk-3d-robotyka-w-szkole/",
      "last_updated": "2022-04-08"
    },
    {
      "article_id": "3d-printing-in-school",
      "post_slug": "druk-3d-robotyka-w-szkole",
      "chapter_id": "2",
      "language": "pl",
      "heading": "Mity o druku 3D w szkole",
      "text": "## Mity o druku 3D w szkole\n\n(Mity o druku 3D)\n\nKilka sekund online wystarczy, żeby znaleźć multum artykułów opisujących liczne zalety i wręcz nieskończone możliwości drukarek 3D. Zazwyczaj są to teksty marketingowe sponsorowane przez producentów. Mało który omawia ograniczenia tych urządzeń, o rozwiązywaniu problemów nie wspominając.\n\nDlatego zanim poznamy sposoby wykorzystania drukarki 3D w szkole, musimy rozwiać kilka popularnych mitów.\n\n#### Druk 3D jest szybki, łatwy i edukacyjny\n\n**Proces drukowania nie jest ani edukacyjny, ani masowy, ani bezproblemowy. Bez względu na model drukarki.** Drukowanie jednego modelu 3D trwa długo, a proces jest łatwy do zrozumienia. Obserwowanie całego druku przez uczniów jest niepotrzebne – wręcz przeciwwskazane.\n\nCo więcej, musimy się liczyć z tym, że nie każdy wydruk wyjdzie za pierwszym razem, nawet jeśli projekt będzie bezbłędny. Głowica może się zatkać, model może się odczepić od stołu drukarki, warstwa może się źle wydrukować… W większości przypadków błąd trzeba zdiagnozować, naprawić i zacząć drukować model jeszcze raz.\n\n#### Drukarka 3D to sprzęt dla ucznia\n\nDrukarka 3D jest narzędziem przede wszystkim dla nauczyciela, nie dla ucznia. Jest to naturalna konsekwencja wspomnianego już czasu drukowania oraz odpowiedzialności za obsługę i utrzymanie sprzętu. Dlatego jeżeli szkoła planuje udostępnić drukarkę 3D uczniom do samodzielnej obsługi, np. w ramach kółka zainteresowań, warto zastanowić się nad zakupem dwóch tańszych egzemplarzy.\n\n#### Wszyscy są gotowi na projektowanie 3D w szkole\n\n**Możliwości dydaktyczne drukarek 3D są rzeczywiście cenne, ale nie zostały jeszcze przystosowane do edukacji powszechnej.** Brakuje wysokiej jakości materiałów, sprawdzonego programu nauczania, podręczników, szkoleń, a nawet scenariuszy lekcji – teraz prawie wszystko jest na głowie nauczyciela.\n\nTylko modeli 3D jest dużo, ale w różnych repozytoriach i o różnej jakości, więc znalezienie odpowiedniego modelu na lekcję też zajmuje dużo czasu.\n\n#### Nauczyciel sam się zmotywuje\n\nWsparcie nauczycieli pracujących z tym sprzętem jest bardzo ważne. Początkowy entuzjazm nieuchronnie kurczy się w obliczu rzeczywistych trudności pracy z drukarką 3D, a pamiętajmy, że nauczyciel gra tu kluczową rolę.\n\nWarto zachęcić więcej niż jednego nauczyciela w szkole do korzystania z drukarki – koleżeńska pomoc i możliwość porównywania doświadczeń są wymieniane przez nauczycieli jako jedne z ważniejszych motywacji kontynuowania projektów z druku 3D.\n\n#### Uczniowie będą mieć lepsze wyniki w nauce\n\nOsoby bezpośrednio zaangażowane w zajęcia z udziałem drukarki 3D (nauczyciele i uczniowie) dostrzegają wzrost motywacji i zaangażowania na początkowym etapie, jednak **nadal brakuje rzetelnych danych na temat związku między wykorzystaniem tego sprzętu a mierzalnymi postępami w nauce**. Dotychczas opublikowane badania dotyczą niedużych grup i nie biorą pod uwagę nauczania powszechnego. Najbardziej entuzjastyczni w swoich prognozach są producenci drukarek, ale to chyba nikogo nie dziwi.\n\n**Prawda jest taka, że drukarka 3D w warunkach szkolnych to zupełnie nowe narzędzie, które ma duży potencjał, ale trudno przewidzieć jak sprawdzi się w praktyce.**\n\nTeraz możemy zastanowić się jak chcemy wykorzystać to narzędzie w praktyce. Kierunki są zasadniczo dwa: [drukowanie rekwizytów](https://www.robocamp.pl/pl/blog/druk-3d-robotyka-w-szkole/#rekwizyty-3d) i [nauka projektowania](https://www.robocamp.pl/pl/blog/druk-3d-robotyka-w-szkole/#projektowanie-3d).",
      "summary": "Rozdział wskazuje, że wiele tekstów o drukarkach 3D to materiały marketingowe producentów, które rzadko omawiają ograniczenia i rozwiązywanie problemów. Opisuje mit, że druk 3D jest szybki i bezproblemowy, podkreślając długi czas druku pojedynczego modelu oraz typowe awarie, takie jak zatkana głowica czy odklejenie modelu od stołu. Wyjaśnia też, że drukarka 3D w szkole jest przede wszystkim narzędziem nauczyciela, brakuje przystosowanych materiałów i programu nauczania, a rzetelne dane o wpływie na wyniki w nauce są nadal ograniczone; na koniec wskazuje dwa kierunki zastosowań: drukowanie rekwizytów i naukę projektowania.",
      "primary_questions": [
        "Jak rozdział charakteryzuje typowe artykuły znalezione online o drukarkach 3D i czego w nich zwykle brakuje?",
        "Jakie trzy cechy procesu drukowania 3D są wprost zakwestionowane w rozdziale (edukacyjność, masowość, bezproblemowość) i dlaczego?",
        "Dlaczego obserwowanie całego procesu druku przez uczniów jest według rozdziału niepotrzebne lub przeciwwskazane?",
        "Jakie przykłady problemów z wydrukiem wymienia rozdział (np. zatkanie głowicy, odczepienie modelu, błędna warstwa) i co zwykle trzeba wtedy zrobić?",
        "Dlaczego drukarka 3D jest w rozdziale opisana jako narzędzie przede wszystkim dla nauczyciela, a nie dla ucznia?",
        "Jakie braki w edukacji powszechnej dotyczące projektowania 3D wskazuje rozdział (materiały, program, podręczniki, szkolenia, scenariusze)?",
        "Jakie dwa główne kierunki praktycznego wykorzystania drukarki 3D w szkole rozdział wskazuje na końcu?"
      ],
      "canonical_url": "https://www.robocamp.pl/pl/blog/druk-3d-robotyka-w-szkole/#mity-o-druku-3d-w-szkole",
      "last_updated": "2022-04-08"
    },
    {
      "article_id": "3d-printing-in-school",
      "post_slug": "druk-3d-robotyka-w-szkole",
      "chapter_id": "3",
      "language": "pl",
      "heading": "Rekwizyty 3D",
      "text": "## Rekwizyty 3D\n\nNa pewno o nich słyszeliście. Chociażby dlatego, że jest to najczęściej wymieniany sposób zastosowania drukarki 3D w edukacji powszechnej. Jest zrozumiały, bo łatwo wpisuje się w tradycyjną dydaktykę, dostępny dla nauczycieli różnych przedmiotów, oraz nieskomplikowany we wdrożeniu – niestety wartość edukacyjna dla ucznia jest ograniczona.\n\n> \"[...] Laboratoria Przyszłości, czyli nowoczesne pracownie techniczne, informatyczne, interdyscyplinarne, które będą służyły nie tylko nauce informatyki, ale także fizyki, chemii, geografii. Tutaj mamy drukarki 3D, które drukują chociażby Układ Słoneczny, Ziemię; mogą drukować narządy ludzkie, nerki. To wszystko po to, żeby szkoła była wyposażona w nowoczesne pomoce dydaktyczne.\"<br>– Minister Edukacji Przemysław Czarnek, [[źródło](https://www.youtube.com/watch?v=VV1rWIwfNnk)]\n\n(Różne wydrukowane modele 3D)\n\n**Rekwizyty 3D to nic innego jak obiekty wydrukowane na drukarce 3D, które można wykorzystać w kontekście lekcji praktycznie dowolnego przedmiotu w szkole.** Rekwizyt musi nawiązywać do tematu lekcji. Ma za zadanie przybliżyć temat uczniom i usprawnić przyswajanie wiedzy – mówiąc bardzo ogólnie. Dokładny wpływ rekwizytów 3D na proces nauki omawiamy w [zaletach](https://www.robocamp.pl/pl/blog/druk-3d-robotyka-w-szkole/#zalety) i [wadach](https://www.robocamp.pl/pl/blog/druk-3d-robotyka-w-szkole/#wady) tego rozwiązania.\n\nNa lekcji mogą posłużyć jako eksponat do obejrzenia z bliska, podawany z ręki do ręki, lub jako element zadania do rozwiązania przez uczniów. Nawet jeśli przypadkiem się popsuje, nie ma strachu – wystarczy wydrukować go ponownie.\n\n**Skąd wziąć rekwizyty 3D?** Wystarczy poszukać interesującego nas obiektu (najlepiej po angielsku) w internetowych bibliotekach 3D. Wiele modeli jest dostępnych bezpłatnie do pobrania, ale za bardziej skomplikowane często trzeba uiścić jednorazową opłatę. Kilka ciekawych modeli 3D zamieściliśmy [poniżej](https://www.robocamp.pl/pl/blog/druk-3d-robotyka-w-szkole/#przykadowe-rekwizyty-3d-na-lekcje-steam). Warto przeczytać komentarze, sprawdzić czy ktoś już wcześniej wydrukował dany model i czy podzielił się przydatnymi radami. Gdy wreszcie znajdziemy idealnego kandydata należy pobrać plik w formacie STL, załadować go do naszego slicera i wydrukować.\n\nVoilà! Jeden rekwizyt 3D na lekcję gotowy.\n\n### Zalety\n\n#### Wzrost zainteresowania przedmiotem\n\nGadżety są fajne, a gadżety wykorzystywane do nauki są na dodatek pożyteczne. Pobudzają ciekawość uczniów i zachęcają do zgłębiania przedmiotu.\n\nZajęcia na których dzieci korzystają z dodatkowego sprzętu czy pomocy dydaktycznych zawsze będą bardziej ekscytujące od lekcji z tradycyjnymi podręcznikami. Większa motywacja oznacza efektywniejszą naukę, przynajmniej krótkoterminowo. Co więcej, trójwymiarowe rekwizyty pomagają też przybliżyć pojęcia omawiane na lekcjach, a przez to pokazać uczniom nową, bardziej dostępną stronę tych przedmiotów, która jest dosłownie w zasięgu ich ręki.\n\n#### Dodatkowa stymulacja\n\nKażdy pedagog dobrze wie, że używanie na lekcji różnorodnych form przekazywania wiedzy zwiększa szanse uczniów na zapamiętanie materiału z lekcji. Wynika to z dwóch rzeczy: poziomu stymulacji oraz indywidualnych preferencji przyswajania informacji.\n\nMateriał przedstawiony tylko w formie tekstu zaciekawi ograniczoną grupę uczniów. Dodanie zdjęć lub nagrań ją poszerzy, a przy włączeniu do lekcji elementów kinestetycznych, które można na przykład dotknąć, potrzymać w rękach, obejrzeć z każdej strony, zyskujemy pewność, że w lekcji aktywnie uczestniczy większość grupy. Uczniowie będą bardziej zaangażowani, co może pozytywnie wpłynąć na przyswajanie materiału podczas lekcji.\n\n#### Niski koszt wykonania\n\nSzkolna pracownia wypełniona fascynującymi akcesoriami dydaktycznymi to wspaniały widok, zwłaszcza jeśli wszyscy zainteresowani mogą z tych akcesoriów korzystać. Niestety, wiele z takich pomocy jest kosztownych, dlatego nawet jeśli szkoła zaciśnie pasa i doda je do pracowni, to nierzadko kurzą się na półkach z obawy przed uszkodzeniem.\n\nDrukowanie własnych pomocy omija ten problem. Jedyny koszt to zakup filamentu PLA, a z jednej szpuli wydrukujemy wiele różnych modeli. A jeżeli ktoś przez przypadek zniszczy taki rekwizyt, żaden problem – wystarczy wydrukować nowy!\n\nJedyny haczyk to jakość. Aby stworzyć wysokiej jakości akcesoria, porównywalne do tych specjalistycznych, trzeba poświęcić dużo czasu oraz pracy własnej na ich wykończenie.\n\n### Wady (Nieudany wydruk 3D)\n\n#### Brak kontaktu z drukarką 3D\n\nZa wybór i wydrukowanie rekwizytów odpowiada nauczyciel. To on musi przejść przez cały proces, zrozumieć kolejne etapy i rozwiązać napotkane problemy. Uczeń ma styczność jedynie z ostatecznym rezultatem całego procesu – wydrukowanym modelem. To jak model powstał nie ma dla niego znaczenia, bo celem ucznia nie jest poznanie tajników druku 3D tylko wykorzystanie modelu na lekcji.\n\n**Innymi słowy, edukacyjne rekwizyty 3D nie nauczą uczniów niczego o druku, ani o projektowaniu 3D.** Uczniowie nie zobaczą jak z niepozornego filamentu stopniowo powstają wymyślne konstrukcje, nie doświadczą barier sprzętu, nie przekonają się jak parametry wpływają na wydruk, nie dostaną szansy by samodzielnie projektować w trójwymiarze, a niektórzy nawet nie zobaczą drukarki na własne oczy.\n\nNiestety, jeżeli drukarka 3D posłuży tylko do robienia rekwizytów, będzie ekskluzywnym narzędziem dla nauczyciela.\n\n#### Niska wartość edukacyjna\n\nPotencjał druku 3D w edukacji jest głośno opiewany już od kilku lat, zwłaszcza w kontekście rozwijania kompetencji przyszłości oraz przygotowania do pracy z zaawansowanymi technologiami. Jednak żeby takie cele realizować, uczniowie potrzebują czegoś więcej niż wydrukowane modele. Konieczne są odpowiednie warunki, gdzie uczniowie będą mogli wchodzić w interakcję z oprogramowaniem i sprzętem, samodzielnie zacząć ich używać.\n\nOczywiście stworzenie takich warunków jest wyzwaniem, zwłaszcza gdy doświadczenie jest minimalne, a program nauczania nie daje elastyczności. Niemniej trudno oprzeć się wrażeniu, że **używanie drukarki 3D w szkole wyłącznie jako mini-fabryki gotowych modeli to zmarnowany potencjał sprzętu**.\n\n#### Ograniczone zastosowanie\n\nNależy pamiętać, że drukarka 3D nie wydrukuje wszystkiego. Przy pomocy rekwizytów 3D możemy pokazać formę, strukturę, proporcje. Jednak wydrukowane modele będą się różnić od pierwowzorów tworzywem, detalami, wagą, zapachem, często rozmiarem i elastycznością. Oprócz tego ogranicza nas rozmiar obszaru roboczego drukarki oraz czas druku.",
      "summary": "Rozdział definiuje rekwizyty 3D jako obiekty wydrukowane na drukarce 3D, które można wykorzystać na lekcjach różnych przedmiotów jako eksponat lub element zadania, a w razie uszkodzenia wydrukować ponownie. Opisuje, że modele wyszukuje się w internetowych bibliotekach 3D (często po angielsku), pobiera w formacie STL i drukuje po przygotowaniu w slicerze, przy czym część modeli jest darmowa, a za bardziej skomplikowane bywa pobierana jednorazowa opłata. Wśród zalet wymienia wzrost zainteresowania przedmiotem, większą stymulację dzięki elementom kinestetycznym oraz niski koszt oparty na filamencie PLA, a wśród wad brak kontaktu ucznia z procesem druku i projektowania, ograniczoną wartość edukacyjną oraz ograniczenia wynikające z różnic materiału, rozmiaru obszaru roboczego i czasu druku.",
      "primary_questions": [
        "Jak rozdział definiuje rekwizyty 3D i jaki warunek musi spełniać rekwizyt względem tematu lekcji?",
        "W jakich dwóch formach na lekcji mogą być wykorzystywane rekwizyty 3D według rozdziału (eksponat i zadanie)?",
        "Jakie kroki składają się na przygotowanie rekwizytu 3D od znalezienia modelu do wydruku (biblioteka 3D, STL, slicer, druk)?",
        "Jak rozdział opisuje dostępność modeli 3D w bibliotekach (bezpłatne i płatne) oraz jakie działania zaleca przed wyborem modelu (komentarze, wcześniejsze wydruki, porady)?",
        "Jakie trzy zalety rekwizytów 3D wymienia rozdział (zainteresowanie, stymulacja, koszt) i z czego wynika każda z nich?",
        "Dlaczego rozdział wskazuje, że rekwizyty 3D nie uczą uczniów druku ani projektowania 3D i jaka jest rola nauczyciela w tym procesie?",
        "Jakie ograniczenia zastosowania rekwizytów 3D wymienia rozdział w kontekście różnic względem pierwowzorów oraz parametrów drukarki (obszar roboczy, czas druku)?"
      ],
      "canonical_url": "https://www.robocamp.pl/pl/blog/druk-3d-robotyka-w-szkole/#rekwizyty-3d",
      "last_updated": "2022-04-08"
    },
    {
      "article_id": "3d-printing-in-school",
      "post_slug": "druk-3d-robotyka-w-szkole",
      "chapter_id": "4",
      "language": "pl",
      "heading": "Przykładowe rekwizyty 3D na lekcje STEAM",
      "text": "### Przykładowe rekwizyty 3D na lekcje STEAM\n\n(Różne wydrukowane modele 3D)\n\nPrzeczesaliśmy internetowe bazy modeli 3D, żeby znaleźć dla Was kilka interesujących projektów dla różnych przedmiotów. Część z nich przetestowaliśmy sami. Trudność ich wykonania oceniliśmy w skali od bezproblemowych (⭐) do bardzo wymagających (⭐⭐⭐).\n\nSumaryczny czas druku oraz ilość filamentu PLA zostały oszacowane przy optymalnych ustawieniach druku dla drukarki Flashforge Adventurer 4. Jeden metr filamentu 1.75 mm PLA waży około 2,98 gram, a w 1 kg szpuli jest około 335 m.\n\n#### Biologia\n\n> \"Po zobaczeniu komórki [zwierzęcej], jak to wygląda, warto by było zajrzeć do środka, a to już jest dosyć trudne przy pomocy sprzętu, którym dysponujemy w szkole. [...] Zazwyczaj radzimy sobie korzystając z różnych ilustracji, ale przy pomocy drukarki 3D moglibyśmy spróbować wydrukować model takiej komórki zwierzęcej.\"<br>– Mateusz Chmielewski, Trener Skriware [[źródło](https://www.youtube.com/watch?v=9x_YlpfmSmo)]\n\nRzeczywiście, przy pomocy drukarki 3D możemy wydrukować model komórki zwierzęcej lub roślinnej i pokazać go uczniom. Na lekcje biologii i przyrody możemy wydrukować o wiele więcej, na przykład modele narządów wewnętrznych, kości, czy nawet kompletny szkielet – często w rzeczywistych wymiarach! Oczywiście potrzeba na to dużo czasu, a jeśli zależy nam na anatomicznej dokładności, to parametry druku muszą być idealnie dopasowane.\n\n(Druk 3D w szkole: komórka)\n\nCo ciekawe, takich modeli coraz częściej używa się również na uniwersytetach, w dodatku do prawdziwych okazów.\n\n- [Komórka roślinna](https://www.myminifactory.com/object/3d-print-multi-color-mini-plant-cell-60821) ⭐⭐ – czas druku: 4 godz. 40 min.; filament: 17,5 m; inne akcesoria: klej;\n- [Komórka zwierzęca](https://www.thingiverse.com/thing:2803322) ⭐⭐ – czas druku: 4 godz.; filament: 12,5 m; inne akcesoria: klej;\n- [Model ludzkiego serca](https://www.myminifactory.com/object/3d-print-anatomical-heart-34709) ⭐⭐ – czas druku: 15 godz.; filament: 13,02 m;\n- [Model ludzkiej czaszki](https://www.thingiverse.com/thing:4830026) ⭐⭐⭐ – czas druku: ok. 40+ godz.; filament: 165 m; inne akcesoria: klej, magnesy, wiertarka;\n\n#### Matematyka\n\n(Druk 3D w szkole: twierdzenie Pitagorasa)\n\nRekwizyty 3D można zastosować do zilustrowania uczniom zasad matematyki, a zwłaszcza geometrii. Kiedy uczniowie mają problem z wyobrażeniem sobie bryły w przestrzeni, na przykład dwudziestościanu foremnego, wystarczy dać im ją do ręki.\n\n- [Dwudziestościan foremny](https://www.thingiverse.com/thing:1343285/files) ⭐ – (skala 300%) czas druku: 30 minut.; filament: 2 m;\n- [Twierdzenie Pitagorasa](https://www.thingiverse.com/thing:245202/) ⭐⭐ – czas druku: 3 godz.; filament: 11 m;\n\n#### Geografia\n\n(Druk 3D w szkole: mapa Europy)\n\nZiemia nie jest płaska, co zdecydowanie warto uzmysłowić dzieciom. Krajobraz naszej planety jest bardzo zróżnicowany, a jego kaniony, wulkany, przepaście i inne naturalnie utworzone struktury można zilustrować przy pomocy rekwizytów 3D.\n\n- [Wulkany świata](https://www.thingiverse.com/thing:1316498) ⭐ – czas druku: średnio od 30 min. do 3 godz. każdy; filament: średnio od 1,5 m do 11 m każdy;\n- [Topograficzna mapa Europy](https://www.thingiverse.com/thing:5147240) ⭐⭐ – (skala 80%) czas druku: 4 godz. 20 min.; filament: 8 m;\n- [Erozja Wielkiego Kanionu](https://www.thingiverse.com/thing:2709566) ⭐⭐⭐ – czas druku podstawy: 12 godz.; filament: PLA 29 m i PVA 10 m; inne akcesoria: butelka 2l, nożyk do papieru, śrubokręt, taśma klejąca;\n\n#### Historia\n\n(Druk 3D w szkole: kamienny pięściak)\n\nWśród entuzjastów druku 3D jest wielu fanów historii starożytnej i współczesnej, czemu zawdzięczamy mnóstwo gotowych modeli o wysokiej jakości. Za te bardzo szczegółowe zazwyczaj trzeba zapłacić, ale czasem warto, zwłaszcza jeśli chcemy zobaczyć jak uczniowie zachwycają się nad pomysłowością swoich przodków.\n\n- [Pomnik bogini Sechmet](https://www.myminifactory.com/object/3d-print-sekhmet-96018) ⭐ – czas druku: 3 godz. 10 min.; filament: 11 m;\n- [Pięściak z paleolitu](https://www.myminifactory.com/object/3d-print-stone-handaxe-81793) ⭐⭐ – czas druku: 6 godz.; filament: 19 m;\n- [Koloseum](https://www.thingiverse.com/thing:962416/) ⭐⭐ – czas druku: 18 godz. 30 min.; filament: 36 m;\n\n#### Fizyka\n\nChociaż fizyka bada fundamentalne oddziaływania i właściwości naszego świata, nauka tego przedmiotu często sprowadza się tylko do teorii. Przy pomocy rekwizytów 3D można pokazać, że fizyka jest wokół nas, a jej teorie opierają się na prawdziwych zjawiskach. A jeśli mamy ochotę przybliżyć uczniom kosmos, a przy tym zrealizować naprawdę ambitny projekt, możemy wydrukować i zmontować model Układu Słonecznego.\n\n- [Balansujący ptak](https://www.myminifactory.com/object/3d-print-spinning-balancing-bird-6401) ⭐⭐ – czas druku: 2 godz. 35 min.; filament: 7 m;\n- [Układ Słoneczny](https://www.myminifactory.com/object/3d-print-model-solar-system-5505) ⭐⭐ – czas druku: 35+ godz.; filament: ok. 25 m;\n- [Planetarium Słońce - Ziemia - Księżyc](https://www.thingiverse.com/thing:3928677/files) ⭐⭐⭐ – czas druku: 35+ godz.; filament: ok. 21 m; inne akcesoria: śrubki i nakrętki;\n\n#### Sztuka\n\n(Druk 3D w szkole: Moai z Wyspy Wielkanocnej)\n\nChociaż drukarka 3D kojarzy się bardziej z inżynierią niż sztuką, w połączeniu z oprogramowaniem do projektowania można jej sprawnie używać do tworzenia oryginalnych dzieł. Co więcej, możemy dzięki niej wydrukować słynne rzeźby, pomniki i reliefy – ku zaskoczeniu wszystkich starożytnych mistrzów.\n\n- [Moai z Wyspy Wielkanocnej](https://www.myminifactory.com/object/3d-print-moai-head-on-easter-island-200530) ⭐ – czas druku: 2 godz.; filament: 6 m;\n- [Słynne paryskie budynki](https://www.thingiverse.com/thing:311002) ⭐ – czas druku: od 30 min. do 4 godz. 30 min. każdy; filament: od 0,7 m do 11 m każdy;\n- [Popiersie Heleny](https://www.myminifactory.com/object/3d-print-plaster-bust-of-helen-124529) ⭐⭐ – (skala 50%) czas druku: 5 godz.; filament: 14,2 m;",
      "summary": "Rozdział przedstawia przykładowe projekty rekwizytów 3D na lekcje STEAM, z oceną trudności w skali od ⭐ do ⭐⭐⭐ oraz z podanymi szacunkami czasu druku i zużycia filamentu PLA. Szacunki zostały wykonane dla drukarki Flashforge Adventurer 4 przy optymalnych ustawieniach, a rozdział podaje, że 1 m filamentu PLA 1.75 mm waży około 2,98 g i że w szpuli 1 kg jest około 335 m. W sekcjach dla biologii, matematyki, geografii, historii, fizyki i sztuki rozdział podaje konkretne modele z linkami, wraz z czasem druku (np. 4 godz. 40 min., 15 godz., 35+ godz., 40+ godz.) i długością filamentu (np. 17,5 m, 13,02 m, 165 m) oraz dodatkowymi akcesoriami, takimi jak klej, magnesy czy wiertarka.",
      "primary_questions": [
        "Jaką skalę trudności projektów rekwizytów 3D (od ⭐ do ⭐⭐⭐) wprowadza rozdział i co ma ona opisywać?",
        "Dla jakiej drukarki i przy jakich założeniach (ustawienia druku) oszacowano czas druku oraz ilość filamentu PLA w rozdziale?",
        "Jakie dwie wartości dotyczące filamentu PLA 1.75 mm podaje rozdział (masa 1 m i długość filamentu w szpuli 1 kg)?",
        "Jakie przykładowe modele z sekcji Biologia rozdział wymienia i jakie czasy druku oraz zużycie filamentu podaje dla wybranych pozycji (np. komórka, serce, czaszka)?",
        "Jakie rekwizyty 3D rozdział proponuje do matematyki i jakie parametry druku podaje dla dwudziestościanu foremnego oraz modelu twierdzenia Pitagorasa?",
        "Jakie modele do geografii wymienia rozdział i jakie dodatkowe akcesoria są wskazane przy projekcie Erozja Wielkiego Kanionu?",
        "Jakie przykłady rekwizytów z sekcji Fizyka i Sztuka wymienia rozdział i jakie czasy druku oraz ilości filamentu podaje dla wybranych pozycji?"
      ],
      "canonical_url": "https://www.robocamp.pl/pl/blog/druk-3d-robotyka-w-szkole/#rekwizyty-3d",
      "last_updated": "2022-04-08"
    },
    {
      "article_id": "3d-printing-in-school",
      "post_slug": "druk-3d-robotyka-w-szkole",
      "chapter_id": "5",
      "language": "pl",
      "heading": "Projektowanie 3D",
      "text": "## Projektowanie 3D\n\n(Uczeń używa drukarki 3D)\n\nWykorzystanie drukarki 3D do organizacji zajęć z projektowania 3D jest fenomenalnym pomysłem, jakkolwiek ambitnym, zwłaszcza z perspektywy nauczyciela.\n\nNa lekcji z projektowania 3D uczniowie tworzą model w oparciu o konkretne zadanie lub postawiony problem. Mogą go rozwiązywać samodzielnie lub w grupach, jednak projektowanie jest zadaniem jednoosobowym. Ukończone trójwymiarowe modele są przesyłane do nauczyciela, który następnie je drukuje i oddaje autorom do testowania. Jeżeli zachodzi taka potrzeba, uczniowie poprawiają swoje projekty i oddają je ponownie do druku. Wydrukowany model umożliwia rozwiązanie zadania.\n\n**Uczniowie rozwiązują problem przy pomocy nabytej wiedzy i własnych pomysłów. Obserwują jak stworzony przez nich trójwymiarowy obiekt zmienia się w rzeczywisty przedmiot, którego mogą dotknąć.** Efekt? Wzrost motywacji i sprawczości ucznia gwarantowany.\n\nTak wygląda jeden ze wzorcowych scenariuszy pracy z projektowaniem 3D. Niestety jest trudny do zrealizowania w warunkach szkolnych, choćby ze względu na ograniczenia techniczne, czyli czas drukowania modeli.\n\nProblemów jest więcej, a dobre chęci nie rozwiążą ich wszystkich.\n\n### Zalety\n\n#### Wysoka wartość edukacyjna\n\n**Używając drukarki 3D do nauki projektowania w trójwymiarze wykorzystujemy maksimum możliwości edukacyjnych sprzętu w warunkach szkolnych.** Pozwalamy dzieciom doświadczyć jego możliwości – nawet jeśli to nauczyciel drukuje projekty.\n\nProjektując w trójwymiarze uczniowie muszą poznać wirtualne środowisko pracy i nauczyć się korzystać z jego licznych funkcji. Zawiera elementy matematyki, rozwija wyobraźnię przestrzenną, a interfejs jest często po angielsku. Połączenie projektowania i druku 3D pomaga poznać różnice między projektem cyfrowym a rzeczywistym wydrukiem, a także ograniczenia technologiczne samej drukarki 3D. Wreszcie warto dodać, że jest to wyjątkowa okazja dla ucznia, żeby skonfrontować swoją nowatorską wizję z rzeczywistością.\n\n#### Rozwijanie kompetencji przyszłości\n\nKompetencje przyszłości są ważne, zwłaszcza dla uczniów. Trudno przewidzieć dokładnie jakie kwalifikacje będą pożądane na rynku pracy za kilkanaście lat, ale kompetencje przyszłości na pewno pomogą przyszłym pracownikom wykonywać zadania w środowisku pracy – pracodawcy dobrze o tym wiedzą.\n\n**Podczas zajęć projektowania 3D uczniowie nabywają umiejętności praktyczne i pożądane na rynku pracy na całym świecie.** Poznają podstawy projektowania trójwymiarowego, wykorzystują zdolności z różnych dziedzin naraz, pracują w wirtualnym środowisku i rozwiązują złożone problemy. Rozwijają samodzielność, myślenie abstrakcyjne i krytyczne, a oprócz tego mają okazję eksperymentować i wyciągać logiczne wnioski.\n\n#### Wsparcie kreatywności (Nauczyciel używa drukarki 3D)\n\nCoraz bardziej doceniamy nieszablonowe myślenie, ale rozwijanie tej umiejętności w szkole wcale nie jest proste. Aby rozwijać kreatywność, trzeba aktywnie tworzyć modele fizyczne. Projektowanie 3D to umożliwia, i to przy relatywnie niewielkich kosztach.\n\nDedykowana pracownia nie jest potrzebna, wystarczy sala informatyczna, gdzie każdy uczeń pracuje przy swoim komputerze lub laptopie. Za materiały wystarczy filament w kilku kolorach. Błędy nie są kosztowne, można je swobodnie poprawiać, a modele można ulepszać i personalizować.\n\nWszystko to jest w zasięgu ręki, jedyny wymóg to oswojenie się z procesem twórczym w środowisku cyfrowym.\n\n### Wady\n\n#### Specjalistyczne kwalifikacje i doświadczenie\n\nUczestniczenie w zajęciach z projektowania 3D brzmi magicznie, ale prowadzenie ich to inna bajka. Nie każdy nauczyciel da radę, między innymi ze względu na potrzebną wiedzę oraz doświadczenie.\n\nAbsolutne minimum to obeznanie z komputerem na poziomie swobodnego użytkowania i otwarcie na nowe technologie. Nie trzeba być cyfrowym tubylcem, ale podstawowa wiedza jest konieczna. Należy dobrze zapoznać się z oprogramowaniem do projektowania i slicerem, poznać ich funkcje, parametry i najczęstsze błędy. Jakby tego było mało, nauczyciel musi znać szkolną drukarkę 3D od podszewki – jak ją obsługiwać, jak naprawiać drobne usterki, jak dostosowywać parametry, żeby wydrukować jak najlepszy model.\n\n**W sumie jest to naprawdę mnóstwo wiedzy praktycznej, której w większości uczymy się projektując i korzystając ze sprzętu.** Potrzeba na to dużo chęci i jeszcze więcej czasu.\n\n#### Brak pomocy dydaktycznych\n\nNiedosyt pomocy dydaktycznych – zarówno po polsku, jak i po angielsku – to kolejny powód dla którego specjalne przygotowanie jest konieczne do prowadzenia lekcji z projektowania 3D.\n\n**Na moment pisania tego artykułu nie została jeszcze opracowana uniwersalna ścieżka edukacyjna projektowania 3D dla szkoły podstawowej.** Powstało kilka pozycji dydaktycznych na temat nauki projektowania, ale głównie w kontekście szkolnictwa wyższego i przygotowania zawodowego. Scenariuszy i inspiracji do lekcji stworzonych przez innych nauczycieli można szukać online, jednak są to materiały różne jakościowo, o różnym stopniu trudności, tworzone pod konkretne warunki. Trzeba je sprawdzić, a często także zmodyfikować pod potrzeby lekcji. Brak gotowych pomocy oznacza, że na nauczyciela spada również obowiązek stworzenia całego programu zajęć praktycznie od zera.\n\n#### Pracochłonność i czasochłonność\n\nProjektowanie 3D wymaga więcej czasu i pracy niż mogłoby się wydawać na pierwszy rzut oka.\n\n**Nauczyciel, oprócz przygotowania siebie i rozpisania programu zajęć, jest również odpowiedzialny za obsługę drukarki 3D, a więc drukowanie wszystkich projektów.** Najprawdopodobniej po lekcjach. Nie każdy wydruk wyjdzie, część trzeba będzie powtórzyć. Zakładając, że uczymy 12-osobową grupę, a każdy projekt drukuje się średnio 2 godziny, wychodzi cały weekend z drukarką.\n\nUczniowie też nie mają różowo. Pomysł zaprojektowania i wydrukowania własnego samochodzika brzmi ekscytująco, ale dopracowywanie projektu przez kilka tygodni, żeby działał i można go było w ogóle wydrukować jest trudne i… nudne. **Długie projektowanie bez namacalnych rezultatów powszednieje dzieciom i odbiera motywację do kontynuowania nauki.** Z kolei projektowanie bardzo prostych modeli jest przewrotne, bo kogo one zainteresują? Jakie zadanie pomogą rozwiązać? Na te pytania musi odpowiedzieć autor lekcji.\n\nBalansując między nudnawą prostotą a nieosiągalną wirtuozerią, nauczyciel musi stworzyć zajęcia, które będą zarówno ciekawe jak i wykonalne.",
      "summary": "Rozdział opisuje scenariusz zajęć, w którym uczniowie projektują modele 3D na podstawie zadania, przesyłają je nauczycielowi do druku, a następnie testują wydruki i w razie potrzeby poprawiają projekty do ponownego druku. Wskazuje zalety obejmujące wysoką wartość edukacyjną (m.in. naukę środowiska projektowego, elementy matematyki, wyobraźnię przestrzenną i często anglojęzyczny interfejs), rozwijanie kompetencji przyszłości oraz wsparcie kreatywności przy niewielkich kosztach organizacyjnych w sali informatycznej. Jednocześnie rozdział opisuje wady: konieczność specjalistycznych kwalifikacji nauczyciela (znajomość oprogramowania, slicera i drukarki), brak uniwersalnej ścieżki edukacyjnej dla szkoły podstawowej oraz dużą pracochłonność, ilustrowaną przykładem 12-osobowej grupy i średnio 2 godzin druku na projekt, co może oznaczać cały weekend z drukarką.",
      "primary_questions": [
        "Jakie etapy obejmuje opisany scenariusz lekcji projektowania 3D od zadania dla uczniów do testowania wydruków i ewentualnych poprawek?",
        "W jaki sposób w rozdziale zorganizowany jest podział ról między uczniami a nauczycielem w zakresie projektowania i drukowania modeli 3D?",
        "Jakie elementy nauki i umiejętności wymienia rozdział jako część projektowania w trójwymiarze (środowisko pracy, matematyka, wyobraźnia przestrzenna, język interfejsu)?",
        "Jak rozdział opisuje różnice między projektem cyfrowym a wydrukiem oraz jakie ograniczenia technologiczne drukarki 3D mają być dzięki temu poznawane?",
        "Jakie warunki organizacyjne dla zajęć (sala informatyczna, komputery/laptopy, filament w kilku kolorach, możliwość poprawek) podaje rozdział w części o kreatywności?",
        "Jakie minimalne kompetencje i przygotowanie nauczyciela opisuje rozdział w kontekście prowadzenia zajęć (oprogramowanie, slicer, parametry, usterki drukarki)?",
        "Jakie konkretne obciążenie czasowe drukowania projektów podaje rozdział w przykładzie 12-osobowej grupy i średnio 2 godzin druku na projekt?"
      ],
      "canonical_url": "https://www.robocamp.pl/pl/blog/druk-3d-robotyka-w-szkole/#projektowanie-3d",
      "last_updated": "2022-04-08"
    },
    {
      "article_id": "3d-printing-in-school",
      "post_slug": "druk-3d-robotyka-w-szkole",
      "chapter_id": "6",
      "language": "pl",
      "heading": "Robotyka 3D – czyli roboty i projektowanie 3D",
      "text": "## Robotyka 3D – czyli roboty i projektowanie 3D\n\n(Robot RoboCamp z klocków LEGO z wydrukowanymi akcesoriami)\n\nPołączenie robotyki edukacyjnej z projektowaniem 3D ma duży sens pod kątem edukacyjnym i organizacyjnym. Wprowadzenie drukarki 3D jednocześnie wzbogaca lekcje robotyki oraz upraszcza naukę projektowania w warunkach szkolnych.\n\nRozwiązuje też kilka opisanych wyżej problemów.\n\n**Jak to działa?** Nauczyciel prowadzi standardową lekcję robotyki, która obejmuje wprowadzenie, budowanie, badanie i programowanie robota, ale oprócz tego uczniowie otrzymują konkretne instrukcje jak krok po kroku zaprojektować element 3D umożliwiający wykonanie dodatkowych zadań z robotem. Ukończone projekty 3D są przesyłane do nauczyciela, który je drukuje i oddaje uczniom do testowania z robotem.\n\nWszystkie multimedialne instrukcje i modele są dostępne na platformie RoboCamp.\n\nDzieci projektują element, który ma rozwiązać konkretny (namacalny) problem nakreślony w ramach projektu. Poziom złożoności projektów jest dopasowany do wieku uczniów. Ponieważ roboty nie są duże, potrzebne elementy też będą niewielkie, co skraca czas drukowania.\n\n**Na każdym etapie nauczyciel i uczniowie mają dostęp do szczegółowych instrukcji krok po kroku, dzięki czemu poznawanie oprogramowania jest szybsze i prostsze, a błędy są popełniane rzadziej.** Nauczyciel ma też dostęp do gotowego projektu, z którego może skorzystać w razie potrzeby.\n\n{{ macro.embed_youtube('NCaoEN_z6fg') }}\n\nPrzykładowo, jeden projekt może obejmować zbudowanie i zaprogramowanie zdalnie sterowanego samochodu z klocków, oraz zaprojektowanie i wydrukowanie dla niego karoserii. Następnym razem uczniowie mogą stworzyć z klocków mechanizm turbiny wiatrowej, a w środowisku 3D zaprojektować dla niej wyjątkowy wirnik, który wydrukują i przetestują pod kątem wydajności. Każdy projekt można podzielić na kilka krótszych lekcji.\n\nProjekty już niebawem pojawią się na platformie RoboCamp. Kolejne będą dodawane systematycznie.\n\n(Robot RoboCamp z klocków LEGO z wydrukowanymi akcesoriami)\n\n**Co więcej, połączenie robotyki i projektowania 3D zapobiega wyczerpaniu motywacji uczniów przez problemy związane z estetyką i monotonią.** Samo projektowanie może nużyć, bo spędzamy w wirtualnym środowisku godziny zanim zobaczymy namacalny rezultat (który może niekoniecznie wyglądać tak, jak sobie wyobrażaliśmy). Na robotyce z elementami projektowania, nawet jeśli model zostanie zaprojektowany trochę krzywo, to dziecko i tak ma estetyczny dowód swojej ciężkiej pracy – działającego robota. Jest czym się pochwalić! Kiedy projektowanie jest fragmentem większego projektu, który częściowo tworzymy w środowisku wirtualnym, ale częściowo budujemy własnymi rękami, nie ma miejsca na nudę.\n\nA czego na takiej lekcji uczą się uczniowie? Programowanie, wyobraźnia przestrzenna, umiejętności manualne, elementy STEAM, projektowanie 3D, rozwiązywanie problemów, praca w grupie, praca samodzielna, kreatywność… i wiele więcej.\n\n**Połączenie robotyki i projektowania 3D to duże ułatwienie dla nauczyciela i osiągalny sposób na wykorzystanie drukarki 3D przez uczniów.** Projekt realizujemy na kilku lekcjach pod rząd. Dzięki multimedialnym instrukcjom krok po kroku wszyscy wiedzą co i jak mają zrobić, co znacząco ułatwia naukę. A raz wydrukowane modele można zatrzymać do pracy z kolejną grupą.\n\nZdecydowanie warto spróbować.\n\n## Lekcja w praktyce: projektowanie 3D i robot RoboCamp\n\nW teorii każdy pomysł jest dobry, dlatego o wiele ważniejsze jest jak sprawdzi się w praktyce. Dzięki poniższym filmikom możecie zobaczyć jak wygląda łączona lekcja robotyki i projektowania 3D przewidziana dla uczniów w wieku 12 lat i starszych.\n\nDo tej lekcji potrzebny będzie robot Manipulator zbudowany z klocków LEGO Education SPIKE Prime. Jeżeli chcecie zobaczyć jak tego robota zbudować i zaprogramować, zapraszamy na [kanał YouTube RoboCamp](https://www.youtube.com/user/robocamp/featured). Multimedialne instrukcje są oczywiście dostępne na platformie RoboCamp.\n\nLekcja czas start!\n\nZaczynamy od **wprowadzenia**, podczas którego pani Ola wyjaśnia czym jest prototypowanie, co ma do tego skalowanie, oraz gdzie są stosowane.\n\n{{ macro.embed_youtube('HVPwrQKH_y4') }}\n\n**Pierwszy projekt** to model beczki. Krok po kroku wyjaśniamy jak go zaprojektować od zera w programie Autodesk Fusion 360 na podstawie instrukcji dostępnych na platformie RoboCamp.\n\n{{ macro.embed_youtube('ktvEgaeEcYY') }}\n\n**Drugi projekt** 3D to kolba Erlenmeyera. Zaczniemy od dwuwymiarowego obrazu kolby, stworzymy jego obrys i zmienimy go w trójwymiarowe naczynie.\n\n**Pokazujemy też jak przygotować projekt do druku**: jak ustawić parametry slicera i jak kolba drukuje się w drukarce Flashforge Adventurer 3.\n\n{{ macro.embed_youtube('pHvYuU-AtpE') }}\n\n**Trzeci projekt** to ciężarek, czyli najcięższy model do zaprojektowania dla Manipulatora. Rysunek poglądowy można pobrać z platformy RoboCamp.\n\n{{ macro.embed_youtube('XtWT_zR24zk') }}\n\nWszystkie **3 rekwizyty wykorzystamy w pracy z robotem Manipulatorem**. Dotychczas przenosił tylko klocki, teraz ma trudniejsze zadanie! Aby umożliwić robotowi przenoszenie wydrukowanych obiektów, zmodyfikujemy jego program oraz budowę chwytaka.\n\n{{ macro.embed_youtube('1DKCzOyLPbI') }}",
      "summary": "Rozdział opisuje połączenie robotyki edukacyjnej z projektowaniem 3D, w którym nauczyciel prowadzi standardową lekcję robotyki (wprowadzenie, budowanie, badanie i programowanie), a uczniowie projektują element 3D do wykonania dodatkowych zadań z robotem. Ukończone projekty są przesyłane do nauczyciela do druku i testowane przez uczniów z robotem, przy czym rozdział podkreśla dostęp do instrukcji krok po kroku oraz gotowych projektów na platformie RoboCamp, co ma skracać czas nauki i ograniczać liczbę błędów. W części „Lekcja w praktyce” opisano zestaw filmów dla uczniów w wieku 12 lat i starszych, pracę z robotem Manipulator z klocków LEGO Education SPIKE Prime oraz trzy projekty (beczka, kolba Erlenmeyera i ciężarek) przygotowywane m.in. w Autodesk Fusion 360 i drukowane po ustawieniu parametrów slicera dla drukarki Flashforge Adventurer 3.",
      "primary_questions": [
        "Jakie cztery elementy obejmuje standardowa lekcja robotyki prowadzona przez nauczyciela w opisie połączenia z projektowaniem 3D?",
        "Jaką rolę pełnią instrukcje krok po kroku i gotowe projekty na platformie RoboCamp według rozdziału?",
        "Dlaczego rozdział wskazuje, że elementy projektowane do robotów są niewielkie i jak to wpływa na czas drukowania?",
        "Jakie dwa przykłady projektów łączących klocki i druk 3D podaje rozdział (samochód z karoserią oraz turbina wiatrowa z wirnikiem)?",
        "Jak rozdział opisuje wpływ połączenia robotyki i projektowania 3D na motywację uczniów w kontekście estetyki, monotonii i namacalnego rezultatu?",
        "Dla jakiej grupy wiekowej przewidziano opisaną lekcję w praktyce oraz jaki robot jest do niej potrzebny (Manipulator z LEGO Education SPIKE Prime)?",
        "Jakie trzy projekty 3D realizowane w części „Lekcja w praktyce” wymienia rozdział (beczka, kolba Erlenmeyera, ciężarek) i z jakim oprogramowaniem oraz drukarką są powiązane?"
      ],
      "canonical_url": "https://www.robocamp.pl/pl/blog/druk-3d-robotyka-w-szkole/#robotyka-3d-czyli-roboty-i-projektowanie-3d",
      "last_updated": "2022-04-08"
    },
    {
      "article_id": "3d-printing-in-school",
      "post_slug": "druk-3d-robotyka-w-szkole",
      "chapter_id": "7",
      "language": "pl",
      "heading": "Jak przygotować się do pracy z drukarką 3D",
      "text": "## Jak przygotować się do pracy z drukarką 3D\n\n(Naczyciel obsługuje drukarkę 3d)\n\nDrukowanie 3D w szkole można wykorzystać na kilka sposobów, na przykład jako [fabrykę rekwizytów](https://www.robocamp.pl/pl/blog/druk-3d-robotyka-w-szkole/#rekwizyty-3d), narzędzie [do nauki projektowania](https://www.robocamp.pl/pl/blog/druk-3d-robotyka-w-szkole/#projektowanie-3d), czy [w kontekście robotyki](https://www.robocamp.pl/pl/blog/druk-3d-robotyka-w-szkole/#robotyka-3d-czyli-roboty-i-projektowanie-3d). Każdy z nich ma swoje plusy i minusy. Niezależnie który wybierzemy, do pracy z drukarką 3D warto się przygotować.\n\n**Po pierwsze, jeżeli masz taką możliwość, koniecznie weź udział szkoleniu na temat obsługi swojej drukarki 3D.** Najlepiej jeśli będzie poświęcone dokładnie temu modelowi, który masz w szkole. Powinno wyjaśniać większość podstaw pracy z drukarką: uruchomienie, obsługę oprogramowania, podstawowe ustawienia i parametry, rodzaje filamentu, itp. Po merytorycznym szkoleniu powinieneś umieć załadować i wymienić filament, wydrukować model z pliku, a nawet rozwiązać proste usterki. Oczywiście dodatkowe przeczytanie instrukcji obsługi drukarki na pewno nie zaszkodzi.\n\n**Szkolenie daje wartościową wiedzę, ale najwięcej uczymy się pracując ze sprzętem samodzielnie. Dlatego drukuj, drukuj, drukuj!** Nie czekaj, aż pretekst do użycia drukarki 3D pojawi się sam – wymyśl jakiś już dziś. Znajdź efektowny model, który chcesz postawić na swoim biurku, wypoziomuj stół drukarki, zobacz jak działają ekstruder i dysza. Prędzej lub później coś się zatka, zamiast modelu piramidy wydrukujesz spaghetti, a na ekranie pojawi się komunikat o błędzie – i za każdym razem nauczysz się czegoś nowego. Pamiętaj, że drukarka 3D to przede wszystkim narzędzie, nie eksponat, i powstała po to żeby jej używać.\n\n**Kiedy już zapoznasz się z drukarką i slicerem, postaw na gotowe materiały edukacyjne.** Jeszcze przyjdzie czas na wcielanie własnych pomysłów w życie. Najpierw pracuj z materiałami i scenariuszami lekcji, które wypróbowali inni. W ten sposób zwiększasz szansę na sukces, oszczędzasz swoje nerwy i czas, masz też okazję przekonać się co działa w praktyce. Do tworzenia własnych materiałów zabierz się dopiero gdy poczujesz się pewnie w pracy z drukiem 3D. Potknięcia się zdarzają i zdarzać będą, ale dzięki wcześniejszemu doświadczeniu będziesz wiedzieć co poszło nie tak.\n\n**Na sam koniec najważniejsze – przygotuj się mentalnie.** Przygotuj się na błędy, niewiedzę, sporadyczną panikę i godziny patrzenia jak układa się filament. Bądź cierpliwy, wyrozumiały dla siebie oraz dla niedoskonałości zaawansowanego technologicznie sprzętu. Daj sobie czas. Przygotuj się na to, że uczniowie – cyfrowi tubylcy – mogą czasem wiedzieć więcej od Ciebie, a ich rady mogą okazać się pomocne. Doceń ich zainteresowanie. Przygotuj się na niewiedzę kolegów i koleżanek, którzy nie obsługują drukarki 3D i nie rozumieją dlaczego niektórych rzeczy po prostu nie da się wydrukować. Wyjaśnij im to, zaproś do współpracy. Może pomogą?\n\nW miarę regularnego drukowania zauważysz, że idzie Ci coraz lepiej. Druki wychodzą coraz ładniejsze, eksperymentujesz z bardziej złożonymi projektami i już się nie boisz, bo znasz drukarkę na tyle, że wiesz jak działa i jak naprawić małe usterki. Innym użytkownikom – nauczycielom oraz uczniom – umiesz dobrze doradzić jak najlepiej wydrukować złożony model. Na szkolnych korytarzach chodzą słuchy, że jesteś ekspertem od druku 3D. Gratulacje!\n\nWszystko to jest osiągalne, ale – powtórzmy raz jeszcze – potrzeba dużo czasu i dużo chęci.\n\n[(Kup scenariusze lekcji robotyki projektowania 3D)](https://www.robocamp.pl/pl/lessons/)",
      "summary": "Rozdział wskazuje, że drukowanie 3D w szkole może służyć jako fabryka rekwizytów, narzędzie do nauki projektowania lub element lekcji robotyki, i podkreśla potrzebę przygotowania do pracy z drukarką. Zaleca udział w szkoleniu najlepiej dopasowanym do konkretnego modelu drukarki, obejmującym uruchomienie, obsługę oprogramowania, ustawienia i parametry oraz rodzaje filamentu, po którym użytkownik powinien umieć m.in. wymienić filament, wydrukować model z pliku i rozwiązać proste usterki. Rozdział zachęca do samodzielnej praktyki (m.in. poziomowanie stołu, obserwacja ekstrudera i dyszy oraz uczenie się na błędach typu „spaghetti”), korzystania z gotowych materiałów edukacyjnych oraz przygotowania mentalnego na błędy, długi czas pracy i współpracę z uczniami oraz innymi nauczycielami.",
      "primary_questions": [
        "Jakie trzy sposoby wykorzystania druku 3D w szkole wymienia rozdział (rekwizyty, nauka projektowania, robotyka) i jak je łączy z przygotowaniem do pracy z drukarką?",
        "Jakie elementy powinno obejmować szkolenie z obsługi drukarki 3D według rozdziału (uruchomienie, oprogramowanie, ustawienia, parametry, rodzaje filamentu)?",
        "Jakie konkretne umiejętności po szkoleniu powinien mieć nauczyciel lub użytkownik drukarki 3D według rozdziału (wymiana filamentu, wydruk z pliku, proste usterki)?",
        "Jakie przykładowe działania praktyczne rozdział proponuje na start pracy z drukarką (wybór modelu, poziomowanie stołu, sprawdzenie ekstrudera i dyszy)?",
        "Jakie typowe problemy podczas nauki druku 3D rozdział opisuje jako spodziewane (zatkanie, „spaghetti”, komunikat o błędzie) i jaki ma być ich efekt edukacyjny?",
        "Dlaczego rozdział zaleca korzystanie z gotowych materiałów i scenariuszy lekcji przed tworzeniem własnych oraz co to ma dać nauczycielowi?",
        "Na jakie elementy przygotowania mentalnego rozdział zwraca uwagę (błędy, niewiedza, panika, czas, rola uczniów, współpraca z kolegami) w pracy z drukarką 3D?"
      ],
      "canonical_url": "https://www.robocamp.pl/pl/blog/druk-3d-robotyka-w-szkole/#jak-przygotowac-sie-do-pracy-z-drukarka-3d",
      "last_updated": "2022-04-08"
    }
  ]
}
