{
  "chapters": [
    {
      "article_id": "3d-printing-in-school",
      "post_slug": "3d-printing-in-school",
      "chapter_id": "1",
      "language": "en",
      "heading": "Introduction",
      "text": "3D printers are becoming increasingly common in schools across North America, especially in STEM labs, makerspaces, and technology classrooms. Many schools already have the equipment set up, filaments waiting in storage, and at least one enthusiastic teacher who has taken the lead on managing 3D printing activities. In theory, everything is ready.\n\n**But how can this equipment be used effectively during actual lessons with students?**\n\nUnfortunately, clear guidance on the practical classroom use of 3D printing is still limited. While the hardware may be available, many schools are still figuring out how to integrate it into daily teaching – what kind of preparation is needed, what educational materials to use, and what 3D printing in everyday school practice should really look like.\n\nThat’s why in this article, based on our own experiences and academic work published by educators from around the world over the past few years, we analyze how 3D printing can truly be used in primary school – what the real possibilities and educational limitations of a 3D printer are.\n\nRead on to discover what’s possible with a 3D printer in the classroom. Explore the advantages and challenges of different teaching approaches – and get a taste of how your lesson with a 3D printer could look like, challenges included.\n\n**If you want to start using your school’s 3D printer, this article is for you.**",
      "summary": "3D printers are increasingly present in North American schools, particularly in STEM labs, makerspaces, and technology classrooms, yet their effective use during lessons remains unclear. Although many schools already have equipment, filament, and a designated teacher, there is still a lack of practical guidance, ready-to-use materials, and clear models for everyday classroom integration. The article is based on the authors’ own teaching experiences and academic research published by educators worldwide. It aims to examine realistic possibilities and educational limitations of using a 3D printer in primary school settings.",
      "primary_questions": [
        "In which types of school environments are 3D printers most commonly found according to the introduction?",
        "What practical challenges do schools face despite already having 3D printing equipment available?",
        "Why is there still limited guidance on how to use 3D printers effectively during lessons?",
        "What sources of knowledge does the article draw on to analyze 3D printing in primary education?",
        "What aspects of 3D printer use in schools does the article promise to examine in detail?"
      ],
      "canonical_url": "https://www.robocamp.eu/en/blog/3d-printing-in-school#intro",
      "last_updated": "2025-06-11"
    },
    {
      "article_id": "3d-printing-in-school",
      "post_slug": "3d-printing-in-school",
      "chapter_id": "2",
      "language": "en",
      "heading": "Myths About 3D Printing in School",
      "text": "## Myths About 3D Printing in School\n\n(Myths about 3D printing)\n\nA few seconds online is enough to find tons of articles describing the many advantages and supposedly endless possibilities of 3D printers. Usually, these are marketing texts sponsored by manufacturers. Few of them discuss the limitations of these devices, let alone problem-solving.\n\nThat’s why before you read about ways to use a 3D printer in school, we need to dispel a few popular myths.\n\n#### 3D Printing is fast, easy, and educational\n\n**The printing process is neither educational, nor fast, nor trouble-free.** Regardless of the printer model. Printing a single 3D model takes a long time, even if the process is easy to understand. Having students watch the entire printing process is unnecessary – actually, it is discouraged.\n\nWhat’s more, you have to reckon with the fact that not every print will work the first time, even if the project is flawless. The nozzle can clog, the model can detach from the print bed, a layer can print incorrectly… In most cases, the error has to be diagnosed, fixed, and the model printed again from scratch.\n\n#### 3D printer is student equipment\n\nA 3D printer is primarily a tool for the teacher, not the student. This is a natural consequence of the long print times and the responsibility for operating and maintaining the equipment.\n\nSo if a school plans to let students operate the 3D printer on their own, e.g. as part of an extracurricular club, it is worth considering purchasing two cheaper units instead of one more advanced machine.\n\n#### Everyone is ready for 3D printing in school\n\nFirst, not every school has immediate access to 3D printers. Accessibility is improving year by year, but still, it varies greatly throughout the North America. Fortunately grants, partnerships, and shared lab spaces are making them increasingly attainable.\n\nSecond, some schools have a 3D printer and simply don't use it. **The educational possibilities of 3D printers are indeed valuable, however they have not yet been adapted to mainstream education.** There is a lack of high-quality materials, a tried-and-true curriculum, textbooks, training, and even lesson plans – right now, nearly everything falls on the teacher’s shoulders.\n\nThere are lots of 3D models, but they are scattered across different repositories and vary in quality, so finding the right model for a lesson also takes a lot of time.\n\n#### Teachers will motivate themselves\n\nSupport for teachers working with this equipment is very important. Initial enthusiasm inevitably wanes in the face of real difficulties with using a 3D printer, like time needed to prepare lessons, failed prints, maintenance, troubleshooting, the learning curve of this technology... And let’s remember, the teacher plays a key role here.\n\n**To make 3D printing really accessible for students, teachers need administrative support, access to professional development, but also straightforward everyday motivation that comes from people around them.**\n\nIt’s worth encouraging more than one teacher in a school to use the printer – peer support and the opportunity to compare experiences are cited by teachers as some of the most important motivations for continuing 3D printing projects.\n\n#### Students will achieve better academic results\n\nThose directly involved in classes with a 3D printer (teachers and students) notice an increase in motivation and engagement at the beginning, but **there is still a lack of reliable data on the relationship between the use of this equipment and measurable academic progress**. The studies published so far involve small groups and do not account for mainstream education. The most optimistic forecasts come from printer manufacturers – but that’s probably no surprise.\n\n**The truth is that a 3D printer in a school setting is a tool with great potential, but it’s hard to predict how it will perform with your students – a lot depends on how exactly you use it.**\n\nNow you can consider how you want to use this tool in practice. There are  two obvious directions: [printing props](https://www.robocamp.eu/en/blog/3d-printing-in-school/#3d-props-for-lessons) and [learning design](https://www.robocamp.eu/en/blog/3d-printing-in-school/#3d-design).\n\nIf you're already familiar with them, skip ahead to [3D robotics](https://www.robocamp.eu/en/blog/3d-printing-in-school/#3d-robotics-designing-parts-for-robots) – our take on combining educational robotics with 3D design in a way that's easier to achieve in school.",
      "summary": "This chapter challenges common myths about 3D printing in schools, including the belief that printing is fast, easy, and inherently educational. It explains that print times are long, failures are common, and students should not be expected to operate printers independently due to technical and safety responsibilities. The text highlights limited access to printers, the lack of ready-made curricula and teaching materials, and the heavy burden placed on teachers. It also notes that while motivation may initially increase, there is no strong evidence yet linking 3D printing to improved academic results.",
      "primary_questions": [
        "Why is the 3D printing process described as neither fast nor educational in a classroom setting?",
        "What technical problems commonly occur during 3D printing at school?",
        "Why is a 3D printer considered primarily a teacher’s tool rather than student equipment?",
        "What limitations prevent 3D printing from being widely adopted in mainstream education?",
        "What does existing research say about the impact of 3D printing on students’ academic results?",
        "Why is teacher support and peer collaboration important for sustaining 3D printing projects?"
      ],
      "canonical_url": "https://www.robocamp.eu/en/blog/3d-printing-in-school#myths-about-3d-printing-in-school",
      "last_updated": "2025-06-11"
    },
    {
      "article_id": "3d-printing-in-school",
      "post_slug": "3d-printing-in-school",
      "chapter_id": "3",
      "language": "en",
      "heading": "3D Props for Lessons",
      "text": "## 3D Props for Lessons\n\n(Models 3D printed by RoboCamp team)\n\nWherever in the world you're reading this article, the chances are you've seen them. It’s the most commonly cited use for 3D printers in general education. It’s understandable, because it easily fits into traditional teaching, it's accessible to teachers of various subjects, and it's uncomplicated to implement. Unfortunately, the educational value for students is limited.\n\n**3D props are simply objects printed on a 3D printer that can be used in the context of a lesson in virtually any school subject. The prop must relate to the lesson topic.** Its objective is to bring the topic closer to students and facilitate the assimilation of knowledge, in very broad terms.\n\nThe exact impact of 3D props on the learning process is discussed in the [advantages](https://www.robocamp.eu/en/blog/3d-printing-in-school/#advantages) and [disadvantages](https://www.robocamp.eu/en/blog/3d-printing-in-school/#disadvantages) sections of this section.\n\nDuring lessons, they can be used as exhibits to view up close, passed from hand to hand, or as an integral part of tasks that students are meant solve. Even if they break by accident, no worries – just print them again.\n\n**Where do you get 3D props?** Simply search for the desired object (preferably in English) in online 3D libraries. Many models are available for free download, but for more complex ones, you often need to pay a one-time fee. We’ve listed some [interesting 3D models below](https://www.robocamp.eu/en/blog/3d-printing-in-school/#selected-3d-models-for-steam-lessons-we-tried-ourselves). It’s worth reading comments, checking if someone has printed a given model before, and whether they shared useful tips. Once you find the perfect candidate, download the file in STL format, load it into your slicer, and print it.\n\nVoilà! One 3D prop ready for your lesson.",
      "summary": "3D props are the most common way schools use 3D printers, as they fit easily into traditional lessons and can be applied across many subjects. These props are printed objects directly related to lesson topics and are meant to support understanding rather than teach 3D printing itself. They can be handled by students during lessons and easily reprinted if damaged. Teachers typically source them from online 3D libraries, where models vary in complexity, quality, and cost.",
      "primary_questions": [
        "What makes 3D props the most commonly cited use of 3D printers in schools?",
        "How are 3D props defined in the context of classroom lessons?",
        "In what ways can students interact with 3D props during a lesson?",
        "Why is the educational value of 3D props described as limited for students?",
        "Where can teachers find ready-made 3D models for lesson props?",
        "What practical steps are involved in preparing a 3D prop for a lesson?"
      ],
      "canonical_url": "https://www.robocamp.eu/en/blog/3d-printing-in-school#3d-props-for-lessons",
      "last_updated": "2025-06-11"
    },
    {
      "article_id": "3d-printing-in-school",
      "post_slug": "3d-printing-in-school",
      "chapter_id": "4",
      "language": "en",
      "heading": "Advantages of 3D Props for Lessons",
      "text": "### Advantages\n\n#### Increased interest in the subject\n\nGadgets are cool – and gadgets used for learning are not only cool, but also useful. They spark students’ curiosity and encourage them to explore the subject further.\n\nClasses where children use extra equipment or teaching aids will always be more exciting than lessons based solely on traditional textbooks. More motivation means more effective learning – at least in the short term. Furthermore, three-dimensional props also help illustrate concepts discussed in class, showing students a new, more accessible side of the subject – one that’s literally within their reach.\n\n#### Additional stimulation\n\nEvery teacher knows that using diverse methods of conveying knowledge in class increases students' chances of remembering the lesson material. This stems from two factors: the level of stimulation and individual preferences for absorbing information.\n\nMaterial presented solely in text form will engage a limited group of students. Adding images or videos expands that group, and incorporating kinesthetic elements – things that can be touched, held in the hands, and viewed from all sides – ensures that most of the group will be actively engaged. Students will be more involved, which can positively impact how well they retain the material.\n\n#### Low production cost\n\nA classroom filled with fascinating educational accessories is a beautiful sight – especially if everyone can use those accessories. Unfortunately, many of these aids are expensive, so even if the school tightens its belt and adds them to the classroom, they may collect dust on shelves for fear of damage.\n\nPrinting your own aids avoids this issue. The only cost is the purchase of PLA filament, and from one spool you can print many different models. And if someone accidentally destroys one of the props – no problem, just print a new one!\n\nThe only catch is quality. To create high-quality accessories comparable to specialized ones, you need to invest a lot of time and personal effort in finishing them.",
      "summary": "Using 3D props can increase students’ interest by making lessons more engaging than textbook-only teaching. Physical models provide additional stimulation by combining visual, textual, and kinesthetic learning, which helps students remember material more effectively. Producing props with a 3D printer is relatively low-cost, requiring mainly PLA filament. However, achieving high-quality results often demands extra time and effort from the teacher.",
      "primary_questions": [
        "How do 3D props influence students’ motivation during lessons?",
        "Why are lessons with additional teaching aids described as more engaging than textbook-based classes?",
        "How does multisensory stimulation affect students’ ability to remember lesson material?",
        "What costs are involved in producing 3D props with a printer?",
        "Why does creating high-quality 3D props require additional teacher effort?"
      ],
      "canonical_url": "https://www.robocamp.eu/en/blog/3d-printing-in-school#advantages",
      "last_updated": "2025-06-11"
    },
    {
      "article_id": "3d-printing-in-school",
      "post_slug": "3d-printing-in-school",
      "chapter_id": "5",
      "language": "en",
      "heading": "Disadvantages of 3D Props for Lessons",
      "text": "### Disadvantages\n\n(Failed 3D print)\n\n#### No contact with the 3D printer\n\nThe selection and printing of props is the teacher's responsibility. They have to go through the entire process, understand each step, and resolve any problems encountered. The student only interacts with the final result – the printed model. How the model was made doesn’t matter to them, because the goal isn’t to learn about 3D printing, but to use the model during the lesson.\n\n**In other words, educational 3D props won’t teach students anything about 3D printing or 3D design.** Students won’t see how intricate constructions gradually emerge from a modest filament, won’t experience the hardware’s limitations, won’t learn how settings affect the print, won’t get a chance to design in 3D themselves – and some may not even lay eyes on the printer.\n\nUnfortunately, if the 3D printer is used only to make props, it becomes an exclusive tool for the teacher.\n\n#### Low educational value\n\nThe educational potential of 3D printing has been loudly praised for several years, especially regarding the development of future competencies and preparation for work with advanced technologies. However, to realize such goals, students need more than printed models. Proper conditions are necessary – conditions in which students can interact with the software and hardware and begin to use them independently.\n\nOf course, creating such conditions is a challenge, especially when experience is minimal and the curriculum isn’t flexible. Nevertheless, it’s hard to shake the impression that **using a 3D printer in school solely as a mini-factory of ready-made models is a wasted opportunity**.\n\n#### Limited application\n\nIt’s important to remember that 3D printer won’t print everything. With 3D props, you can show form, structure, and proportion. However, printed models will differ from the originals in material, detail, weight, smell, often size, and flexibility.\n\nYou are also limited by the printer's build area and printing time.",
      "summary": "When 3D printers are used only to produce props, students have no direct contact with the printer or the design process. This approach limits educational value because students do not learn about 3D printing, software, or hardware constraints. Relying on printed models alone can undermine the broader potential of digital fabrication in education. Additionally, 3D props have practical limitations related to material properties, printer size, and long printing times.",
      "primary_questions": [
        "Why do students have no contact with the 3D printer when it is used only for props?",
        "What aspects of 3D printing are students missing when they only use finished models?",
        "Why is using a 3D printer solely as a prop factory considered a wasted opportunity?",
        "What technical and material limitations affect the usefulness of 3D props?",
        "How do build area and printing time constrain what can be produced as a 3D prop?"
      ],
      "canonical_url": "https://www.robocamp.eu/en/blog/3d-printing-in-school#disadvantages",
      "last_updated": "2025-06-11"
    }
  ]
}
