{
  "chapters": [
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-recenzja",
      "chapter_id": "1",
      "language": "pl",
      "heading": "Wprowadzenie: czym jest LEGO Education Science",
      "text": "Nowa seria produktów dla edukacji – LEGO® Education Science – weszła na światowy rynek. Jej głównym założeniem jest wspieranie nauki STEM poprzez pracę bezekranową, co odróżnia serię Science od dominujących na rynku narzędzi serii LEGO Learning System (czyli SPIKE Prime i SPIKE Essential).\n\nChociaż **LEGO Science z założenia nie przewiduje nauki programowania na swoich lekcjach**, to konstrukcje budowane przez uczniów zawierają działające elementy elektroniczne. Pozwalają wprawić modele w ruch poprzez preprogramowane sekwencje ruchów wybieranych za pomocą tzw. kart połączeń.\n\nMamy zatem do czynienia z czymś pomiędzy dwiema ścieżkami w dotychczasowym systemie dydaktycznym LEGO Education – dzieci tworzą mechanizmy, które są zasilane i można je wprawiać w ruch, ale nie programować. Będzie to zatem ruch obarczony sporymi ograniczeniami.\n\n**LEGO Education Science to wygodne „plug-and-teach” dla przyrody i edukacji wczesnoszkolnej: gotowe, 45-minutowe lekcje bez ekranów i bez kodowania.** Daje powtarzalne eksperymenty „z pudełka” i materiały dla nauczyciela, ale **kosztem swobody konstrukcji i rozwoju kompetencji inżynierskich**. Zestaw ułatwia zrobienie mini-eksperymentu w 45 minut, ale celowo ogranicza swobodę konstrukcji i według producenta nie służy do programowania – choć aplikacja do programowania zestawu istnieje.\n\nJeśli Twoim priorytetem są szybkie, gotowe lekcje z zakresu przedmiotów matematyczno-przyrodniczych – polubisz Science. Jeśli chcesz rozwijać kreatywność inżynierską i pracować z kodem – prędzej odnajdziesz się na lekcjach ze SPIKE.\n\n(Bird nest robot built by RoboCamp from LEGO Education Science bricks)\n\n- **Dla kogo:** nauczyciele edukacji wczesnoszkolnej/przyrody/fizyki, szkoły bez zaplecza IT, klasy młodsze, szybkie zastępstwa.\n- **Co daje:** gotowe scenariusze, bezekranowe demonstracje, spójny przebieg lekcji, łatwy start.\n- **Kompromisy:** domyślny brak programowania, ograniczona kreatywność modeli, praca w 4-os. grupach.\n- **Alternatywy:** SPIKE (także do prostych demonstracji offline), ewentualnie BricQ Motion dla mechaniki/projektów.\n- **Wniosek:** wygoda i gotowość > elastyczność i rozwój inżynierski.\n\nSkąd takie wnioski? [Czy opłaca się kupić LEGO Science](https://www.robocamp.pl/pl/blog/lego-science-recenzja/#cena-i-opacalnosc-lego-science)? [Czy ten zestaw będzie najlepszy dla Ciebie?](https://www.robocamp.pl/pl/blog/lego-science-recenzja/#wnioski-czy-lego-science-jest-dla-ciebie)\n\nPrzeczytaj całą recenzję lub kliknij na rozdział, który Cię interesuje.",
      "summary": "Rozdział wprowadza serię LEGO® Education Science jako narzędzie do nauki STEM w trybie bezekranowym, pozycjonowane obok LEGO Learning System (SPIKE Prime i SPIKE Essential). Science nie przewiduje nauki programowania na lekcjach, ale modele zawierają działające elementy elektroniczne uruchamiane preprogramowanymi sekwencjami przez karty połączeń. Autorzy opisują produkt jako „plug-and-teach” z gotowymi, 45-minutowymi lekcjami oraz wskazują kompromisy, m.in. ograniczoną swobodę konstrukcji i pracę w 4-osobowych grupach.",
      "primary_questions": [
        "Jakie główne założenie serii LEGO® Education Science odróżnia ją od narzędzi z LEGO Learning System, takich jak SPIKE Prime i SPIKE Essential?",
        "W jaki sposób uczniowie wprawiają modele LEGO Science w ruch, jeśli lekcje z założenia nie obejmują programowania?",
        "Jak autorzy opisują miejsce LEGO Education Science pomiędzy dwiema ścieżkami dydaktycznymi LEGO Education: mechaniką z ruchem a programowaniem?",
        "Jakie elementy składają się na obietnicę „plug-and-teach” w kontekście 45-minutowych lekcji bez ekranów i bez kodowania?",
        "Jakie kompromisy wskazano wprost w punktach (m.in. brak programowania, kreatywność modeli, praca w 4-os. grupach)?",
        "Jakie alternatywy dla LEGO Science wymieniono i w jakim kontekście (SPIKE, BricQ Motion)?"
      ],
      "canonical_url": "https://www.robocamp.pl/pl/blog/lego-science-recenzja#wprowadzenie-czym-jest-lego-education-science",
      "last_updated": "2025-11-11"
    },
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-recenzja",
      "chapter_id": "2",
      "language": "pl",
      "heading": "Zawartość zestawu",
      "text": "## Zawartość zestawu\n\n### Pudełko\n\nNowe pudełka Science wypadają słabiej od solidnych pojemników z serii LEGO Learning System. Wykonano je z tańszego, bardziej giętkiego i podatnego na pęknięcia plastiku. Plusem są mniejsze wymiary pudełek, co pozwala zaoszczędzić nieco miejsca w szkolnych szafkach i magazynkach.\n\nPudełko nie zawiera domyślnego systemu sortowania ułatwiającego porządkowanie elementów. Jest za to jedna wyjmowana ścianka, a więc mamy ograniczoną możliwość samodzielnego regulowania dwóch przegródek, co pozwala w pewnym stopniu dopasować wnętrze pudełka do własnych potrzeb.\n\n(LEGO Science box with elements inside)\n\n### Zestawy główne i pakiety Classroom bundle\n\nSeria Science obejmuje **trzy zestawy** konstrukcyjne przeznaczone dla różnych grup wiekowych. Każdy zestaw jest przeznaczony dla grupy czworga dzieci i zawiera trzy papierowe książeczki z instrukcjami budowy w pudełku.\n\n#### Science Kit K-2 (45620)\n\n- dla dzieci od 5 do 7 roku życia\n- 277 elementów konstrukcyjnych\n- 1 element elektroniczny: podwójny silnik\n- przewód USB-C do ładowania\n- 329,95 USD\n\n#### Science Kit 3-5 (45621)\n\n- dla dzieci od 8 do 10 roku życia\n- 336 elementów konstrukcyjnych\n- 2 elementy elektroniczne: podwójny silnik oraz bezprzewodowy kontroler\n- przewód USB-C do ładowania\n- 2 karty połączeń\n- 399,95 USD\n\n#### Science Kit 6-8 (45622)\n\n- dla dzieci od 11 do 14 roku życia\n- 424 elementy konstrukcyjne\n- 4 elementy elektroniczne: pojedynczy silnik, podwójny silnik, czujnik koloru i bezprzewodowy kontroler\n- przewód USB-C do ładowania\n- 3 karty połączeń\n- 499,95 USD\n\nZestawy Science można kupować pojedynczo, lub w pakietach Classroom Bundle po 6 sztuk. Zakup pakietu jest minimalnie korzystniejszy cenowo, ale otrzymujemy kilka dodatków: multi-ładowarki (od 1 do 3), zestaw części zapasowych i 8 dodatkowych kart połączeń w przypadku Classroom bundle 3-5 oraz 6-8.\n\nLEGO gwarantuje też dostęp do obszernego Teacher Portal z materiałami dydaktycznymi dla nauczyciela, które są kompatybilne z trzema zestawami z serii Science. [Więcej o materiałach piszemy poniżej](https://www.robocamp.pl/pl/blog/lego-science-recenzja/#praca-z-zestawem-i-materiay-dydaktyczne).\n\n### Klocki konstrukcyjne\n\nZestawy utrzymane są w wesołej ale stonowanej palecie barw, gdzie dominują klocki turkusowe, brązowe, i jaskrawo koralowe. Specyficzna paleta wybrana tak, by odróżnić serię Science od innych zestawów LEGO Education.\n\nSame klocki są dość wyraziste, ale materiały są już w zgaszonych barwach. Wpisują się w trend desaturacji kolorów, który powstał w odpowiedzi na powszechne przestymulowanie zarówno dzieci, jak i dorosłych. Wątpliwe, żeby klocki działały uspokajająco, ale ten wybór na pewno przemawia do dorosłych – którzy decydują o zakupie.\n\n**W pudełku znajdziemy zdecydowanie więcej klocków typu System** (study) niż klocków typu Technic (piny). Są to elementy bardziej przyjazne młodszym uczniom, ale mniej przydatne do budowania ruchomych mechanizmów.\n\nZwrot w kierunku klocków System jest kompletnym odwróceniem tendencji widocznej przy poprzednich premierach LEGO Education, które zdawały się iść coraz dalej w kierunku klocków Technic (najlepiej widać to na przykładzie elektroniki WeDo 2.0 oraz SPIKE Essential).\n\nUwagę zwracają duże płytki podstawowe w różnych rozmiarach, z zaokrąglonymi kątami i zredukowaną liczbą studów. Ciekawym elementem są także gumowe płytki z plastikowymi studami, pozwalające na budowanie stabilnych podstaw o dużej przyczepności do podłoża. Miłym zaskoczeniem jest powrót w zestawie K-2 sznurka zakończonego studami, znanego z prehistorycznego już niemal zestawu LEGO Education WeDo 1.0.\n\nW zestawach **jest mało elementów czysto mechanicznych**: kół, zębatek, czy listew zębatych. W praktyce, ta decyzja wyraźnie utrudnia (czasem uniemożliwia) prezentowanie i wyjaśnienie uczniom zagadnień mechanicznych wychodzących poza absolutne podstawy. Ma to bezpośredni wpływ na [możliwości korzystania z zestawu](https://www.robocamp.pl/pl/blog/lego-science-recenzja/#mozliwosci-zestawu).\n\nMożliwości konstrukcyjne są ograniczone, co przekłada się bezpośrednio na prostotę modeli. Widać to na przykładzie Ptasiego gniazda – 4 robotów RoboCamp działających na tej samej zasadzie, zbudowanych z różnych zestawów: WeDo 1.0, WeDo 2.0, SPIKE Essential i Science.\n\nWystarczy spojrzeć, żeby zauważyć jak dobór elementów wpływa na ostateczny model.\n\n(Bird nest – 4 robots made by RoboCamp from different LEGO Education sets)",
      "summary": "Rozdział opisuje fizyczną zawartość LEGO Education Science, w tym pudełko wykonane z tańszego i bardziej giętkiego plastiku oraz brak domyślnego systemu sortowania, zastąpiony jedną wyjmowaną ścianką. Przedstawiono trzy zestawy: Science Kit K-2 (45620) z 277 elementami i ceną 329,95 USD, Science Kit 3-5 (45621) z 336 elementami i ceną 399,95 USD oraz Science Kit 6-8 (45622) z 424 elementami i ceną 499,95 USD, a także warianty Classroom Bundle po 6 sztuk z dodatkami. Omówiono paletę kolorów oraz przewagę klocków typu System nad Technic, a także niedobór elementów mechanicznych (np. kół i zębatek), który wpływa na prostotę modeli.",
      "primary_questions": [
        "Z jakiego materiału wykonano pudełka Science i jakie dwie cechy tego plastiku wskazano jako słabsze w porównaniu do LEGO Learning System?",
        "Jakie ograniczenia organizacji wnętrza pudełka wynikają z braku domyślnego systemu sortowania i zastosowania jednej wyjmowanej ścianki?",
        "Jakie grupy wiekowe, liczby elementów i ceny podano dla Science Kit K-2 (45620), Science Kit 3-5 (45621) i Science Kit 6-8 (45622)?",
        "Jakie dodatki wymieniono jako zawartość pakietów Classroom Bundle po 6 sztuk, w tym różnice dotyczące kart połączeń?",
        "Co autorzy piszą o dostępie do Teacher Portal i do jakich zestawów mają być kompatybilne materiały dydaktyczne?",
        "Jakie różnice między klockami System i Technic podkreślono oraz jaki ma to skutek dla budowania mechanizmów ruchomych?",
        "Jakie przykłady elementów mechanicznych wskazano jako rzadkie w zestawach i jaki wpływ ma to na możliwość omawiania zagadnień mechanicznych?"
      ],
      "canonical_url": "https://www.robocamp.pl/pl/blog/lego-science-recenzja#zawartosc-zestawu",
      "last_updated": "2025-11-11"
    },
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-recenzja",
      "chapter_id": "3",
      "language": "pl",
      "heading": "Elektronika LEGO Education Science",
      "text": "### Elementy elektroniczne\n\n**Najważniejsza nowością zestawu jest zupełnie nowy system elektroniki**. Mamy nowe silniki, czujniki i elementy sterujące, a także nowy system łączności bezprzewodowej.\n\n**Założenie jest jasne: elektronika ma być wykorzystywana offline, bezekranowo**. Elementy uruchamiamy za pomocą kart połączeń, które aktywują preprogramowane programy zawierające odpowiednie polecenia. Siłą rzeczy jest to podejście mocno ograniczające możliwości sprzętowe elektroniki zestawu.\n\n**Jednak elementy elektroniczne z serii Science są programowalne przez [aplikację Coding Canvas](https://www.robocamp.pl/pl/blog/lego-science-recenzja/#aplikacja-coding-canvas)**, która umożliwia tworzenie programów przy pomocy bloczków kodu, na wzór Bloków słów. Elektronikę łączymy bezprzewodowo przez Bluetooth.\nBrak kabli przy elektronice i możliwość pracy offline tworzy ciekawe nowe możliwości dla konstruktorów LEGO i hobbystów – chociaż seria Science nie została zaprojektowana dla nich.\n\nPotencjalne możliwości nowej elektroniki nie są w żaden sposób wykorzystywane podczas lekcji przygotowanych przez producenta. Domyślnie klocki Science służą do pracy bezekranowej, nie do nauki programowania. Ta funkcjonalność zestawu stanowi według producenta tylko dodatek – bonus dla chętnych.\n\nZ punktu widzenia zestawów, **ilość elektroniki dostępnej w pudełku rośnie stopniowo**. Zestawy przeznaczone dla dzieci starszych zawierają więcej elektroniki niż te przeznaczone dla dzieci najmłodszych.\n\n> **Czy lekcje dla wszystkich grup możemy realizować przy pomocy zestawu dla najstarszej grupy wiekowej?** <br> Nie. Aby zapobiec tego typu praktykom, LEGO zadbało by klocki konstrukcyjne w każdym zestawie były inne. Wszystkie zestawy mają podobny zbiór części podstawowych, ale każdy zestaw ma kilka unikalnych elementów potrzebnych do zrealizowania lekcji z Teacher Portal.\n\nWszystkie nowe elementy elektroniczne LEGO Science posiadają wejście USB-C do ładowania wbudowanych akumulatorów litowo-jonowych oraz jeden podświetlany przycisk. Każdy element może pracować offline i łączyć się z innymi dzięki łączności Bluetooth Low Energy 4.2.\n\nPrzyjrzyjmy się im po kolei.\n\n(LEGO Education Science electronic elements)\n\n**Pojedynczy silnik 45650**\n\nBezprzewodowy, precyzyjny silnik o niewielkich rozmiarach z wbudowanym enkoderem absolutnym. Pozwala na dokładne sterowanie prędkością obrotu, a także ustalanie pozycji głowicy z dokładnością do 1 stopnia.\n\n- Dostępny w zestawie Science 6-8.\n\n**Podwójny silnik 45651**\n\nDuży silnik z dwiema głowicami obrotowymi i wbudowanym czujnikiem ruchu. Każda głowica ma wbudowany enkoder absolutny pozwalający na dokładne sterowanie prędkością obrotu i pozycją głowicy.\n\n- Dostępny w zestawach Science K-2, 3-5, 6-8.\n\n**Kontroler 45652**\n\nPrecyzyjny kontroler z dwiema dźwigniami sterowania wychylnymi o +- 90 stopni i rozdzielczością rejestrowania co 0,25 stopnia.\nCzas pełnego ładowania ok. 45 minut.\n\n- Możliwość bezpośredniego sterowania silnikami Science.\n- Dostępny w zestawach Science 3-5 i 6-8.\n\n**Czujnik koloru 45653**\n\nUproszczony czujnik wykrywa 6 kolorów. Jego zakres wykrywania to 4-16 mm. W trybie offline wykrywa 6 kolorów odpowiadających barwom wybranych klocków w zestawach LEGO Science.\n\n- Dostępny w zestawie Science 6-8.\n\n#### Karty połączeń (45657)\n\n(LEGO Education Connect cards)\n\nKarty połączeń to **nowy sposób sterowania elektroniką**. Do tej pory we wszystkich  zestawach robotycznych LEGO Education był hub – serce robota odpowiadające za zasilanie, łączność z urządzeniem sterującym oraz komunikację z pozostałymi elementami elektronicznymi zestawu poprzez kable podłączane do gniazd huba.\n\n**Karty pozwalają zrezygnować z uciążliwych kabli.** Umożliwiają łączność bezprzewodową między elementami, a dokładniej: uruchamiają je w trybie pracy offline przy jednoczesnym wyborze konkretnego programu, wgranego fabrycznie do pamięci każdego elementu.\n\nW praktyce **karty łączności działają trochę jak magiczna różdżka**. Włączamy wybrane elementy elektroniczne za pomocą przycisku i przykładamy do nich wybraną kartę by uruchomić program. Po przyłożeniu karty, dioda elementu świeci się na kolor karty łączności, czym sygnalizuje nawiązanie połączenia i gotowość do realizacji programu. Brzmi to dość skomplikowanie, ale w praktyce jest bardzo proste i działa bez zarzutu.\n\nRóżne kolory kart służą jedynie do grupowania elementów elektronicznych. Czujnik i silnik dotknięte kartą w tym samym kolorze będą ze sobą współpracować, i jednocześnie ignorować elektronikę uruchomioną kartą w innym kolorze. **Karty są elektronicznym znacznikiem danej grupy roboczej.**\n\nNa moment pisania recenzji LEGO nie publikuje szczegółów na temat tego jaką dokładnie technologię wykorzystują karty łączności. Prawdopodobnie jest to technologia komunikacji bliskiego zasięgu NFC lub pokrewna, wykorzystywana m.in. w płatnościach zbliżeniowych czy hotelowych zamkach. Karty pełnią w niej funkcję pasywnego transpondera, nie wymagającego zasilania, który po wzbudzeniu przez aktywne urządzenie inicjujące (w naszym wypadku element elektroniczny zestawu, do którego przykładamy kartę) wymieniają z nim niewielką ilość danych na bliskie odległości.\n\n#### Multi-ładowarka (45623)\n\nBrak huba w zestawie robotycznym ma swoje plusy, z których największym jest brak kabli w modelu robota. Niestety ma także wady.\n\nPoza koniecznością każdorazowego nawiązania łączności między wszystkimi elementami elektronicznymi zestawu, **musimy dbać o dostarczenie zasilania do każdej części elektronicznej z osobna**. Weźmy taki przykład: pracując z 24-osobową klasą siódmą, korzystającą z 6 zestawów LEGO Education Science 6-8, po każdych zajęciach musimy naładować aż 24 elementy elektroniczne! Mamy mniej kabli w ramach modelu, ale za to cały pęczek kabli do ładowania.\n\nNa szczęście LEGO zauważyło ten problem i wraz z zestawem wypuściło multi-ładowarkę wyposażoną w 8 wtyczek USB-C, która umożliwia ładowanie 8 elementów w mniej niż 1 godzinę. Warto zaopatrzyć się zatem w odpowiednią ilość multi-ładowarek, bądź kupić zestawy Science w ramach Bundle, gdzie ładowarki są w pakiecie.",
      "summary": "Rozdział przedstawia nowy system elektroniki LEGO Education Science, zaprojektowany do pracy offline i bezekranowej, uruchamianej przez karty połączeń wybierające preprogramowane programy. Opisano, że elementy są też programowalne w aplikacji Coding Canvas i łączą się bezprzewodowo przez Bluetooth, a każdy element ma USB-C, podświetlany przycisk i korzysta z Bluetooth Low Energy 4.2. Wymieniono urządzenia: pojedynczy silnik 45650 (enkoder absolutny i pozycjonowanie do 1 stopnia), podwójny silnik 45651, kontroler 45652 (±90° i rozdzielczość 0,25°) oraz czujnik koloru 45653 (6 kolorów, zakres 4–16 mm), a także działanie kart jako znacznika grup i kwestię ładowania wielu elementów oraz multi-ładowarki 45623 z 8 wtyczkami USB-C.",
      "primary_questions": [
        "Jakie założenie dotyczące sposobu użycia elektroniki LEGO Education Science opisano jako kluczowe (offline i bezekranowo) i jaką rolę pełnią karty połączeń?",
        "W jaki sposób aplikacja Coding Canvas umożliwia programowanie elektroniki Science i jaką łączność wykorzystuje do parowania elementów?",
        "Jakie elementy elektroniczne i system łączności wymieniono jako nowość w serii Science oraz jaki standard Bluetooth wskazano przy pracy offline?",
        "Jakie parametry działania podano dla pojedynczego silnika 45650, w tym związane z enkoderem absolutnym i dokładnością ustawiania pozycji?",
        "Jakie cechy kontrolera 45652 opisano w kontekście wychylenia dźwigni, rozdzielczości rejestrowania i czasu ładowania?",
        "Jakie możliwości i ograniczenia trybu offline czujnika koloru 45653 wskazano poprzez liczbę wykrywanych kolorów i zakres 4–16 mm?",
        "Jak w rozdziale opisano problem ładowania wielu elementów w szkole oraz jakie rozwiązanie podaje multi-ładowarka 45623?"
      ],
      "canonical_url": "https://www.robocamp.pl/pl/blog/lego-science-recenzja#elektronika-lego-education-science",
      "last_updated": "2025-11-11"
    },
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-recenzja",
      "chapter_id": "4",
      "language": "pl",
      "heading": "Praca z zestawem i materiały dydaktyczne",
      "text": "## Praca z zestawem i materiały dydaktyczne\n\n### Idea i przeznaczenie produktu\n\nWedług LEGO, zestawy **Science mają pełnić rolę pomocy dydaktycznych pozwalających na realizowanie praktycznych eksperymentów w ramach przedmiotów matematyczno-przyrodniczych**. Poprzez namacalną pracę z modelami, uczniowie mają bardziej się zaangażować i głębiej zrozumieć omawiane zagadnienia. Producent obiecuje też pojawianie się na lekcji \"aha moments\", czyli spontanicznego olśnienia naszych uczniów na wzór Archimedesa.\n\nKorzystanie z klocków do przeprowadzenia prostych eksperymentów ma być **szybsze, prostsze i ciekawsze** dla uczniów niż stosowanie tektury, gumek recepturek, patyczków od lodów, czy innych łatwo dostępnych przedmiotów codziennego użytku.\n\n**Powyższe obietnice mogą się spełnić w waszej szkole lub nie** – ostateczny rezultat będzie zależeć od preferencji uczniów i warunków nauczyciela.\n\nProducent podkreśla również wielorazowy charakter zestawów. Mają nie wymagać uzupełniania, być zawsze gotowe do użycia. Jednak każdy kto pracował z klockami dydaktycznymi wie, że elementy łatwo się gubią i mieszają między zestawami – żaden zestaw klocków nie jest wolny od tego problemu. Co więcej, elektronikę trzeba regularnie ładować, a w przypadku LEGO Science [jest to dość uciążliwie](https://www.robocamp.pl/pl/blog/lego-science-recenzja/#multi-adowarka-45623).\n\nPrzy projektowaniu zestawu producentowi przyświecał jeszcze jeden ważny argument – czas trwania lekcji. **Budowanie, uruchamianie i eksperymenty mają każdorazowo zająć maksymalnie 45 minut**, co jest rzeczywiście wyjątkowo cenne w warunkach szkolnych. Do tej pory przy wykorzystaniu dotychczasowych zestawów LEGO Education było to dosyć trudne do zrealizowania (choć nie niemożliwe: [zobacz 45-minutowe lekcje RoboCamp](https://www.robocamp.pl/pl/lessons/spike-short-lessons/)).\n\n**Niestety okazuje się, że to nie do końca prawda**. We własnym raporcie dot. wykorzystania LEGO Education Science w szkołach w USA przez 9 nauczycieli, producent pisze:\n\n>[...] wyzwania zgłaszane przez nauczycieli podczas wdrażania miały przede wszystkim charakter dydaktyczny: zarządzanie czasem, uzupełnianie luk wiedzy oraz wspieranie transferu pojęć. [...] dwie trzecie nauczycieli było w stanie zrealizować lekcje w blokach 45–60 minut, część zdecydowała się je wydłużyć. <br> – [LEGO® Education Science Case Study](https://education.lego.com/en-us/resources/les-case-study-download/): Enhancing Engagement in Science among Diverse Learners\n\nWychodzi więc na to, że godzina lekcyjna to według producenta 60 minut, a nie 45, i że podczas prawdziwych lekcji nauczyciele nierzadko jeszcze bardziej przedłużali swoje zajęcia.\n\nNie wiemy dokładnie których lekcji dotyczył raport, nie znamy też warunków w jakich prowadzono lekcje. Jednak 15 minut robi różnicę podczas jednej godziny lekcyjnej – koniecznie weźcie to pod uwagę jeśli planujecie korzystać z oficjalnych scenariuszy lekcji.\n\n### Praca z zestawem w klasie\n\nKażdy zestaw serii Science **przeznaczony jest dla grupy 4 uczniów**, z których każdy ma “swoją” minifigurkę LEGO w kolorze odpowiadającym rubryczce w papierowej instrukcji budowy. Ten system pracy zakłada brak programowania.\n\n**Plus tego rozwiązania jest taki, że potrzebujemy mniej zestawów w klasie** niż w przypadku pracy w parach. Minusów jest niestety więcej. Cztery osoby w grupie to trochę tłok, i nie wszystkie grupy dzieci są idealnie podzielne przez 4. Praca z kilkoma papierowymi instrukcjami budowy na biurku jest dosyć niewygodna i wymaga sporo miejsca. **System pracy wymaga przystosowania całego pomieszczenia** – stoliki muszą być duże i dostępne ze wszystkich stron, by wszystkie dzieci miały łatwy dostęp do pudełka z klockami i składanego wspólnie modelu. Taki układ możemy spotkać w niektórych klubach robotyki, czasem na świetlicy – rzadziej w typowej szkolnej klasie.\n\nPodział pracy na 4 osoby jest też niepełny, przez co może być problematyczny. Lewa strona papierowej instrukcji budowy ma 4 rubryczki – osobną dla każdego ucznia w grupie, oznaczoną inną minifigurką. Prawa strona pokazuje jak złożyć pracę czterech osób w jeden element. Jednak kto odpowiada za złożenie wszystkiego razem? Podobny problem pojawia się na etapie Elaborate każdej lekcji. Warto zastanowić się czy Wasi uczniowie mają samodzielnie rozdzielać te zadania, czy nie, i poinformować ich na początku, żeby uniknąć zamieszania.\n\n**System pracy w założeniu ma przyspieszyć budowanie i zwiększyć nacisk na współpracę i komunikację, może jednak generować spięcia w grupie i bałagan w klasie.** Praca w parach jest prostsza w organizacji i moderacji, zapewnia też równiejszy dostęp uczniów do sprzętu.\n\n### Materiały dydaktyczne i Teacher portal\n\n(Printed building instructions for LEGO Education Science)\n\nPoza nową bezprzewodową elektroniką, to materiały dydaktyczne są reklamowane jako najmocniejsza strona serii Science. Dla każdego zestawu **LEGO Education przygotowało 40 lekcji kompatybilnych z amerykańskimi standardami nauczania NGSS** (Next Generation Science Standards) zorientowanymi wokół nauk przyrodniczych, fizycznych, nauk o ziemi, projektowania inżynieryjnego oraz przestrzeni kosmicznej (Life Science, Physical Science, Engineering Design, Earth and Space Science).\n\nLekcje LEGO zostały zmapowane do standardów NGSS oraz innych, obowiązujących jako podstawa programowa w różnych stanach. Jednak jeśli chcecie aby wasze lekcje objęły absolutnie wszystkie z tych standardów, warto wziąć program LEGO pod lupę – **lekcje na Teacher portal nie obejmują wszystkich tematów**. Brakuje zwłaszcza tematów z zakresu Earth & Space Science (Ziemia i nauka o kosmosie). Inne zauważalne luki to m.in. tematy dotyczące fizyki, zjawiska fal i dźwięku. Natomiast inżynieria została przedstawiona bardzo starannie.\n\n**Czy lekcje mają odzwierciedlenie w polskiej podstawie programowej?** W pewnym stopniu tak, ale nie w ramach jednego przedmiotu.\n\nNa przykład lekcja *Grze-Grze-Grzechotnik!* dla klas 4-6 dobrze sprawdziłaby się na biologii. Można tu omówić:\n\n- zależność budowy i funkcji (zewnętrzne struktury a przetrwanie, zachowania obronne),\n- przystosowania organizmów do środowiska i relacje drapieżnik–ofiara,\n- czy posługiwanie się modelem/ilustracją do wyjaśniania zjawisk biologicznych.\n\nInna lekcja – *Akcja i reakcja* – dla klas 7-8 omawia III zasadę dynamiki Newtona, tak więc doskonale pasuje na zajęcia fizyki. Najbliższe wymagania w naszej podstawie to:\n\n- siły i ich oddziaływania; III zasada dynamiki Newtona (pary sił akcji–reakcji);\n- jakościowa analiza ruchu pod wpływem sił; planowanie/wykonanie prostych doświadczeń i formułowanie wniosków.\n\nPozostałe lekcje na portalu w wersji polskiej są podzielone według przedmiotu: geografia, chemia, fizyka, przyroda, biologia, technika, i edukacja wczesnoszkolna. Najwięcej lekcji jest dla edukacji wczesnoszkolnej (aż 52!) i biologii (27); najmniej dla chemii (3), geografii (5) i przyrody (4).\n\n**Czy nowe zestawy były konieczne do zmapowania lekcji pod standardy? Nie.** Powiedzmy to jasno: LEGO mogło stworzyć gotowe lekcje na cały rok szkolny na swoje dotychczasowe zestawy i zmapować je do obowiązujących standardów, ale zamiast tego wypuścili kompletnie nową [i kosztowną](https://www.robocamp.pl/pl/blog/lego-science-recenzja/#cena-i-opacalnosc-lego-science) serię zestawów. Portal z gotowymi lekcjami jest niezaprzeczalnie przydatny dla nauczyciela, ale powinien był powstać wcześniej i obejmować również zestawy SPIKE.\n\nSkoro zespół RoboCamp przygotował lekcje na kilka lat nauki ze SPIKE, z programowaniem i scenariuszami kompatybilnymi z podstawą programową, LEGO Education też dałoby radę. Jeżeli szukasz lekcji kompatybilnych z polską podstawą programową na zestawy SPIKE zobacz:\n\n- [Kurs programowania SPIKE Prime dla średniozaawansowanych](https://www.robocamp.pl/pl/course-spike-prime-intermediate/)\n- [Kurs programowania SPIKE Essential dla początkujących](https://www.robocamp.pl/pl/course-spike-essential-early-learners/)\n\nMateriały do lekcji od producenta dostępne są na specjalnie przygotowanej platformie dydaktycznej [Teacher Portal](https://teach.legoeducation.com/pl-pl/science/lessons). Zawierają kilkuslajdowe prezentacje prowadzące uczniów przez proces ćwiczenia oraz proste konspekty i wskazówki dla nauczyciela.\n\nOprócz cyfrowej platformy mamy do dyspozycji również **papierowe instrukcje budowy dołączone do zestawu**. Wielu użytkowników ucieszy takie rozwiązanie “retro”, które działa nawet kompletnie odcięte od ekranów i internetu. Ma działać także razem z materiałami online, niestety **znalezienie na portalu lekcji powiązanej z modelem w papierowej instrukcji jest zaskakująco trudne**. Portal nie ma wyszukiwarki, nie pokazuje modelu na grafice lekcji, a w instrukcjach nie ma nazwy lekcji tylko kod. Na ten moment trzeba niestety po kolei przeglądać wszystkie lekcje.\n\n> Uwaga! Grafiki tytułowe lekcji na portalu w żadnym stopniu nie przedstawiają modelu, który na danej lekcji budujemy. Jest to jedynie kreatywna interpretacja tematu lekcji. Aby zobaczyć model, należy przejść do instrukcji budowania.\n\nKażda **lekcja trzyma się formatu 5E** (zaskakująco podobnie do [scenariuszy lekcji RoboCamp – 5Z](https://www.robocamp.pl/pl/lessons/): Zobacz, Zbuduj, Zbadaj, Zaprogramuj, Zagraj). Mamy wprowadzenie (Engage), czyli np. krótkie wideo; etap budowania i obserwacji (Explore); etap notowania wyników obserwacji i wnioskowania (Explain), dalsze eksperymenty (Elaborate) oraz quiz na koniec (Evaluate). Całość mieści się w czterdziestu pięciu minutach.\n\n**Jakość poszczególnych lekcji jest bardzo różna.** Znajdziemy zarówno ciekawe i angażujące ćwiczenia, jak i nudnawe modele, którymi trudno będzie zainteresować uczniów. Część konstrukcji jest bardzo symboliczna i wymaga wspierania się prezentacją, żeby zrozumieć co dany model reprezentuje.\n\n(Model for a lesson by LEGO Education for Science kit: Big fish in a little pond)\n\nWiele lekcji w ogóle nie wykorzystuje elementów elektronicznych. Czy celowo? Producent serii Science chwali zalety pracy bezekranowej, niemniej jednak prawie zawsze w kontekście angażującej elektroniki. Możliwe też, że wymyślenie dużej liczby interesujących ćwiczeń na tej samej puli preprogramowanych ruchów okazało się po prostu zbyt trudne.",
      "summary": "Rozdział opisuje założenia dydaktyczne Science jako pomocy do eksperymentów w przedmiotach matematyczno-przyrodniczych oraz nacisk na realizację budowania i eksperymentów w maksymalnie 45 minut. Przytoczono raport LEGO z USA (9 nauczycieli), w którym wskazano realizację lekcji w blokach 45–60 minut i decyzje o wydłużaniu zajęć, co podważa deklarowane 45 minut. Omówiono organizację pracy w klasie w 4-osobowych grupach oraz materiały Teacher Portal, gdzie dla każdego zestawu przygotowano 40 lekcji zgodnych z NGSS, ale z lukami m.in. w Earth & Space Science. Wskazano też problemy użyteczności portalu (brak wyszukiwarki i trudność powiązania papierowych instrukcji z lekcjami) oraz format 5E i zróżnicowaną jakość lekcji.",
      "primary_questions": [
        "Jak producent opisuje rolę zestawów Science w realizowaniu eksperymentów i jakie „aha moments” mają się pojawiać na lekcji?",
        "Co autorzy cytują z raportu LEGO dotyczącego 9 nauczycieli w USA i jaki zakres czasu (45–60 minut) pojawia się w tym materiale?",
        "Jakie praktyczne trudności wskazano w organizacji pracy 4-osobowych grup, w tym w kontekście przestrzeni i łączenia pracy czterech uczniów w jeden model?",
        "Jaką liczbę lekcji kompatybilnych z NGSS podano dla każdego zestawu i jakie obszary NGSS wymieniono jako zakres tematyczny?",
        "Jakie luki tematyczne w materiałach Teacher Portal wymieniono, w szczególności w zakresie Earth & Space Science oraz fizyki fal i dźwięku?",
        "Jakie przykłady dopasowania lekcji do polskiej podstawy programowej podano na podstawie lekcji „Grze-Grze-Grzechotnik!” i „Akcja i reakcja”?",
        "Jakie problemy nawigacji i wyszukiwania lekcji na portalu opisano oraz co wskazano w uwadze o grafikach tytułowych lekcji?"
      ],
      "canonical_url": "https://www.robocamp.pl/pl/blog/lego-science-recenzja#praca-z-zestawem-i-materialy-dydaktyczne",
      "last_updated": "2025-11-11"
    },
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-recenzja",
      "chapter_id": "5",
      "language": "pl",
      "heading": "Aplikacja Coding Canvas",
      "text": "### Aplikacja Coding Canvas\n\n[Coding Canvas](https://code.legoeducation.com/en-us/word) to aplikacja do programowania elektroniki LEGO Science przy pomocy bloczków kodu. Działa w przeglądarce, na bardzo podobnej zasadzie co Bloki słów z aplikacji SPIKE.\n\n**Najważniejsze informacje o Coding Canvas:**\n\n- Dostępna bezpłatnie online\n- Elementy elektroniczne Science łączymy przez Bluetooth, każdy osobno. Naraz można podłączyć do 10 elementów.\n- Grupowanie elementów przy pomocy kart połączeń nie jest rozpoznawane przy programowaniu z poziomu aplikacji.\n- Elektronika serii Science nie jest kompatybilna z elektroniką serii SPIKE.\n- Programy tworzymy przy pomocy bloczków kodu, podobnych do Bloków słów. [Tryb analogiczny do Bloków ikon](https://code.legoeducation.com/en-us/icon) też istnieje, ale jest na ten moment tak ograniczony, że praktycznie nieużywalny.\n- Aplikacja jest obecnie dostępna wyłącznie w języku angielskim.\n\n(First look at Coding Canvas app for LEGO Education Science)\n\nMyślicie sobie – ale chwila, czy LEGO Science nie miało służyć do pracy bezekranowej? Po co ta aplikacja? Dobre pytanie.\n\n**LEGO Education Science promowane jest jako rozwiązanie „całkowicie bezekranowe”, ale pełne możliwości elektroniki odblokujesz dopiero po podłączeniu do aplikacji LEGO Coding Canvas.** W tym środowisku można regulować moc i prędkość silników oraz tworzyć własne sekwencje ruchu – funkcje całkowicie niedostępne przy korzystaniu z samych kart połączeń. LEGO nie wspomina o tym w swoich materiałach marketingowych, konsekwentnie przedstawiając serię Science jako zestaw do pracy offline.\n\nPowstaje wyraźna sprzeczność: produkt jest droższy, bo zawiera nową elektronikę i potencjalnie większe możliwości, ale te możliwości w ogóle nie są komunikowane przez producenta przy zakupie, i mają minimalne wsparcie techniczne.\n\nCo więcej, LEGO nie przygotowało żadnego wsparcia dla nauczycieli w zakresie wykorzystania aplikacji Coding Canvas, przez co zostają z tym narzędziem całkowicie sami. Minimalnie pomocna jest sekcja Help w aplikacji, gdzie opisano działanie poszczególnych bloczków kodu. Nad materiałami dydaktycznymi i lekcjami programowania dla zestawu LEGO Education Science pracuje obecnie zespół RoboCamp. **Premierę nowych lekcji z programowaniem dla Science planujemy w najbliższym czasie.**\n\nWarto zaznaczyć, że po dodaniu elementu programowania praca w czteroosobowych grupach – tak mocno promowana przez LEGO – całkowicie traci sens. Realnie z zestawu może wówczas efektywnie korzystać najwyżej dwóch uczniów.\n\nAplikacja Coding Canvas i konsekwencje jej praktycznego wykorzystania z zestawami Science potęgują wrażenie chaotycznego kierunku tej serii.",
      "summary": "Rozdział opisuje Coding Canvas jako przeglądarkową aplikację do programowania elektroniki LEGO Science bloczkami kodu, z łącznością Bluetooth i limitem do 10 podłączonych elementów jednocześnie. Wskazano, że aplikacja nie rozpoznaje grupowania kartami połączeń, elektronika Science nie jest kompatybilna ze SPIKE, a tryb analogiczny do Bloków ikon jest na tyle ograniczony, że praktycznie nieużywalny, przy czym dostępność językowa obejmuje tylko angielski. Autorzy opisują sprzeczność między promocją Science jako rozwiązania „całkowicie bezekranowego” a faktem, że regulacja mocy i prędkości silników oraz własne sekwencje ruchu są dostępne dopiero po podłączeniu do Coding Canvas. Zwrócono uwagę na brak wsparcia dydaktycznego dla nauczycieli oraz na to, że włączenie programowania podważa sens pracy w 4-osobowych grupach.",
      "primary_questions": [
        "Jak działa Coding Canvas w kontekście łączenia elektroniki Science przez Bluetooth i jaki limit jednocześnie podłączonych elementów podano?",
        "Dlaczego grupowanie elementów kartami połączeń nie jest rozpoznawane podczas programowania z poziomu Coding Canvas?",
        "Jakie ograniczenia kompatybilności wskazano między elektroniką serii Science a elektroniką serii SPIKE?",
        "Jak w rozdziale opisano różnice między programowaniem bloczkami kodu a trybem analogicznym do Bloków ikon w Coding Canvas?",
        "Jakie dwie funkcje elektroniki (regulacja mocy i prędkości silników oraz tworzenie sekwencji ruchu) są wskazane jako niedostępne przy samych kartach połączeń?",
        "Jakie wsparcie dla nauczycieli w zakresie Coding Canvas opisano jako niewystarczające i gdzie wskazano minimum pomocy?",
        "Jakie konsekwencje dla organizacji pracy w klasie opisano po dodaniu elementu programowania w kontekście 4-osobowych grup?"
      ],
      "canonical_url": "https://www.robocamp.pl/pl/blog/lego-science-recenzja#aplikacja-coding-canvas",
      "last_updated": "2025-11-11"
    }
  ]
}
