{
  "kb_meta": {
    "article_id": "lego-science-review",
    "language": "pl",
    "kb_change_type": "representation_only",
    "kb_note": "Improved AI-oriented chapter segmentation; source article unchanged.",
    "last_updated": "2026-01-13"
  },
  "chapters": [
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-recenzja",
      "chapter_id": "1",
      "language": "pl",
      "heading": "Recenzja LEGO Education Science: Wygoda kosztem swobody",
      "text": "Nowa seria produktów dla edukacji – LEGO® Education Science – weszła na światowy rynek. Jej głównym założeniem jest wspieranie nauki STEM poprzez pracę bezekranową, co odróżnia serię Science od dominujących na rynku narzędzi serii LEGO Learning System (czyli SPIKE Prime i SPIKE Essential).\n\nChociaż **LEGO Science z założenia nie przewiduje nauki programowania na swoich lekcjach**, to konstrukcje budowane przez uczniów zawierają działające elementy elektroniczne. Pozwalają wprawić modele w ruch poprzez preprogramowane sekwencje ruchów wybieranych za pomocą tzw. kart połączeń.\n\nMamy zatem do czynienia z czymś pomiędzy dwiema ścieżkami w dotychczasowym systemie dydaktycznym LEGO Education – dzieci tworzą mechanizmy, które są zasilane i można je wprawiać w ruch, ale nie programować. Będzie to zatem ruch obarczony sporymi ograniczeniami.\n\n**LEGO Education Science to wygodne „plug-and-teach” dla przyrody i edukacji wczesnoszkolnej: gotowe, 45-minutowe lekcje bez ekranów i bez kodowania.** Daje powtarzalne eksperymenty „z pudełka” i materiały dla nauczyciela, ale **kosztem swobody konstrukcji i rozwoju kompetencji inżynierskich**. Zestaw ułatwia zrobienie mini-eksperymentu w 45 minut, ale celowo ogranicza swobodę konstrukcji i według producenta nie służy do programowania – choć aplikacja do programowania zestawu istnieje.\n\nJeśli Twoim priorytetem są szybkie, gotowe lekcje z zakresu przedmiotów matematyczno-przyrodniczych – polubisz Science. Jeśli chcesz rozwijać kreatywność inżynierską i pracować z kodem – prędzej odnajdziesz się na lekcjach ze SPIKE.\n\n(Bird nest robot built by RoboCamp from LEGO Education Science bricks)\n\n- **Dla kogo:** nauczyciele edukacji wczesnoszkolnej/przyrody/fizyki, szkoły bez zaplecza IT, klasy młodsze, szybkie zastępstwa.\n- **Co daje:** gotowe scenariusze, bezekranowe demonstracje, spójny przebieg lekcji, łatwy start.\n- **Kompromisy:** domyślny brak programowania, ograniczona kreatywność modeli, praca w 4-os. grupach.\n- **Alternatywy:** SPIKE (także do prostych demonstracji offline), ewentualnie BricQ Motion dla mechaniki/projektów.\n- **Wniosek:** wygoda i gotowość > elastyczność i rozwój inżynierski.\n\nSkąd takie wnioski? [Czy opłaca się kupić LEGO Science](https://www.robocamp.pl/pl/blog/lego-science-recenzja/#cena-i-opacalnosc-lego-science)? [Czy ten zestaw będzie najlepszy dla Ciebie?](https://www.robocamp.pl/pl/blog/lego-science-recenzja/#wnioski-czy-lego-science-jest-dla-ciebie)\n\nPrzeczytaj całą recenzję lub kliknij na rozdział, który Cię interesuje.",
      "summary": "LEGO® Education Science to nowa seria do edukacji STEM, projektowana pod pracę bezekranową i odróżniana od LEGO Learning System (SPIKE Prime i SPIKE Essential). Zestawy wykorzystują elektronikę uruchamianą offline przez karty połączeń z preprogramowanymi sekwencjami ruchu, a nauka programowania nie jest domyślnym celem lekcji. Autorzy podkreślają kompromis „plug-and-teach” i 45-minutowych scenariuszy kosztem swobody konstrukcji oraz rozwoju kompetencji inżynierskich, wskazując typowe grupy docelowe i alternatywy.",
      "primary_questions": [
        "Czym LEGO Education Science różni się od SPIKE Prime i SPIKE Essential pod względem założeń pracy bezekranowej?",
        "Jaką rolę pełnią karty połączeń w uruchamianiu elektroniki i jakie ograniczenia z tego wynikają?",
        "Dlaczego w tej serii producent nie przewiduje domyślnie nauki programowania na lekcjach?",
        "Na czym polega główna teza recenzji dotycząca wygody „plug-and-teach” i ograniczeń swobody konstrukcji?",
        "Dla jakich nauczycieli i warunków szkolnych seria Science jest wskazywana jako najbardziej użyteczna?",
        "Jakie kompromisy w organizacji pracy uczniów są sygnalizowane w kontekście grup czteroosobowych?",
        "Jakie alternatywy (SPIKE, BricQ Motion) są wymienione i w jakich celach mogą lepiej pasować?"
      ],
      "canonical_url": "https://www.robocamp.pl/pl/blog/lego-science-recenzja/",
      "last_updated": "2025-11-11"
    },
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-recenzja",
      "chapter_id": "2",
      "language": "pl",
      "heading": "Zawartość zestawu",
      "text": "## Zawartość zestawu\n\n### Pudełko\n\nNowe pudełka Science wypadają słabiej od solidnych pojemników z serii LEGO Learning System. Wykonano je z tańszego, bardziej giętkiego i podatnego na pęknięcia plastiku. Plusem są mniejsze wymiary pudełek, co pozwala zaoszczędzić nieco miejsca w szkolnych szafkach i magazynkach.\n\nPudełko nie zawiera domyślnego systemu sortowania ułatwiającego porządkowanie elementów. Jest za to jedna wyjmowana ścianka, a więc mamy ograniczoną możliwość samodzielnego regulowania dwóch przegródek, co pozwala w pewnym stopniu dopasować wnętrze pudełka do własnych potrzeb.\n\n(LEGO Science box with elements inside)\n\n### Zestawy główne i pakiety Classroom bundle\n\nSeria Science obejmuje **trzy zestawy** konstrukcyjne przeznaczone dla różnych grup wiekowych. Każdy zestaw jest przeznaczony dla grupy czworga dzieci i zawiera trzy papierowe książeczki z instrukcjami budowy w pudełku.\n\n#### Science Kit K-2 (45620)\n\n- dla dzieci od 5 do 7 roku życia\n- 277 elementów konstrukcyjnych\n- 1 element elektroniczny: podwójny silnik\n- przewód USB-C do ładowania\n- 329,95 USD\n\n#### Science Kit 3-5 (45621)\n\n- dla dzieci od 8 do 10 roku życia\n- 336 elementów konstrukcyjnych\n- 2 elementy elektroniczne: podwójny silnik oraz bezprzewodowy kontroler\n- przewód USB-C do ładowania\n- 2 karty połączeń\n- 399,95 USD\n\n#### Science Kit 6-8 (45622)\n\n- dla dzieci od 11 do 14 roku życia\n- 424 elementy konstrukcyjne\n- 4 elementy elektroniczne: pojedynczy silnik, podwójny silnik, czujnik koloru i bezprzewodowy kontroler\n- przewód USB-C do ładowania\n- 3 karty połączeń\n- 499,95 USD\n\nZestawy Science można kupować pojedynczo, lub w pakietach Classroom Bundle po 6 sztuk. Zakup pakietu jest minimalnie korzystniejszy cenowo, ale otrzymujemy kilka dodatków: multi-ładowarki (od 1 do 3), zestaw części zapasowych i 8 dodatkowych kart połączeń w przypadku Classroom bundle 3-5 oraz 6-8.\n\nLEGO gwarantuje też dostęp do obszernego Teacher Portal z materiałami dydaktycznymi dla nauczyciela, które są kompatybilne z trzema zestawami z serii Science. [Więcej o materiałach piszemy poniżej](https://www.robocamp.pl/pl/blog/lego-science-recenzja/#praca-z-zestawem-i-materiay-dydaktyczne).",
      "summary": "Rozdział opisuje fizyczną zawartość LEGO Education Science, w tym nowe pudełka z tańszego, bardziej giętkiego plastiku oraz brak domyślnego systemu sortowania z jedną wyjmowaną ścianką. Seria obejmuje trzy zestawy: K-2 (45620), 3-5 (45621) i 6-8 (45622), różniące się liczbą elementów konstrukcyjnych, zakresem elektroniki i liczbą kart połączeń. Wskazano też opcję Classroom Bundle po 6 sztuk z dodatkami (m.in. multi-ładowarki, części zapasowe, dodatkowe karty) oraz dostęp do Teacher Portal jako element oferty dla nauczyciela.",
      "primary_questions": [
        "Jakie wady i zalety mają nowe pudełka Science w porównaniu do pojemników z LEGO Learning System?",
        "Jakie elementy organizacji przechowywania zapewnia pudełko, a czego w nim brakuje?",
        "Jakie są kluczowe parametry zestawu Science Kit K-2 (45620): wiek, liczba elementów i elektronika?",
        "Czym różni się Science Kit 3-5 (45621) od K-2 pod względem elektroniki i kart połączeń?",
        "Jakie elementy elektroniczne i ile kart połączeń zawiera Science Kit 6-8 (45622)?",
        "Co dodatkowo otrzymuje się w Classroom Bundle i w jakich wariantach liczbowych występują multi-ładowarki?",
        "Jaką rolę w pakiecie produktów odgrywa Teacher Portal według tego rozdziału?"
      ],
      "canonical_url": "https://www.robocamp.pl/pl/blog/lego-science-recenzja/#zawartosc-zestawu",
      "last_updated": "2025-11-11"
    },
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-recenzja",
      "chapter_id": "3",
      "language": "pl",
      "heading": "Klocki konstrukcyjne",
      "text": "### Klocki konstrukcyjne\n\nZestawy utrzymane są w wesołej ale stonowanej palecie barw, gdzie dominują klocki turkusowe, brązowe, i jaskrawo koralowe. Specyficzna paleta wybrana tak, by odróżnić serię Science od innych zestawów LEGO Education.\n\nSame klocki są dość wyraziste, ale materiały są już w zgaszonych barwach. Wpisują się w trend desaturacji kolorów, który powstał w odpowiedzi na powszechne przestymulowanie zarówno dzieci, jak i dorosłych. Wątpliwe, żeby klocki działały uspokajająco, ale ten wybór na pewno przemawia do dorosłych – którzy decydują o zakupie.\n\n**W pudełku znajdziemy zdecydowanie więcej klocków typu System** (study) niż klocków typu Technic (piny). Są to elementy bardziej przyjazne młodszym uczniom, ale mniej przydatne do budowania ruchomych mechanizmów.\n\nZwrot w kierunku klocków System jest kompletnym odwróceniem tendencji widocznej przy poprzednich premierach LEGO Education, które zdawały się iść coraz dalej w kierunku klocków Technic (najlepiej widać to na przykładzie elektroniki WeDo 2.0 oraz SPIKE Essential).\n\nUwagę zwracają duże płytki podstawowe w różnych rozmiarach, z zaokrąglonymi kątami i zredukowaną liczbą studów. Ciekawym elementem są także gumowe płytki z plastikowymi studami, pozwalające na budowanie stabilnych podstaw o dużej przyczepności do podłoża. Miłym zaskoczeniem jest powrót w zestawie K-2 sznurka zakończonego studami, znanego z prehistorycznego już niemal zestawu LEGO Education WeDo 1.0.\n\nW zestawach **jest mało elementów czysto mechanicznych**: kół, zębatek, czy listew zębatych. W praktyce, ta decyzja wyraźnie utrudnia (czasem uniemożliwia) prezentowanie i wyjaśnienie uczniom zagadnień mechanicznych wychodzących poza absolutne podstawy. Ma to bezpośredni wpływ na [możliwości korzystania z zestawu](https://www.robocamp.pl/pl/blog/lego-science-recenzja/#mozliwosci-zestawu).\n\nMożliwości konstrukcyjne są ograniczone, co przekłada się bezpośrednio na prostotę modeli. Widać to na przykładzie Ptasiego gniazda – 4 robotów RoboCamp działających na tej samej zasadzie, zbudowanych z różnych zestawów: WeDo 1.0, WeDo 2.0, SPIKE Essential i Science.\n\nWystarczy spojrzeć, żeby zauważyć jak dobór elementów wpływa na ostateczny model.\n\n(Bird nest – 4 robots made by RoboCamp from different LEGO Education sets)",
      "summary": "Rozdział omawia paletę kolorów LEGO Education Science (turkus, brąz i koral) oraz trend desaturacji, który ma przemawiać do dorosłych decydentów. W zestawach dominuje system LEGO System (study) nad Technic (piny), co ułatwia pracę młodszym uczniom, ale ogranicza budowę mechanizmów ruchomych. Wskazano małą liczbę elementów mechanicznych (koła, zębatki, listwy) i konsekwencje dla prostoty modeli, ilustrowane porównaniem „Ptasiego gniazda” zbudowanego z różnych zestawów LEGO Education.",
      "primary_questions": [
        "Jakie kolory dominują w palecie zestawów Science i po co dobrano ją w taki sposób?",
        "Jak autorzy opisują zgaszoną kolorystykę materiałów i z czym wiążą trend desaturacji?",
        "Dlaczego przewaga klocków System nad Technic wpływa na możliwości budowy mechanizmów?",
        "W jaki sposób dobór elementów w Science odwraca wcześniejszy trend w LEGO Education widoczny przy WeDo 2.0 i SPIKE Essential?",
        "Jakie nietypowe elementy konstrukcyjne wyróżniono (płytki podstawowe, gumowe płytki, sznurek ze studami)?",
        "Jak brak elementów czysto mechanicznych utrudnia omawianie zagadnień mechaniki na lekcjach?",
        "Co pokazuje przykład „Ptasiego gniazda” w porównaniu czterech robotów z różnych zestawów LEGO Education?"
      ],
      "canonical_url": "https://www.robocamp.pl/pl/blog/lego-science-recenzja/#klocki-konstrukcyjne",
      "last_updated": "2025-11-11"
    },
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-recenzja",
      "chapter_id": "4",
      "language": "pl",
      "heading": "Elementy elektroniczne",
      "text": "### Elementy elektroniczne\n\n**Najważniejsza nowością zestawu jest zupełnie nowy system elektroniki**. Mamy nowe silniki, czujniki i elementy sterujące, a także nowy system łączności bezprzewodowej.\n\n**Założenie jest jasne: elektronika ma być wykorzystywana offline, bezekranowo**. Elementy uruchamiamy za pomocą kart połączeń, które aktywują preprogramowane programy zawierające odpowiednie polecenia. Siłą rzeczy jest to podejście mocno ograniczające możliwości sprzętowe elektroniki zestawu.\n\n**Jednak elementy elektroniczne z serii Science są programowalne przez [aplikację Coding Canvas](https://www.robocamp.pl/pl/blog/lego-science-recenzja/#aplikacja-coding-canvas)**, która umożliwia tworzenie programów przy pomocy bloczków kodu, na wzór Bloków słów. Elektronikę łączymy bezprzewodowo przez Bluetooth.\nBrak kabli przy elektronice i możliwość pracy offline tworzy ciekawe nowe możliwości dla konstruktorów LEGO i hobbystów – chociaż seria Science nie została zaprojektowana dla nich.\n\nPotencjalne możliwości nowej elektroniki nie są w żaden sposób wykorzystywane podczas lekcji przygotowanych przez producenta. Domyślnie klocki Science służą do pracy bezekranowej, nie do nauki programowania. Ta funkcjonalność zestawu stanowi według producenta tylko dodatek – bonus dla chętnych.\n\nZ punktu widzenia zestawów, **ilość elektroniki dostępnej w pudełku rośnie stopniowo**. Zestawy przeznaczone dla dzieci starszych zawierają więcej elektroniki niż te przeznaczone dla dzieci najmłodszych.\n\n> **Czy lekcje dla wszystkich grup możemy realizować przy pomocy zestawu dla najstarszej grupy wiekowej?** <br> Nie. Aby zapobiec tego typu praktykom, LEGO zadbało by klocki konstrukcyjne w każdym zestawie były inne. Wszystkie zestawy mają podobny zbiór części podstawowych, ale każdy zestaw ma kilka unikalnych elementów potrzebnych do zrealizowania lekcji z Teacher Portal.\n\nWszystkie nowe elementy elektroniczne LEGO Science posiadają wejście USB-C do ładowania wbudowanych akumulatorów litowo-jonowych oraz jeden podświetlany przycisk. Każdy element może pracować offline i łączyć się z innymi dzięki łączności Bluetooth Low Energy 4.2.\n\nPrzyjrzyjmy się im po kolei.\n\n(LEGO Education Science electronic elements)\n\n**Pojedynczy silnik 45650**\n\nBezprzewodowy, precyzyjny silnik o niewielkich rozmiarach z wbudowanym enkoderem absolutnym. Pozwala na dokładne sterowanie prędkością obrotu, a także ustalanie pozycji głowicy z dokładnością do 1 stopnia.\n\n- Dostępny w zestawie Science 6-8.\n\n**Podwójny silnik 45651**\n\nDuży silnik z dwiema głowicami obrotowymi i wbudowanym czujnikiem ruchu. Każda głowica ma wbudowany enkoder absolutny pozwalający na dokładne sterowanie prędkością obrotu i pozycją głowicy.\n\n- Dostępny w zestawach Science K-2, 3-5, 6-8.\n\n**Kontroler 45652**\n\nPrecyzyjny kontroler z dwiema dźwigniami sterowania wychylnymi o +- 90 stopni i rozdzielczością rejestrowania co 0,25 stopnia.\nCzas pełnego ładowania ok. 45 minut.\n\n- Możliwość bezpośredniego sterowania silnikami Science.\n- Dostępny w zestawach Science 3-5 i 6-8.\n\n**Czujnik koloru 45653**\n\nUproszczony czujnik wykrywa 6 kolorów. Jego zakres wykrywania to 4-16 mm. W trybie offline wykrywa 6 kolorów odpowiadających barwom wybranych klocków w zestawach LEGO Science.\n\n- Dostępny w zestawie Science 6-8.",
      "summary": "Rozdział przedstawia nowy system elektroniki LEGO Education Science: nowe silniki, czujniki i elementy sterujące z bezprzewodową łącznością. Domyślny model pracy zakłada użycie offline i bez ekranu, a uruchamianie odbywa się przez karty połączeń z fabrycznie wgranymi programami, choć sprzęt można także programować w aplikacji Coding Canvas przez Bluetooth. Opisano cechy wspólne elementów (USB-C, akumulatory litowo-jonowe, Bluetooth Low Energy 4.2) oraz przegląd komponentów: pojedynczy silnik 45650, podwójny silnik 45651, kontroler 45652 i czujnik koloru 45653 wraz z ich dostępnością w zestawach wiekowych.",
      "primary_questions": [
        "Jakie założenia stoją za nowym systemem elektroniki w LEGO Education Science?",
        "W jaki sposób karty połączeń uruchamiają preprogramowane programy w trybie offline?",
        "Jak i do czego można użyć aplikacji Coding Canvas w kontekście elektroniki Science?",
        "Jakie cechy wspólne mają wszystkie nowe elementy elektroniczne (zasilanie, przycisk, łączność)?",
        "Jakie możliwości daje pojedynczy silnik 45650 i w którym zestawie jest dostępny?",
        "Czym wyróżnia się podwójny silnik 45651 oraz w jakich zestawach występuje?",
        "Jakie parametry i funkcje ma kontroler 45652 oraz jakie kolory wykrywa czujnik 45653 w trybie offline?"
      ],
      "canonical_url": "https://www.robocamp.pl/pl/blog/lego-science-recenzja/#elementy-elektroniczne",
      "last_updated": "2025-11-11"
    },
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-recenzja",
      "chapter_id": "5",
      "language": "pl",
      "heading": "Karty połączeń (45657)",
      "text": "#### Karty połączeń (45657)\n\n(LEGO Education Connect cards)\n\nKarty połączeń to **nowy sposób sterowania elektroniką**. Do tej pory we wszystkich  zestawach robotycznych LEGO Education był hub – serce robota odpowiadające za zasilanie, łączność z urządzeniem sterującym oraz komunikację z pozostałymi elementami elektronicznymi zestawu poprzez kable podłączane do gniazd huba.\n\n**Karty pozwalają zrezygnować z uciążliwych kabli.** Umożliwiają łączność bezprzewodową między elementami, a dokładniej: uruchamiają je w trybie pracy offline przy jednoczesnym wyborze konkretnego programu, wgranego fabrycznie do pamięci każdego elementu.\n\nW praktyce **karty łączności działają trochę jak magiczna różdżka**. Włączamy wybrane elementy elektroniczne za pomocą przycisku i przykładamy do nich wybraną kartę by uruchomić program. Po przyłożeniu karty, dioda elementu świeci się na kolor karty łączności, czym sygnalizuje nawiązanie połączenia i gotowość do realizacji programu. Brzmi to dość skomplikowanie, ale w praktyce jest bardzo proste i działa bez zarzutu.\n\nRóżne kolory kart służą jedynie do grupowania elementów elektronicznych. Czujnik i silnik dotknięte kartą w tym samym kolorze będą ze sobą współpracować, i jednocześnie ignorować elektronikę uruchomioną kartą w innym kolorze. **Karty są elektronicznym znacznikiem danej grupy roboczej.**\n\nNa moment pisania recenzji LEGO nie publikuje szczegółów na temat tego jaką dokładnie technologię wykorzystują karty łączności. Prawdopodobnie jest to technologia komunikacji bliskiego zasięgu NFC lub pokrewna, wykorzystywana m.in. w płatnościach zbliżeniowych czy hotelowych zamkach. Karty pełnią w niej funkcję pasywnego transpondera, nie wymagającego zasilania, który po wzbudzeniu przez aktywne urządzenie inicjujące (w naszym wypadku element elektroniczny zestawu, do którego przykładamy kartę) wymieniają z nim niewielką ilość danych na bliskie odległości.\n\n#### Multi-ładowarka (45623)\n\nBrak huba w zestawie robotycznym ma swoje plusy, z których największym jest brak kabli w modelu robota. Niestety ma także wady.\n\nPoza koniecznością każdorazowego nawiązania łączności między wszystkimi elementami elektronicznymi zestawu, **musimy dbać o dostarczenie zasilania do każdej części elektronicznej z osobna**. Weźmy taki przykład: pracując z 24-osobową klasą siódmą, korzystającą z 6 zestawów LEGO Education Science 6-8, po każdych zajęciach musimy naładować aż 24 elementy elektroniczne! Mamy mniej kabli w ramach modelu, ale za to cały pęczek kabli do ładowania.\n\nNa szczęście LEGO zauważyło ten problem i wraz z zestawem wypuściło multi-ładowarkę wyposażoną w 8 wtyczek USB-C, która umożliwia ładowanie 8 elementów w mniej niż 1 godzinę. Warto zaopatrzyć się zatem w odpowiednią ilość multi-ładowarek, bądź kupić zestawy Science w ramach Bundle, gdzie ładowarki są w pakiecie.",
      "summary": "Karty połączeń (45657) zastępują klasyczny hub i kable jako sposób sterowania elektroniką w LEGO Education Science, uruchamiając bezprzewodowo elementy w trybie offline oraz wybierając fabrycznie wgrany program. W praktyce użytkownik włącza element, przykłada kartę, a dioda sygnalizuje kolor i gotowość; kolory kart służą do grupowania urządzeń współpracujących w jednej „grupie roboczej”. Autorzy wskazują, że LEGO nie ujawnia technologii kart, ale sugerują NFC lub pokrewną komunikację bliskiego zasięgu, oraz omawiają konsekwencje braku huba dla ładowania, w tym rolę multi-ładowarki (45623) z 8 wtyczkami USB-C.",
      "primary_questions": [
        "Jaką funkcję pełnił hub w dotychczasowych zestawach robotycznych LEGO Education i co go zastępuje w Science?",
        "W jaki sposób karty połączeń uruchamiają elektronikę i wybierają program w trybie offline?",
        "Co sygnalizuje kolor diody po przyłożeniu karty i jak wygląda praktyczny przebieg użycia kart?",
        "Do czego służą różne kolory kart połączeń w kontekście współpracy czujnika i silnika?",
        "Jaką technologię działania kart sugerują autorzy i dlaczego ma to sens w tym zastosowaniu?",
        "Jakie wady operacyjne pojawiają się przy braku huba w zakresie zasilania i ładowania elementów?",
        "Jak multi-ładowarka 45623 rozwiązuje problem ładowania i jakie ma parametry (liczba złączy, czas)?"
      ],
      "canonical_url": "https://www.robocamp.pl/pl/blog/lego-science-recenzja/#karty-poaczen-45657",
      "last_updated": "2025-11-11"
    }
  ]
}
