{
  "kb_meta": {
    "article_id": "lego-science-review",
    "language": "en",
    "kb_change_type": "representation_only",
    "kb_note": "Improved AI-oriented chapter segmentation; source article unchanged.",
    "last_updated": "2026-01-13"
  },
  "chapters": [
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-review",
      "chapter_id": "1",
      "language": "en",
      "heading": "LEGO Education Science Review: Convenience at cost of freedom",
      "text": "A new line of educational sets – LEGO® Education Science – has entered the global market. Its main goal is straightforward: to support STEM learning through screen-free activities, which clearly sets the Science series apart from the dominant LEGO Learning System tools (namely SPIKE Prime and SPIKE Essential).\n\nAlthough **LEGO Science is not designed to teach programming**, the models built by students do include working electronic components. You can bring them to life using pre-programmed motion sequences, activated with special connect cards.\n\nScience sits somewhere between classic LEGO robotics and screen-free science kits. Children build powered mechanisms that can move, but they don’t actually program them – and that lack of control comes with some serious limitations.\n\n**LEGO Education Science is a convenient “plug-and-teach” solution for science and early primary education: ready-made, 45-minute lessons without screens and without coding.** You get repeatable, out-of-the-box experiments and teacher materials, but **at the cost of construction freedom and engineering skill development**. The set makes it easy to run a mini-experiment in 45 minutes, but it deliberately limits construction flexibility and, according to the manufacturer, is not intended for programming – even though a programming app for the set does exist.\n\n(Bird nest robot built by RoboCamp from LEGO Education Science bricks)\n\nIf your priority is quick, ready-to-use STEM and biology lessons, you’ll probably like Science. If you want to foster engineering creativity and work with code, you’ll feel more at home with SPIKE.\n\n- **For whom:** early primary / science / physics teachers, schools without IT facilities, younger classes, quick cover lessons.\n- **What it offers:** ready-made lesson plans, screen-free demonstrations, consistent lesson flow, easy start.\n- **Trade-offs:** no programming by default, limited model creativity, work in groups of four.\n- **Alternatives:** SPIKE (also for simple offline demos), optionally BricQ Motion for mechanics / projects.\n- **Conclusion:** convenience and readiness > flexibility and engineering development.\n\nWhere do these conclusions come from? [Is it worth buying LEGO Science?](https://www.robocamp.eu/en/blog/lego-science-review/#price-and-value-of-lego-science) [Will this set be the best fit for you?](https://www.robocamp.eu/en/blog/lego-science-review/#conclusions-is-lego-science-for-you)\n\nRead the full review or click on the section that interests you most.",
      "summary": "LEGO® Education Science is introduced as a screen-free STEM line positioned between classic LEGO robotics and offline science kits, distinct from SPIKE Prime and SPIKE Essential. The sets include electronic components that run via pre-programmed motion sequences triggered by connect cards, while the product is explicitly not designed to teach programming. The core trade-off is a convenient, repeatable 45-minute “plug-and-teach” lesson flow versus reduced construction freedom and engineering skill development. It is framed as a fit for early primary science/physics teaching and quick cover lessons, with SPIKE (and optionally BricQ Motion) presented as alternatives for more open-ended engineering and coding.",
      "primary_questions": [
        "What is LEGO® Education Science positioned to do compared with SPIKE Prime and SPIKE Essential?",
        "How are Science models brought to life if students do not program them by default?",
        "What are the main limitations that come from using pre-programmed motion sequences and connect cards?",
        "What does the article list as the primary benefits and trade-offs of the Science line for classroom use?",
        "Who is the product described as being for, and in what teaching contexts might it be most convenient?",
        "Which alternative LEGO Education tools are mentioned, and what needs do they better support?"
      ],
      "canonical_url": "https://www.robocamp.eu/en/blog/lego-science-review/",
      "last_updated": "2025-11-14"
    },
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-review",
      "chapter_id": "2",
      "language": "en",
      "heading": "What’s in the box",
      "text": "## What’s in the box\n\n### Box\n\nThe new Science boxes are noticeably weaker than the sturdy containers from the LEGO Learning System line. They’re made of cheaper plastic that is more flexible and prone to cracking. On the plus side, the boxes are smaller, which saves precious space in school cabinets and storage rooms.\n\nThere’s no built-in sorting tray system to organize the elements. Instead, you get four compartments, one with a removable wall, so you can only adjust two compartments yourself. This gives you a bit of freedom to adapt the inside of the box to your needs, but not much.\n\n(LEGO Science box with elements inside)\n\n### Core sets and Classroom Bundle packs\n\nThe Science line consists of **three construction sets** designed for different age groups. Each set is designed for a group of four children and contains three printed building booklets in the box.\n\n#### Science Kit K-2 (45620)\n\n- for children aged 5–7\n- 277 building elements\n- 1 electronic element: dual motor\n- USB-C charging cable\n- 329.95 USD\n\n#### Science Kit 3-5 (45621)\n\n- for children aged 8–10\n- 336 building elements\n- 2 electronic elements: dual motor and wireless controller\n- USB-C charging cable\n- 2 connect cards\n- 399.95 USD\n\n#### Science Kit 6-8 (45622)\n\n- for children aged 11–14\n- 424 building elements\n- 4 electronic elements: single motor, dual motor, color sensor and wireless controller\n- USB-C charging cable\n- 3 connect cards\n- 499.95 USD\n\nScience sets can be purchased individually or in Classroom Bundle packs of 6 sets. Buying a bundle is only slightly cheaper, but you do get a few extras: multi-chargers (from 1 to 3 units), a spare parts pack, and 8 additional connect cards in the 3–5 and 6–8 Classroom Bundles.\n\nLEGO also guarantees access to an extensive Teacher Portal with teaching materials for educators, compatible with all three sets in the Science series. [Read more about teaching materials below](https://www.robocamp.eu/en/blog/lego-science-review/#working-with-the-set-and-teaching-materials).",
      "summary": "The chapter describes the physical packaging and the three age-banded LEGO Education Science kits, noting that the new boxes are smaller but made of cheaper, more crack-prone plastic and lack a full sorting tray system. Each core set is designed for four children and includes three printed building booklets, while electronics and connect cards increase with age level. The K-2 kit (45620) includes 277 elements and a dual motor at 329.95 USD, the 3-5 kit (45621) adds a wireless controller and two connect cards at 399.95 USD, and the 6-8 kit (45622) adds more electronics including a color sensor at 499.95 USD. Classroom Bundles of six sets include extras such as multi-chargers, spare parts, and additional connect cards, and LEGO guarantees access to a Teacher Portal for all three sets.",
      "primary_questions": [
        "How do the Science boxes differ from LEGO Learning System containers in durability and organization?",
        "What are the three core LEGO Education Science kits and which age ranges do they target?",
        "What electronics and accessories are included in the K-2, 3-5, and 6-8 kits respectively?",
        "How do the number of elements and electronic components change across the three Science kits?",
        "What additional items are included in Classroom Bundle packs and how do they affect purchasing value?",
        "What does LEGO guarantee regarding access to teaching materials for the Science series?"
      ],
      "canonical_url": "https://www.robocamp.eu/en/blog/lego-science-review/#whats-in-the-box",
      "last_updated": "2025-11-14"
    },
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-review",
      "chapter_id": "3",
      "language": "en",
      "heading": "Building bricks",
      "text": "### Building bricks\n\nThe sets use a cheerful but muted color palette, with turquoise, brown and bright coral bricks dominating. This specific palette was chosen to visually distinguish the Science line from other LEGO Education sets.\n\nThe bricks themselves are quite bold, while the printed materials use more subdued colors. They fit the current desaturation trend, which emerged as a response to the overstimulation experienced by both children and adults. It’s doubtful the bricks will have a calming effect, but this aesthetic certainly appeals to adults – the ones making purchasing decisions.\n\n**In the box, you’ll find significantly more System bricks** (studs) than Technic elements (pins). System bricks are more user-friendly for younger students, but less useful for building moving mechanisms.\n\n> This shift towards System bricks is a complete reversal of the trend we saw in previous LEGO Education launches, which seemed to move further toward Technic elements (this is particularly visible when we look at the electronics of WeDo 2.0 and SPIKE Essential).\n\nSeveral elements stand out. There are large baseplates in various sizes, with rounded corners and a reduced number of studs. Another interesting addition is the rubber plates with plastic studs, which let you build stable bases with very good grip on the surface. A pleasant surprise in the K-2 set is the return of a stud-ended string, known from the now almost prehistoric LEGO Education WeDo 1.0 set.\n\nThere are **very few purely mechanical elements** in the sets: wheels, gears, or gear racks. In practice, this decision clearly makes it harder (and sometimes impossible) to present and explain mechanical topics that go beyond the absolute basics. This has a direct impact on the [ways the set can be used](https://www.robocamp.eu/en/blog/lego-science-review/#lego-science-as-an-open-product).\n\nConstruction possibilities are limited, which directly translates into the simplicity of the models. You can see this in the Bird Nest – four RoboCamp robots built on the same principle, using different sets: WeDo 1.0, WeDo 2.0, SPIKE Essential and Science.\n\nA quick look is enough to see how the choice of elements affects the final model.\n\n(Bird nest – 4 robots made by RoboCamp from different LEGO Education sets)",
      "summary": "The Science sets use a muted palette dominated by turquoise, brown, and bright coral to visually distinguish the line, with printed materials kept more subdued. The box contains significantly more System bricks than Technic elements, a reversal from prior LEGO Education launches and a choice that favors younger users while limiting moving mechanisms. Notable parts include rounded baseplates with fewer studs, rubber plates with plastic studs for grip, and a stud-ended string in the K-2 set reminiscent of WeDo 1.0. The scarcity of mechanical elements like wheels and gears constrains construction and makes mechanical topics beyond basics harder to teach, which is illustrated by simpler models such as the Bird Nest comparison across multiple LEGO Education sets.",
      "primary_questions": [
        "What visual design choices in color palette are used to distinguish LEGO Education Science from other sets?",
        "How does the balance of System bricks versus Technic elements affect what students can build?",
        "Which specific building elements are highlighted as notable additions in the Science sets?",
        "What mechanical parts are described as scarce, and how does that impact teaching mechanics topics?",
        "How does limited construction variety translate into model simplicity in classroom builds?",
        "What does the Bird Nest comparison illustrate about the consequences of element selection?"
      ],
      "canonical_url": "https://www.robocamp.eu/en/blog/lego-science-review/#building-bricks",
      "last_updated": "2025-11-14"
    },
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-review",
      "chapter_id": "4",
      "language": "en",
      "heading": "Electronic elements",
      "text": "### Electronic elements\n\n**The most important novelty in the set is an entirely new electronics system.** We get new motors, sensors and control elements, as well as a new wireless communication system.\n\n**The idea is clear: the electronics are meant to be used offline, without screens.** Elements are activated using connect cards that trigger pre-programmed programs with specific commands. Inevitably, this approach strongly limits the hardware capabilities of the set’s electronics.\n\n**However, the electronic components in the Science sets can be programmed via the [Coding Canvas app](https://www.robocamp.eu/en/blog/lego-science-review/#coding-canvas-app)**, which lets you create programs with code blocks similar to Word Blocks. The electronics connect wirelessly via Bluetooth.\nNo wires on the electronics and the possibility of offline work open up interesting new opportunities for LEGO builders and hobbyists – even though the Science line wasn’t really designed with them in mind.\n\nThe potential of the new electronics is not used at all in the lessons created by the manufacturer. By default, Science bricks are intended for screen-free work, not for teaching programming. According to LEGO, this functionality is just a bonus for those who are interested.\n\nFrom the perspective of the sets, **the amount of electronics in the box increases gradually**. Sets designed for older students contain more electronics than those for younger children.\n\n> **Can I conduct lessons for all age groups using just the set for the oldest group?** <br> No. To prevent this, LEGO made sure that the building elements in each set are different. All sets have a similar pool of basic parts, but each set includes several unique elements needed for specific lessons in the Teacher Portal.\n\nAll new LEGO Science electronic elements have a USB-C port for charging built-in lithium-ion batteries and a single illuminated button. Each element can work offline and connect to others using Bluetooth Low Energy 4.2.\n\nLet’s take a closer look.\n\n(LEGO Education Science electronic elements)\n\n**Single motor 45650**\n\nA small wireless, precise motor with a built-in absolute encoder. It allows precise control of rotation speed and setting the head position with an accuracy of 1 degree.\n\n- Included in the Science 6-8 set.\n\n**Dual motor 45651**\n\nA large motor with two rotating heads and a built-in motion sensor. Each head has a built-in absolute encoder that allows precise control of rotation speed and head position.\n\n- Included in the Science K-2, 3-5 and 6-8 sets.\n\n**Controller 45652**\n\nA precise controller with two levers that can be tilted by ±90 degrees, with resolution of 0.25 degrees.\nFull charging time is about 45 minutes.\n\n- Can directly control Science motors.\n- Included in the Science 3-5 and 6-8 sets.\n\n**Color sensor 45653**\n\nA simplified sensor that detects 6 colors. Its detection range is 4–16 mm. In offline mode it detects 6 colors corresponding to the colors of selected bricks in the LEGO Science sets.\n\n- Included in the Science 6-8 set.",
      "summary": "The chapter introduces an entirely new electronics system for LEGO Education Science, designed for offline use where connect cards trigger pre-programmed commands without screens. Despite the screen-free default, the electronics can also be programmed via the Coding Canvas app using block-based code, with wireless Bluetooth connections and no cables. The amount of electronics increases with older kits, and LEGO prevents using only the oldest set across all age groups by including unique building elements per set for Teacher Portal lessons. It then details core components including the single motor (45650) with an absolute encoder, the dual motor (45651) with two heads and motion sensing, the controller (45652) with ±90° levers and ~45-minute charge time, and the color sensor (45653) detecting six colors at 4–16 mm.",
      "primary_questions": [
        "What is the core design idea behind the new LEGO Education Science electronics system?",
        "How do connect cards and pre-programmed programs shape what the electronics can do in offline mode?",
        "What role does the Coding Canvas app play relative to the screen-free positioning of the Science sets?",
        "How does the amount of electronics included change across Science kits for different age groups?",
        "Why does LEGO state you cannot teach all age groups using only the oldest Science kit?",
        "What capabilities are described for the single motor 45650, dual motor 45651, controller 45652, and color sensor 45653?"
      ],
      "canonical_url": "https://www.robocamp.eu/en/blog/lego-science-review/#electronic-elements",
      "last_updated": "2025-11-14"
    },
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-review",
      "chapter_id": "5",
      "language": "en",
      "heading": "Connect cards (45657)",
      "text": "#### Connect cards (45657)\n\n(LEGO Education Connect cards)\n\nConnect cards are a **new way of controlling the electronics**. Up to now, all LEGO Education robotics sets used a hub – the heart of the robot responsible for power, connection to the controlling device and communication with the remaining electronic components through cables plugged into the hub’s ports.\n\n**Cards let us get rid of those annoying cables.** They enable wireless communication between elements and, more precisely, they start them in offline mode while selecting one of the factory-programmed programs stored in each element’s memory.\n\n**In practice, connect cards work a bit like a magic wand**. You switch on the selected electronic components with the button, then touch them with a chosen card to start the program. After the card is applied, the element’s LED lights up in the color of that connect card, signalling that a connection has been established and the program is ready to run. It may sound complicated, but in reality it’s very simple and works reliably.\n\nThe different card colors only serve to group the electronic elements. A sensor and a motor touched with a card in the same color will cooperate with each other and ignore electronics started with a card in a different color. **Cards act as an electronic tag of a working group.**\n\nAt the time of writing this review, LEGO has not published any details about what technology the connect cards use. Most likely it’s NFC or a related short-range communication technology, used in contactless payments or hotel room locks. In this system, the cards act as passive transponders that don’t require power and, once energized by an active initiating device (in this case, the electronic element the card is touching), exchange a small amount of data over short distances.\n\n#### Multi-charger (45623)\n\nThe lack of a hub in the robotics set has its advantages, the biggest being the absence of cables in the robot model. Unfortunately, it also has drawbacks.\n\nApart from having to set up communication between all the electronic components each time, **you need to supply power to every electronic part separately**. Consider this example: you’re working with a 24-student class using 6 LEGO Education Science 6-8 sets. After every lesson you have to charge as many as 24 electronic components! There may be fewer cables in the models themselves, but you end up with a small tangle of charging cables instead.\n\nFortunately, LEGO noticed this problem and released a **multi-charger with 8 USB-C plugs**, which lets you charge 8 elements in under an hour. It’s a good idea to buy a sufficient number of multi-chargers, or get Science sets as part of a Bundle, where chargers are included.",
      "summary": "Connect cards (45657) replace the traditional hub-and-cable control model used in earlier LEGO Education robotics sets by enabling wireless offline activation of factory-programmed behaviors stored in each element. Users power on components, tap them with a chosen card, and the LED shows the card’s color to indicate grouping and readiness, with card colors serving as tags that define which motors and sensors cooperate. LEGO has not disclosed the underlying card technology, but the chapter suggests it is likely NFC or a related short-range system using passive transponders. The hub-free design reduces cables in builds but increases charging workload because each electronic element needs power separately, which leads to the multi-charger (45623) offering eight USB-C plugs to charge eight elements in under an hour.",
      "primary_questions": [
        "How do connect cards change the traditional hub-based control approach used in LEGO Education robotics sets?",
        "What is the step-by-step process for starting an offline program using a connect card and an electronic element?",
        "What function do different connect card colors serve in grouping sensors and motors during use?",
        "What technology is hypothesized to underlie connect cards and why is it compared to NFC-like systems?",
        "What operational drawbacks arise from removing the hub, especially regarding powering and charging electronics?",
        "How does the multi-charger (45623) address the charging burden described for classroom-scale use?"
      ],
      "canonical_url": "https://www.robocamp.eu/en/blog/lego-science-review/#connect-cards-45657",
      "last_updated": "2025-11-14"
    }
  ]
}
