{
  "chapters": [
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-review",
      "chapter_id": "1",
      "language": "en",
      "heading": "Introduction: What LEGO Education Science Is",
      "text": "A new line of educational sets – LEGO® Education Science – has entered the global market. Its main goal is straightforward: to support STEM learning through screen-free activities, which clearly sets the Science series apart from the dominant LEGO Learning System tools (namely SPIKE Prime and SPIKE Essential).\n\nAlthough **LEGO Science is not designed to teach programming**, the models built by students do include working electronic components. You can bring them to life using pre-programmed motion sequences, activated with special connect cards.\n\nScience sits somewhere between classic LEGO robotics and screen-free science kits. Children build powered mechanisms that can move, but they don’t actually program them – and that lack of control comes with some serious limitations.\n\n**LEGO Education Science is a convenient “plug-and-teach” solution for science and early primary education: ready-made, 45-minute lessons without screens and without coding.** You get repeatable, out-of-the-box experiments and teacher materials, but **at the cost of construction freedom and engineering skill development**. The set makes it easy to run a mini-experiment in 45 minutes, but it deliberately limits construction flexibility and, according to the manufacturer, is not intended for programming – even though a programming app for the set does exist.\n\n(Bird nest robot built by RoboCamp from LEGO Education Science bricks)\n\nIf your priority is quick, ready-to-use STEM and biology lessons, you’ll probably like Science. If you want to foster engineering creativity and work with code, you’ll feel more at home with SPIKE.\n\n- **For whom:** early primary / science / physics teachers, schools without IT facilities, younger classes, quick cover lessons.\n- **What it offers:** ready-made lesson plans, screen-free demonstrations, consistent lesson flow, easy start.\n- **Trade-offs:** no programming by default, limited model creativity, work in groups of four.\n- **Alternatives:** SPIKE (also for simple offline demos), optionally BricQ Motion for mechanics / projects.\n- **Conclusion:** convenience and readiness > flexibility and engineering development.\n\nWhere do these conclusions come from? [Is it worth buying LEGO Science?](https://www.robocamp.eu/en/blog/lego-science-review/#price-and-value-of-lego-science) [Will this set be the best fit for you?](https://www.robocamp.eu/en/blog/lego-science-review/#conclusions-is-lego-science-for-you)\n\nRead the full review or click on the section that interests you most.",
      "summary": "LEGO® Education Science is presented as a screen-free STEM solution positioned apart from the LEGO Learning System tools (SPIKE Prime and SPIKE Essential). The sets include electronic components that run pre-programmed motion sequences activated with connect cards, while the product is explicitly not designed to teach programming. The article frames Science as a “plug-and-teach” option built around ready-made 45-minute lessons, with trade-offs including limited construction freedom, reduced engineering skill development, and a default group size of four.",
      "primary_questions": [
        "How does the article position LEGO® Education Science relative to the LEGO Learning System tools SPIKE Prime and SPIKE Essential?",
        "What role do pre-programmed motion sequences and connect cards play in bringing LEGO Education Science models to life?",
        "Which constraints does the introduction associate with the fact that students do not actually program the Science models?",
        "What does the text describe as the core “plug-and-teach” promise of LEGO Education Science in terms of lesson length and screen use?",
        "Which target users and classroom situations are listed under “For whom” for LEGO Education Science?",
        "What trade-offs are explicitly listed in the introduction, including the default group size and limits on model creativity?",
        "Which alternatives to LEGO Education Science are named in the introduction, and in what contexts are they mentioned?"
      ],
      "canonical_url": "https://www.robocamp.eu/en/blog/lego-science-review/",
      "last_updated": "2025-11-14"
    },
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-review",
      "chapter_id": "2",
      "language": "en",
      "heading": "What’s in the Box",
      "text": "## What’s in the box\n\n### Box\n\nThe new Science boxes are noticeably weaker than the sturdy containers from the LEGO Learning System line. They’re made of cheaper plastic that is more flexible and prone to cracking. On the plus side, the boxes are smaller, which saves precious space in school cabinets and storage rooms.\n\nThere’s no built-in sorting tray system to organize the elements. Instead, you get four compartments, one with a removable wall, so you can only adjust two compartments yourself. This gives you a bit of freedom to adapt the inside of the box to your needs, but not much.\n\n(LEGO Science box with elements inside)\n\n### Core sets and Classroom Bundle packs\n\nThe Science line consists of **three construction sets** designed for different age groups. Each set is designed for a group of four children and contains three printed building booklets in the box.\n\n#### Science Kit K-2 (45620)\n\n- for children aged 5–7\n- 277 building elements\n- 1 electronic element: dual motor\n- USB-C charging cable\n- 329.95 USD\n\n#### Science Kit 3-5 (45621)\n\n- for children aged 8–10\n- 336 building elements\n- 2 electronic elements: dual motor and wireless controller\n- USB-C charging cable\n- 2 connect cards\n- 399.95 USD\n\n#### Science Kit 6-8 (45622)\n\n- for children aged 11–14\n- 424 building elements\n- 4 electronic elements: single motor, dual motor, color sensor and wireless controller\n- USB-C charging cable\n- 3 connect cards\n- 499.95 USD\n\nScience sets can be purchased individually or in Classroom Bundle packs of 6 sets. Buying a bundle is only slightly cheaper, but you do get a few extras: multi-chargers (from 1 to 3 units), a spare parts pack, and 8 additional connect cards in the 3–5 and 6–8 Classroom Bundles.\n\nLEGO also guarantees access to an extensive Teacher Portal with teaching materials for educators, compatible with all three sets in the Science series. [Read more about teaching materials below](https://www.robocamp.eu/en/blog/lego-science-review/#working-with-the-set-and-teaching-materials).\n\n### Building bricks\n\nThe sets use a cheerful but muted color palette, with turquoise, brown and bright coral bricks dominating. This specific palette was chosen to visually distinguish the Science line from other LEGO Education sets.\n\nThe bricks themselves are quite bold, while the printed materials use more subdued colors. They fit the current desaturation trend, which emerged as a response to the overstimulation experienced by both children and adults. It’s doubtful the bricks will have a calming effect, but this aesthetic certainly appeals to adults – the ones making purchasing decisions.\n\n**In the box, you’ll find significantly more System bricks** (studs) than Technic elements (pins). System bricks are more user-friendly for younger students, but less useful for building moving mechanisms.\n\n> This shift towards System bricks is a complete reversal of the trend we saw in previous LEGO Education launches, which seemed to move further toward Technic elements (this is particularly visible when we look at the electronics of WeDo 2.0 and SPIKE Essential).\n\nSeveral elements stand out. There are large baseplates in various sizes, with rounded corners and a reduced number of studs. Another interesting addition is the rubber plates with plastic studs, which let you build stable bases with very good grip on the surface. A pleasant surprise in the K-2 set is the return of a stud-ended string, known from the now almost prehistoric LEGO Education WeDo 1.0 set.\n\nThere are **very few purely mechanical elements** in the sets: wheels, gears, or gear racks. In practice, this decision clearly makes it harder (and sometimes impossible) to present and explain mechanical topics that go beyond the absolute basics. This has a direct impact on the [ways the set can be used](https://www.robocamp.eu/en/blog/lego-science-review/#lego-science-as-an-open-product).\n\nConstruction possibilities are limited, which directly translates into the simplicity of the models. You can see this in the Bird Nest – four RoboCamp robots built on the same principle, using different sets: WeDo 1.0, WeDo 2.0, SPIKE Essential and Science.\n\nA quick look is enough to see how the choice of elements affects the final model.\n\n(Bird nest – 4 robots made by RoboCamp from different LEGO Education sets)",
      "summary": "The Science boxes are described as smaller but weaker than LEGO Learning System containers, with no built-in sorting tray and four compartments including one removable wall. The line includes three core kits (K-2, 3-5, 6-8) for ages 5–7, 8–10, and 11–14 with 277, 336, and 424 elements and prices of 329.95 USD, 399.95 USD, and 499.95 USD. The bricks use a muted palette (turquoise, brown, bright coral) and emphasize System bricks over Technic elements, while the sets include very few mechanical parts such as wheels, gears, or gear racks, affecting how complex mechanisms can be demonstrated.",
      "primary_questions": [
        "What differences does the text describe between Science boxes and the containers from the LEGO Learning System line?",
        "How is the interior organization of the Science box structured, and which compartments can be adjusted?",
        "What ages, element counts, and prices are listed for Science Kit K-2 (45620), Science Kit 3-5 (45621), and Science Kit 6-8 (45622)?",
        "What additional items are described as part of Classroom Bundle packs of 6 sets for the 3–5 and 6–8 bundles?",
        "Which color palette is described for the Science bricks, and what purpose is it said to serve relative to other LEGO Education sets?",
        "What does the chapter state about the proportion of System bricks versus Technic elements in the sets, and how does it link that to building moving mechanisms?",
        "Which specific examples of notable elements and missing mechanical parts are mentioned, and how are they connected to limitations in explaining mechanical topics?"
      ],
      "canonical_url": "https://www.robocamp.eu/en/blog/lego-science-review/#whats-in-the-box",
      "last_updated": "2025-11-14"
    },
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-review",
      "chapter_id": "3",
      "language": "en",
      "heading": "LEGO Education Science Electronics",
      "text": "### Electronic elements\n\n**The most important novelty in the set is an entirely new electronics system.** We get new motors, sensors and control elements, as well as a new wireless communication system.\n\n**The idea is clear: the electronics are meant to be used offline, without screens.** Elements are activated using connect cards that trigger pre-programmed programs with specific commands. Inevitably, this approach strongly limits the hardware capabilities of the set’s electronics.\n\n**However, the electronic components in the Science sets can be programmed via the [Coding Canvas app](https://www.robocamp.eu/en/blog/lego-science-review/#coding-canvas-app)**, which lets you create programs with code blocks similar to Word Blocks. The electronics connect wirelessly via Bluetooth.\nNo wires on the electronics and the possibility of offline work open up interesting new opportunities for LEGO builders and hobbyists – even though the Science line wasn’t really designed with them in mind.\n\nThe potential of the new electronics is not used at all in the lessons created by the manufacturer. By default, Science bricks are intended for screen-free work, not for teaching programming. According to LEGO, this functionality is just a bonus for those who are interested.\n\nFrom the perspective of the sets, **the amount of electronics in the box increases gradually**. Sets designed for older students contain more electronics than those for younger children.\n\n> **Can I conduct lessons for all age groups using just the set for the oldest group?** <br> No. To prevent this, LEGO made sure that the building elements in each set are different. All sets have a similar pool of basic parts, but each set includes several unique elements needed for specific lessons in the Teacher Portal.\n\nAll new LEGO Science electronic elements have a USB-C port for charging built-in lithium-ion batteries and a single illuminated button. Each element can work offline and connect to others using Bluetooth Low Energy 4.2.\n\nLet’s take a closer look.\n\n(LEGO Education Science electronic elements)\n\n**Single motor 45650**\n\nA small wireless, precise motor with a built-in absolute encoder. It allows precise control of rotation speed and setting the head position with an accuracy of 1 degree.\n\n- Included in the Science 6-8 set.\n\n**Dual motor 45651**\n\nA large motor with two rotating heads and a built-in motion sensor. Each head has a built-in absolute encoder that allows precise control of rotation speed and head position.\n\n- Included in the Science K-2, 3-5 and 6-8 sets.\n\n**Controller 45652**\n\nA precise controller with two levers that can be tilted by ±90 degrees, with resolution of 0.25 degrees.\nFull charging time is about 45 minutes.\n\n- Can directly control Science motors.\n- Included in the Science 3-5 and 6-8 sets.\n\n**Color sensor 45653**\n\nA simplified sensor that detects 6 colors. Its detection range is 4–16 mm. In offline mode it detects 6 colors corresponding to the colors of selected bricks in the LEGO Science sets.\n\n- Included in the Science 6-8 set.\n\n#### Connect cards (45657)\n\n(LEGO Education Connect cards)\n\nConnect cards are a **new way of controlling the electronics**. Up to now, all LEGO Education robotics sets used a hub – the heart of the robot responsible for power, connection to the controlling device and communication with the remaining electronic components through cables plugged into the hub’s ports.\n\n**Cards let us get rid of those annoying cables.** They enable wireless communication between elements and, more precisely, they start them in offline mode while selecting one of the factory-programmed programs stored in each element’s memory.\n\n**In practice, connect cards work a bit like a magic wand**. You switch on the selected electronic components with the button, then touch them with a chosen card to start the program. After the card is applied, the element’s LED lights up in the color of that connect card, signalling that a connection has been established and the program is ready to run. It may sound complicated, but in reality it’s very simple and works reliably.\n\nThe different card colors only serve to group the electronic elements. A sensor and a motor touched with a card in the same color will cooperate with each other and ignore electronics started with a card in a different color. **Cards act as an electronic tag of a working group.**\n\nAt the time of writing this review, LEGO has not published any details about what technology the connect cards use. Most likely it’s NFC or a related short-range communication technology, used in contactless payments or hotel room locks. In this system, the cards act as passive transponders that don’t require power and, once energized by an active initiating device (in this case, the electronic element the card is touching), exchange a small amount of data over short distances.\n\n#### Multi-charger (45623)\n\nThe lack of a hub in the robotics set has its advantages, the biggest being the absence of cables in the robot model. Unfortunately, it also has drawbacks.\n\nApart from having to set up communication between all the electronic components each time, **you need to supply power to every electronic part separately**. Consider this example: you’re working with a 24-student class using 6 LEGO Education Science 6-8 sets. After every lesson you have to charge as many as 24 electronic components! There may be fewer cables in the models themselves, but you end up with a small tangle of charging cables instead.\n\nFortunately, LEGO noticed this problem and released a **multi-charger with 8 USB-C plugs**, which lets you charge 8 elements in under an hour. It’s a good idea to buy a sufficient number of multi-chargers, or get Science sets as part of a Bundle, where chargers are included.",
      "summary": "The chapter describes a new LEGO Education Science electronics system designed for offline, screen-free use via connect cards that trigger pre-programmed commands, while noting the same components can also be programmed in the Coding Canvas app over Bluetooth. All elements are rechargeable via USB-C, use built-in lithium-ion batteries, and can connect using Bluetooth Low Energy 4.2. It lists specific components and parameters, including the single motor 45650 with 1-degree positioning accuracy, the controller 45652 with ±90-degree levers and 0.25-degree resolution plus ~45-minute charging, and the color sensor 45653 detecting 6 colors at 4–16 mm, and it adds the multi-charger 45623 with 8 USB-C plugs to address the need to charge many separate components.",
      "primary_questions": [
        "How does the chapter describe the intended offline control model for Science electronics using connect cards and pre-programmed programs?",
        "What does the text say about programming Science electronic components via the Coding Canvas app and how the connection is made?",
        "Which shared hardware features are attributed to the new Science electronic elements, including charging and wireless communication details?",
        "What capabilities and inclusion details are provided for the single motor 45650 and the dual motor 45651?",
        "What specifications are given for the controller 45652, including lever range, resolution, and charging time?",
        "What detection limits and behavior in offline mode are described for the color sensor 45653?",
        "How does the chapter explain the logistical charging problem in a 24-student example, and what role does the multi-charger 45623 play in addressing it?"
      ],
      "canonical_url": "https://www.robocamp.eu/en/blog/lego-science-review/#electronic-elements",
      "last_updated": "2025-11-14"
    },
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-review",
      "chapter_id": "4",
      "language": "en",
      "heading": "Working with the Set and Teaching Materials",
      "text": "## Working with the set and teaching materials\n\n(LEGO Science minifigures)\n\n### Product idea and producer's promises\n\nAccording to LEGO®, **Science sets are meant to serve as teaching aids for hands-on experiments in science and math-related subjects.** By physically working with models, students should engage more and gain a deeper understanding of the topics discussed. The producer also promises “aha moments” in the classroom – spontaneous flashes of understanding in our students, in the spirit of Archimedes.\n\nUsing bricks to run simple experiments is meant to be **faster, simpler and more interesting** for students than working with cardboard, rubber bands, popsicle sticks or other everyday materials.\n\n**Whether these promises will come true in your school or not** will ultimately depend on your students’ preferences and your working conditions as a teacher.\n\nThe producer also emphasizes that the sets are designed for repeated use. They supposedly do not require replenishment and are always ready to go. However, anyone who has worked with educational bricks knows that elements get lost and mixed between sets – no brick set is free from this problem. On top of that, the electronics must be charged regularly and in the case of LEGO Science [this is quite a nuisance](https://www.robocamp.eu/en/blog/lego-science-review/#multi-charger-45623).\n\nAnother important factor in the design of the set was lesson length. **Building, running and experimenting are all supposed to fit into a maximum of 45 minutes each time**, which is genuinely valuable in a school context. With the existing LEGO Education sets it used to be quite difficult (though not impossible – see [RoboCamp 45-minute lessons](https://www.robocamp.eu/en/lessons/spike-short-lessons/)).\n\n**Unfortunately, this claim turns out not to be entirely true.** In its own report on implementing LEGO Education Science in US schools with 9 teachers, the producer writes:\n\n>[...] The few challenges teachers reported related to implementation were primarily pedagogical: managing time, addressing knowledge gaps, and supporting concept transfer. [...] while two-thirds of teachers were able to complete the lessons in the 45–60-\nminute blocks, some teachers chose to extend\nthe lessons <br> – [LEGO® Education Science Case Study](https://education.lego.com/en-us/resources/les-case-study-download/): Enhancing Engagement in Science among Diverse Learners\n\nIt turns out that, according to the manufacturer, a lesson hour is closer to 60 minutes than 45, and that in real classroom conditions teachers often extended their lessons even more.\n\nWe don’t know exactly which lessons the report refers to, nor the conditions in which they were delivered. But 15 minutes make a real difference in a single lesson hour – you should definitely keep this in mind if you plan to use the official lesson plans.\n\n### Working with the set in classroom\n\nEach set in the Science line **is designed for a group of 4 students**, each with their “own” LEGO minifigure in a color that matches their slot in the printed building instructions. This working system assumes there is no programming involved.\n\n**The advantage is that you need fewer sets in the classroom** than when working in pairs.\n\nUnfortunately, the drawbacks outweigh this benefit. Four students in a group can be a bit crowded, and not every class splits neatly into groups of four. **The working system essentially requires rearranging the entire classroom** – tables need to be large and accessible from all sides, so that every student has easy access to both the box of bricks and the shared model under construction. You might see this layout in robotics clubs or in maker spaces – not always in public school classrooms.\n\nThe division of work between four people is also incomplete, which may cause problems. The left side of a building instruction page has four slots – one for each student, marked with a different minifigure. The right side shows how to combine the work of all four into one element. But who is responsible for putting everything together? A similar issue appears in the Elaborate stage of each lesson. It’s worth considering whether your students should allocate these tasks on their own and telling them in advance to avoid confusion.\n\n**The new work system is meant to speed up building and put more emphasis on collaboration and communication, but it can also spark tensions within the group and cause chaos in the classroom.** Working in pairs is simpler to organize and manage, and it gives more equal access to the equipment.\n\n### Teaching materials and Teacher Portal\n\n(Printed building instructions for LEGO Education Science)\n\nApart from the new wireless electronics, the teaching materials are advertised as the strongest point of the Science series. For each set, **LEGO Education has prepared 40 lessons aligned with the NGSS standards** (Next Generation Science Standards) focused on Life Science, Physical Science, Engineering Design, Earth and Space Science.\n\nThe lessons are mapped to NGSS and other standards for different US states. However, if you want your lessons to cover absolutely all of these standards, you’ll need to scrutinize the LEGO program – **the Teacher Portal lessons don’t cover every topic.** There are especially noticeable gaps in Earth & Space Science. Other missing topics include e.g. physics concepts related to waves and sound. Engineering, meanwhile, is covered very thoroughly.\n\n**Were new sets necessary to map lessons to standards? No.** Let’s say it plainly: LEGO could have created ready-made full-year lesson plans for its existing sets and mapped them to the standards, but instead it released a completely new [and expensive](https://www.robocamp.eu/en/blog/lego-science-review/#price-and-value-of-lego-science) series. The lesson portal is undeniably useful for teachers, but it should have been created earlier and should also include SPIKE sets.\n\nSince the RoboCamp team has prepared multi-year SPIKE curricula with programming and scenarios aligned with teaching standards, LEGO Education also could have done it. If you’re looking for lesson plans for SPIKE, see:\n\n- [SPIKE Prime Programming: Intermediate Course](https://www.robocamp.eu/en/course-spike-prime-intermediate/)\n- [SPIKE Essential Programming: Early Learners Course](https://www.robocamp.eu/en/course-spike-essential-early-learners/)\n\nLesson materials from LEGO are available on a dedicated teaching platform – [Teacher Portal](https://teach.legoeducation.com/pl-pl/science/lessons). They include short presentations that guide students through the exercise, facilitation notes and tips for the teacher.\n\nBesides the online platform, you also get **printed building instructions included with the set**. Many users will appreciate this “retro” solution, which works fully offline and without any internet access. It’s supposed to work hand in hand with online materials, but **finding the portal lesson that corresponds to a model from the printed instructions is surprisingly difficult**. The portal has no search bar, the lesson tiles don’t show the model built in class, and the instructions include only a code instead of the lesson name. For now, you simply have to browse through all the lessons one by one.\n\n> Note! The title graphics on the portal lessons do not depict the model you build in that lesson in any way. They are just a creative interpretation of the lesson topic. To see the model, you need to open the building instructions.\n\nEach **lesson follows the 5E format** (surprisingly similar to [RoboCamp’s 5C lesson scenarios](https://www.robocamp.eu/en/lessons/): Consider, Create, Check, Code, Celebrate). There's an introduction (Engage), e.g. a short video; the building and observation phase (Explore); recording observations and drawing conclusions (Explain); further experiments (Elaborate) and a quiz at the end (Evaluate). The entire lesson is intended to fit into forty-five minutes.\n\n**The quality of individual lessons varies a lot.** You’ll find both engaging, well-designed activities and rather dull models that will be hard to use to spark students’ interest. Some constructions are highly symbolic and require support from the presentation to understand what the model is supposed to represent.\n\n(Model for a lesson by LEGO Education for Science kit: Big fish in a little pond)\n\n**Many lessons don’t make use of electronic elements at all.** Is this intentional? The Science solution is praised for its screen-free approach, but nearly always in the context of engaging electronics. It’s also possible that coming up with a large number of interesting activities based on the same pool of pre-programmed movements simply proved too difficult.",
      "summary": "The chapter outlines LEGO’s stated goal for Science sets as hands-on teaching aids for science and math, and it ties the product design to a claimed 45-minute lesson format. It cites a producer report on implementation in US schools with 9 teachers, noting that two-thirds completed lessons in 45–60-minute blocks and some teachers extended them further. The classroom workflow is described as four students per set with matching minifigures, requiring table access from all sides and raising questions about task division when combining parts. Teaching materials are described as 40 NGSS-aligned lessons per set delivered via Teacher Portal and printed instructions, with gaps in coverage (including Earth & Space Science and topics like waves and sound) and practical portal issues such as the lack of a search bar.",
      "primary_questions": [
        "What does the chapter say LEGO® promises Science sets will achieve in science and math-related lessons, including the notion of “aha moments”?",
        "Which practical classroom constraints are mentioned as factors that affect whether the producer’s promises will hold in a specific school?",
        "What does the quoted producer report about implementation in US schools with 9 teachers state about lesson duration and extensions beyond the planned format?",
        "How is the four-student work model organized through minifigure slots in the building instructions, and what assembly responsibility issue is raised?",
        "What classroom layout changes are described as necessary to support four students building from one shared box and model?",
        "How many NGSS-aligned lessons per set are described for Teacher Portal, and which topic gaps are explicitly mentioned?",
        "Which usability problems are described for matching printed instructions to Teacher Portal lessons, including missing portal features and lesson tile limitations?"
      ],
      "canonical_url": "https://www.robocamp.eu/en/blog/lego-science-review/#working-with-the-set-and-teaching-materials",
      "last_updated": "2025-11-14"
    },
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-review",
      "chapter_id": "5",
      "language": "en",
      "heading": "Coding Canvas App",
      "text": "### Coding Canvas app\n\n[Coding Canvas](https://code.legoeducation.com/en-us/word) is the app for programming LEGO Science electronics using code blocks. It runs in a browser and works very similarly to Word Blocks in the SPIKE app.\n\n**Key information about Coding Canvas:**\n\n- Available online for free\n- Science electronic elements connect via Bluetooth, each individually. You can connect up to 10 elements at once.\n- Grouping elements with connect cards is not recognized when programming from the app.\n- Science electronics are not compatible with SPIKE electronics.\n- Programs are created with block-based code similar to Word Blocks. [An equivalent of Icon Blocks mode](https://code.legoeducation.com/en-us/icon) also exists, but at this point it is so limited that it’s practically unusable.\n- The app is currently available only in English.\n\n(First look at Coding Canvas app for LEGO Education Science)\n\nYou might think – wait, wasn’t LEGO Science supposed to be for screen-free learning? So why this app? A fair question.\n\n**LEGO Education Science is marketed as a “completely screen-free” solution, but you only unlock the full potential of its electronics after connecting to the LEGO Coding Canvas app.** In this environment you can adjust motor power and speed and create your own motion sequences – features that are entirely unavailable when using only connect cards. LEGO does not mention this at all in its marketing materials, consistently presenting the Science kits as an offline solution.\n\nThis is a clear contradiction: the product is more expensive because it includes new electronics with potentially greater capabilities, but those capabilities are not advertised at purchase and are barely supported technically.\n\nWhat’s more, LEGO has not provided any support for teachers in using the Coding Canvas app, so they’re completely on their own with this tool. The Help section in the app, which briefly describes what each block does, offers minimal assistance. The RoboCamp team is currently working on teaching materials and programming lessons for LEGO Education Science. **We plan to release new coding lessons for Science in the near future.**\n\nIt’s also worth noting that once you add programming, the four-student group structure – so strongly promoted by LEGO – completely stops making sense. Realistically, the set can be effectively used by at most two students at a time.\n\nThe Coding Canvas app and the practical consequences of using it with Science sets strongly reinforce the impression that this product line is heading in a somewhat chaotic direction.",
      "summary": "Coding Canvas is described as a free browser-based app that programs LEGO Science electronics with block-based code similar to Word Blocks, and it is currently available only in English. The chapter states that Science elements connect via Bluetooth individually and that up to 10 elements can be connected at once, while connect-card grouping is not recognized in the app and Science electronics are not compatible with SPIKE electronics. It highlights that the app enables adjustments to motor power and speed and the creation of custom motion sequences, which are not available when using only connect cards. The text notes that LEGO provides no teacher support for Coding Canvas and that adding programming undermines the promoted four-student group structure, which the chapter says becomes unrealistic beyond two students at a time.",
      "primary_questions": [
        "What does the chapter identify as the platform and cost model of Coding Canvas, and how does it compare to Word Blocks in the SPIKE app?",
        "How does the app connect to Science electronic elements, and what limit on simultaneous connections is stated?",
        "Which limitations are listed for app-based programming regarding connect-card grouping and compatibility with SPIKE electronics?",
        "What programming capabilities does the chapter say become available in the app that are not available with connect cards alone?",
        "How does the chapter describe the mismatch between the product’s “completely screen-free” marketing and the existence of Coding Canvas?",
        "What does the text say about the level of support LEGO provides for teachers using Coding Canvas and the kind of help available in the app?",
        "What specific change to the promoted four-student group model does the chapter associate with introducing programming via the app?"
      ],
      "canonical_url": "https://www.robocamp.eu/en/blog/lego-science-review/#coding-canvas-app",
      "last_updated": "2025-11-14"
    }
  ]
}
