{
  "kb_meta": {
    "article_id": "lego-science-review",
    "language": "en",
    "kb_change_type": "representation_only",
    "kb_note": "Improved AI-oriented chapter segmentation; source article unchanged.",
    "last_updated": "2026-01-13"
  },
  "chapters": [
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-review",
      "chapter_id": "6",
      "language": "en",
      "heading": "Working with the set and teaching materials",
      "text": "## Working with the set and teaching materials\n\n(LEGO Science minifigures)\n\n### Product idea and producer's promises\n\nAccording to LEGO®, **Science sets are meant to serve as teaching aids for hands-on experiments in science and math-related subjects.** By physically working with models, students should engage more and gain a deeper understanding of the topics discussed. The producer also promises “aha moments” in the classroom – spontaneous flashes of understanding in our students, in the spirit of Archimedes.\n\nUsing bricks to run simple experiments is meant to be **faster, simpler and more interesting** for students than working with cardboard, rubber bands, popsicle sticks or other everyday materials.\n\n**Whether these promises will come true in your school or not** will ultimately depend on your students’ preferences and your working conditions as a teacher.\n\nThe producer also emphasizes that the sets are designed for repeated use. They supposedly do not require replenishment and are always ready to go. However, anyone who has worked with educational bricks knows that elements get lost and mixed between sets – no brick set is free from this problem. On top of that, the electronics must be charged regularly and in the case of LEGO Science [this is quite a nuisance](https://www.robocamp.eu/en/blog/lego-science-review/#multi-charger-45623).\n\nAnother important factor in the design of the set was lesson length. **Building, running and experimenting are all supposed to fit into a maximum of 45 minutes each time**, which is genuinely valuable in a school context. With the existing LEGO Education sets it used to be quite difficult (though not impossible – see [RoboCamp 45-minute lessons](https://www.robocamp.eu/en/lessons/spike-short-lessons/)).\n\n**Unfortunately, this claim turns out not to be entirely true.** In its own report on implementing LEGO Education Science in US schools with 9 teachers, the producer writes:\n\n>[...] The few challenges teachers reported related to implementation were primarily pedagogical: managing time, addressing knowledge gaps, and supporting concept transfer. [...] while two-thirds of teachers were able to complete the lessons in the 45–60-\nminute blocks, some teachers chose to extend\nthe lessons <br> – [LEGO® Education Science Case Study](https://education.lego.com/en-us/resources/les-case-study-download/): Enhancing Engagement in Science among Diverse Learners\n\nIt turns out that, according to the manufacturer, a lesson hour is closer to 60 minutes than 45, and that in real classroom conditions teachers often extended their lessons even more.\n\nWe don’t know exactly which lessons the report refers to, nor the conditions in which they were delivered. But 15 minutes make a real difference in a single lesson hour – you should definitely keep this in mind if you plan to use the official lesson plans.\n\n### Working with the set in classroom\n\nEach set in the Science line **is designed for a group of 4 students**, each with their “own” LEGO minifigure in a color that matches their slot in the printed building instructions. This working system assumes there is no programming involved.\n\n**The advantage is that you need fewer sets in the classroom** than when working in pairs.\n\nUnfortunately, the drawbacks outweigh this benefit. Four students in a group can be a bit crowded, and not every class splits neatly into groups of four. **The working system essentially requires rearranging the entire classroom** – tables need to be large and accessible from all sides, so that every student has easy access to both the box of bricks and the shared model under construction. You might see this layout in robotics clubs or in maker spaces – not always in public school classrooms.\n\nThe division of work between four people is also incomplete, which may cause problems. The left side of a building instruction page has four slots – one for each student, marked with a different minifigure. The right side shows how to combine the work of all four into one element. But who is responsible for putting everything together? A similar issue appears in the Elaborate stage of each lesson. It’s worth considering whether your students should allocate these tasks on their own and telling them in advance to avoid confusion.\n\n**The new work system is meant to speed up building and put more emphasis on collaboration and communication, but it can also spark tensions within the group and cause chaos in the classroom.** Working in pairs is simpler to organize and manage, and it gives more equal access to the equipment.",
      "summary": "LEGO® positions Science sets as hands-on teaching aids for science and math that should make experiments faster and more engaging than improvised materials, while aiming for repeatable use and “aha moments.” The chapter questions the 45-minute lesson promise by citing a LEGO implementation report where many lessons took 45–60 minutes and some were extended further, and it notes practical issues like lost/mixed bricks and frequent charging. Classroom use is organized around groups of four students with matching minifigures and printed instruction roles, which can reduce the number of sets needed but may require rearranging tables and can create confusion about task ownership. The intended collaboration model can speed building but may also cause tensions and classroom chaos compared with simpler pair work.",
      "primary_questions": [
        "What teaching purpose and classroom benefits does LEGO® claim for LEGO Education Science sets?",
        "How does the chapter challenge the claim that lessons reliably fit into 45 minutes, and what report is cited?",
        "What practical reuse and maintenance issues are identified for educational brick sets and Science electronics?",
        "How is the four-student group system structured in the printed building instructions and minifigure roles?",
        "What classroom layout changes may be required to make the four-student workflow function effectively?",
        "What specific coordination problems can arise when combining individual work into a shared model?",
        "Why does the chapter argue that pair work can be easier to manage than groups of four?"
      ],
      "canonical_url": "https://www.robocamp.eu/en/blog/lego-science-review/#working-with-the-set-and-teaching-materials",
      "last_updated": "2025-11-14"
    },
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-review",
      "chapter_id": "7",
      "language": "en",
      "heading": "Teaching materials and Teacher Portal",
      "text": "### Teaching materials and Teacher Portal\n\n(Printed building instructions for LEGO Education Science)\n\nApart from the new wireless electronics, the teaching materials are advertised as the strongest point of the Science series. For each set, **LEGO Education has prepared 40 lessons aligned with the NGSS standards** (Next Generation Science Standards) focused on Life Science, Physical Science, Engineering Design, Earth and Space Science.\n\nThe lessons are mapped to NGSS and other standards for different US states. However, if you want your lessons to cover absolutely all of these standards, you’ll need to scrutinize the LEGO program – **the Teacher Portal lessons don’t cover every topic.** There are especially noticeable gaps in Earth & Space Science. Other missing topics include e.g. physics concepts related to waves and sound. Engineering, meanwhile, is covered very thoroughly.\n\n**Were new sets necessary to map lessons to standards? No.** Let’s say it plainly: LEGO could have created ready-made full-year lesson plans for its existing sets and mapped them to the standards, but instead it released a completely new [and expensive](https://www.robocamp.eu/en/blog/lego-science-review/#price-and-value-of-lego-science) series. The lesson portal is undeniably useful for teachers, but it should have been created earlier and should also include SPIKE sets.\n\nSince the RoboCamp team has prepared multi-year SPIKE curricula with programming and scenarios aligned with teaching standards, LEGO Education also could have done it. If you’re looking for lesson plans for SPIKE, see:\n\n- [SPIKE Prime Programming: Intermediate Course](https://www.robocamp.eu/en/course-spike-prime-intermediate/)\n- [SPIKE Essential Programming: Early Learners Course](https://www.robocamp.eu/en/course-spike-essential-early-learners/)\n\nLesson materials from LEGO are available on a dedicated teaching platform – [Teacher Portal](https://teach.legoeducation.com/pl-pl/science/lessons). They include short presentations that guide students through the exercise, facilitation notes and tips for the teacher.\n\nBesides the online platform, you also get **printed building instructions included with the set**. Many users will appreciate this “retro” solution, which works fully offline and without any internet access. It’s supposed to work hand in hand with online materials, but **finding the portal lesson that corresponds to a model from the printed instructions is surprisingly difficult**. The portal has no search bar, the lesson tiles don’t show the model built in class, and the instructions include only a code instead of the lesson name. For now, you simply have to browse through all the lessons one by one.\n\n> Note! The title graphics on the portal lessons do not depict the model you build in that lesson in any way. They are just a creative interpretation of the lesson topic. To see the model, you need to open the building instructions.\n\nEach **lesson follows the 5E format** (surprisingly similar to [RoboCamp’s 5C lesson scenarios](https://www.robocamp.eu/en/lessons/): Consider, Create, Check, Code, Celebrate). There's an introduction (Engage), e.g. a short video; the building and observation phase (Explore); recording observations and drawing conclusions (Explain); further experiments (Elaborate) and a quiz at the end (Evaluate). The entire lesson is intended to fit into forty-five minutes.\n\n**The quality of individual lessons varies a lot.** You’ll find both engaging, well-designed activities and rather dull models that will be hard to use to spark students’ interest. Some constructions are highly symbolic and require support from the presentation to understand what the model is supposed to represent.\n\n(Model for a lesson by LEGO Education for Science kit: Big fish in a little pond)\n\n**Many lessons don’t make use of electronic elements at all.** Is this intentional? The Science solution is praised for its screen-free approach, but nearly always in the context of engaging electronics. It’s also possible that coming up with a large number of interesting activities based on the same pool of pre-programmed movements simply proved too difficult.",
      "summary": "LEGO Education promotes the Teacher Portal and teaching materials as a key strength of Science, offering 40 NGSS-aligned lessons per set spanning Life Science, Physical Science, Engineering Design, and Earth and Space Science. The chapter notes that coverage is incomplete, with gaps especially in Earth & Space Science and missing topics such as waves and sound, while engineering is covered thoroughly. It argues that such standards-mapped lesson plans could have been created for existing sets rather than requiring a new expensive series, and points to RoboCamp’s SPIKE curricula as an example of multi-year programming-aligned planning. Materials are delivered via an online Teacher Portal plus printed building instructions, but matching printed models to portal lessons is difficult due to missing search, non-representative lesson tiles, and code-only references.",
      "primary_questions": [
        "What does LEGO Education claim is the strongest point of the Science series besides the new electronics?",
        "How many lessons per set are provided and which NGSS domains are they designed to cover?",
        "Which topic gaps does the chapter identify in the Teacher Portal lesson coverage?",
        "Why does the chapter argue that mapping lessons to standards did not require releasing new Science sets?",
        "What resources are linked as examples of multi-year curricula for SPIKE sets?",
        "How are Teacher Portal materials and printed building instructions intended to work together?",
        "What specific usability issues make it hard to find the portal lesson that matches a printed model?"
      ],
      "canonical_url": "https://www.robocamp.eu/en/blog/lego-science-review/#teaching-materials-and-teacher-portal",
      "last_updated": "2025-11-14"
    },
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-review",
      "chapter_id": "8",
      "language": "en",
      "heading": "Coding Canvas app",
      "text": "### Coding Canvas app\n\n[Coding Canvas](https://code.legoeducation.com/en-us/word) is the app for programming LEGO Science electronics using code blocks. It runs in a browser and works very similarly to Word Blocks in the SPIKE app.\n\n**Key information about Coding Canvas:**\n\n- Available online for free\n- Science electronic elements connect via Bluetooth, each individually. You can connect up to 10 elements at once.\n- Grouping elements with connect cards is not recognized when programming from the app.\n- Science electronics are not compatible with SPIKE electronics.\n- Programs are created with block-based code similar to Word Blocks. [An equivalent of Icon Blocks mode](https://code.legoeducation.com/en-us/icon) also exists, but at this point it is so limited that it’s practically unusable.\n- The app is currently available only in English.\n\n(First look at Coding Canvas app for LEGO Education Science)\n\nYou might think – wait, wasn’t LEGO Science supposed to be for screen-free learning? So why this app? A fair question.\n\n**LEGO Education Science is marketed as a “completely screen-free” solution, but you only unlock the full potential of its electronics after connecting to the LEGO Coding Canvas app.** In this environment you can adjust motor power and speed and create your own motion sequences – features that are entirely unavailable when using only connect cards. LEGO does not mention this at all in its marketing materials, consistently presenting the Science kits as an offline solution.\n\nThis is a clear contradiction: the product is more expensive because it includes new electronics with potentially greater capabilities, but those capabilities are not advertised at purchase and are barely supported technically.\n\nWhat’s more, LEGO has not provided any support for teachers in using the Coding Canvas app, so they’re completely on their own with this tool. The Help section in the app, which briefly describes what each block does, offers minimal assistance. The RoboCamp team is currently working on teaching materials and programming lessons for LEGO Education Science. **We plan to release new coding lessons for Science in the near future.**\n\nIt’s also worth noting that once you add programming, the four-student group structure – so strongly promoted by LEGO – completely stops making sense. Realistically, the set can be effectively used by at most two students at a time.\n\nThe Coding Canvas app and the practical consequences of using it with Science sets strongly reinforce the impression that this product line is heading in a somewhat chaotic direction.",
      "summary": "Coding Canvas is a browser-based app for programming LEGO Science electronics with block code similar to SPIKE Word Blocks, allowing up to 10 Bluetooth-connected elements at once. The chapter lists key constraints: connect-card grouping is not recognized in programming mode, Science electronics are not compatible with SPIKE electronics, Icon Blocks exists but is currently too limited to be practical, and the app is only available in English. It argues that the app exposes a contradiction in marketing because Science is promoted as completely screen-free while the full electronics potential (e.g., motor power, speed, custom motion sequences) requires the app, and LEGO does not highlight this at purchase. The lack of teacher support and the mismatch with the four-student workflow are presented as practical barriers that contribute to a perception of a chaotic product direction.",
      "primary_questions": [
        "What is Coding Canvas and how does it relate to programming LEGO Education Science electronics?",
        "How do Science electronics connect to the app and how many elements can be connected at once?",
        "Which limitations are listed regarding connect cards, compatibility with SPIKE, Icon Blocks, and language availability?",
        "What capabilities become available in Coding Canvas that are not possible with connect cards alone?",
        "Why does the chapter call the existence of Coding Canvas a contradiction to the product’s screen-free marketing?",
        "What support gaps for teachers are identified when using the Coding Canvas app?",
        "How does adding programming affect the practicality of the four-student group structure described earlier?"
      ],
      "canonical_url": "https://www.robocamp.eu/en/blog/lego-science-review/#coding-canvas-app",
      "last_updated": "2025-11-14"
    },
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-review",
      "chapter_id": "9",
      "language": "en",
      "heading": "Capabilities of the set",
      "text": "## Capabilities of the set\n\nThe capabilities of Science sets need to be assessed in two ways: as a [ready-made, closed product](https://www.robocamp.eu/en/blog/lego-science-review/#lego-science-as-an-open-product) released by LEGO Education, and as an [open set](https://www.robocamp.eu/en/blog/lego-science-review/#lego-science-as-an-open-product) – that is, what room there is to go beyond the framework imposed by the manufacturer, whether it can be combined with other solutions and adapted to your own lesson plans.\n\n### LEGO Science as a closed product\n\nThe main value of LEGO Education Science as an **“out-of-the-box” classroom tool** lies in the ready-made lessons designed specifically for these sets. They’re structured to cover as many NGSS standards as possible, which makes the series a very convenient and predictable solution for teachers.\n\nScience teachers can use the set to guide students at all educational stages through a wide range of curriculum-required science and STEM topics. There’s no need to dive into complex issues related to coding or robotics. Models are started almost like with a magic wand – a quick tap with a card and the robot runs its sequence, neatly demonstrating the results of the experiment or simulation planned for the lesson.\n\n> Note! The ready-made lessons cover *most* topics required by NGSS, but *not all* of them.\n\nAs a **teaching aid for demonstrating specific curriculum concepts**, the LEGO Science series offers a kind of “middle ground” among LEGO Education sets. Without any programming, Science requires less time, less IT infrastructure and less tech knowledge than SPIKE, which makes it easier to adopt in a regular classroom. At the same time, thanks to a few electronic components, it’s clearly more engaging than purely mechanical BricQ Motion.\n\nThere’s no denying that **LEGO Science is very convenient for teachers who prefer screen-free science lessons**, as well as for school decision-makers. It’s ready to use straight out of the box, comes with NGSS-aligned lesson plans, and doesn’t require turning on a computer or tablet. The working method is friendly even for educators who are wary of new technologies or classroom devices.\n\nThe product delivers on promises that really matter in school:\n\n- the set contains everything students need during class,\n- it offers a base of lessons mapped to official standards,\n- it’s easy to operate,\n- it works without screens or computers,\n- and it allows you to run a complete lesson in about 45 minutes.\n\nIt also works well for cover lessons and timetable “gaps”, when you need to run an engaging activity in a single period with minimal preparation. For schools without a computer lab, LEGO Science is a reasonable option: with very little infrastructure, you can roll out consistent, repeatable science and physics lessons across different classes.\n\nAll this means that the Science series may appeal especially to teachers who, for various reasons, **have not yet used LEGO Education sets** in their lessons and are looking for a safe, structured starting point.\n\nHowever, you should also be aware of the downsides.\n\nThe elements in the box are selected strictly with specific lessons in mind; their goal is not to support students’ creative engineering. Mechanisms are simplified and often less interesting than models built from sets richer in construction pieces. **The narrow framework of the series also affects lesson quality** – restricted possibilities in terms of construction, electronics and programming mean that models are quite symbolic. After a few lessons, you may find that holding students’ attention still depends mostly on the teacher’s creativity and teaching style.\n\nRobotics clubs and project teams will feel the lack of programming and limited freedom in building. For this type of work – long-term projects, competitions, advanced robotics – SPIKE will be a much better fit (even if you sometimes use it in simple offline demonstration mode). The constraints of LEGO Science also make it a poor choice for multi-lesson projects where students should iterate and develop their own designs.\n\nIn short: **LEGO Science is an interesting proposal for teaching, but it is not a universal tool**. It shines as a structured, screen-free demonstration kit, not as a platform for open-ended robotics and engineering.\n\n(LEGO Science Bricks comparison: decorative elements vs mechanical)\n\n### LEGO Science as an open product\n\nIf you want to use LEGO Science differently than strictly as prescribed by the producer – for example, as an open-ended STEM or robotics kit – the sets start to look like rather difficult partners.\n\n**On the construction side, you are strongly limited by the very small number of Technic elements.** This makes it harder not only to build complex mechanisms, but even solid, stable versions of simple ones (for example, the lack of black friction pins means that models tend to have noticeable play). There’s very little room for students’ engineering creativity. They can only use their imagination when decorating – which is supported by smooth tiles, ornamental elements and minifigures – so even simple models can look attractive, but mechanically they remain basic.\n\n**The huge plus, of course, is the lack of cables.** This lets you focus on the model’s functionality instead of how to route wires, and it also improves the look of the finished builds. However, you need to remember that the nature of this electronics requires that all elements have easy access to the power button and room for the card to be placed against them. This practical detail can limit where and how you integrate motors or sensors into your models.\n\nAnother major limitation to the set’s potential comes from the **preprogrammed movements of Science electronics.** Take the motors as an example. By default, the factory program controlling the motor lets the head move over a full 360-degree range. which makes it impossible, for example, to build robots with motion limiters. That makes it impossible to build robots with motion limiters, which are useful in launchers, grippers or barrier mechanisms – such constructions would simply pull themselves apart when turned on. Also, you can’t build many interactive models, because specific readings from the color sensor always trigger the same reactions in the motors.\n\nFortunately, these problems can be worked around by programming directly in the [Coding Canvas app](). This online tool allows fairly precise control over the electronics and lets you connect many electronic components at once. However, we’re holding off on a final verdict on this app – first, the RoboCamp team will design several new robots to test its capabilities in real classroom and club conditions.\n\nOf course, we should also underline that **opening LEGO Science up to programming from the app completely undermines the intended working model – screen-free, offline** science lessons that don’t require devices.\n\nSo is it worth buying this set at all?",
      "summary": "The chapter evaluates LEGO Education Science in two frames: as a closed, ready-made product built around NGSS-aligned lessons and as an open set for going beyond the manufacturer’s framework. As a closed classroom tool, it is presented as convenient and predictable, enabling screen-free demonstrations started via connect cards without requiring coding, IT infrastructure, or deep tech knowledge, and it is positioned between SPIKE and BricQ Motion in engagement and complexity. The downsides include symbolic models, limited construction and programming freedom, and weaker suitability for robotics clubs, long-term projects, and iterative engineering work where SPIKE is framed as a better fit. As an open product, constraints include a scarcity of Technic elements and practical integration limits, while cable-free electronics are a major benefit but preprogrammed motor behavior limits mechanisms unless Coding Canvas programming is used, which undermines the intended offline model.",
      "primary_questions": [
        "Why does the chapter argue that Science set capabilities must be assessed as both a closed product and an open set?",
        "What benefits make LEGO Education Science convenient as an out-of-the-box, NGSS-oriented classroom tool?",
        "How does the chapter position Science between SPIKE and BricQ Motion in terms of infrastructure, coding, and engagement?",
        "What limitations of the closed product approach affect lesson quality, model design, and student creativity?",
        "Why are robotics clubs and long-term project teams described as likely to prefer SPIKE over Science?",
        "What construction constraints emerge when trying to use Science as an open-ended STEM or robotics kit?",
        "How do cable-free electronics help builders while preprogrammed movements and offline requirements still constrain designs?"
      ],
      "canonical_url": "https://www.robocamp.eu/en/blog/lego-science-review/#capabilities-of-the-set",
      "last_updated": "2025-11-14"
    },
    {
      "article_id": "lego-science-review",
      "post_slug": "lego-science-review",
      "chapter_id": "10",
      "language": "en",
      "heading": "Conclusions: Is LEGO Science for you",
      "text": "## Conclusions: Is LEGO Science for you\n\n**TOP 3 PROS**\n\n- 40 ready-made 45–60 minute lessons from LEGO Education\n- alignment with NGSS standards\n- screen-free, offline learning\n\n**TOP 3 CONS**\n\n- rigid set, limited capabilities\n- high price\n- suboptimal group work model\n\nThe greatest advantages of the LEGO® Education Science line are its ready-made, NGSS-aligned lesson plans and the ability to run completely screen-free, offline science lessons. It’s a solid choice for teachers who want to easily enrich their science curriculum with group work and hands-on experiments that help students grasp specific, clearly defined topics from the US standards – without spending hours on preparation.\n\nThis **tool may appeal especially to early primary school math and science teachers** who would like to add a few more engaging, brick-based lessons during the school year, but feel unsure about coding or managing tablets and laptops in the classroom. The manufacturer’s lessons are designed to fit into a 45-minute period, and some of them can be adapted to school standards other than NGSS.\n\nLEGO Science is also well thought out from the perspective of **school budget decision-makers**. One product contains everything a teacher and student need: bricks, electronics, and teaching materials. There’s nothing else you have to buy – no extra tablets, laptops, or additional resources to get started with screen-free STEM lessons.\n\n**However, Science is a very rigid system.** The choice of elements and the default exclusion of programming mean that working freely beyond the ready-made lesson framework is difficult, which significantly limits its broader application in school and cools students’ creative ambitions.\n\nThe Science kits will work in your school if you plan to use the sets primarily in the role defined by the manufacturer. In that case, they bring real value and can be a sensible choice. But it’s important to remember that this is not an all-purpose robotics set – it is not designed for teaching programming or developing deep student independence and creativity in engineering. **In practice, LEGO Science is very good at one specific thing: repeatable, screen-free lessons based on ready-made scenarios.** For projects, coding and competitions, [SPIKE](https://www.robocamp.eu/en/blog/lego-spike-essential-review/) is the better choice.\n\nIf you’ve already worked with SPIKE before and expect LEGO Education Science to “work similarly”, you may be disappointed: Science doesn’t offer programming or comparable engineering freedom.\n\n### Science vs other LEGO Education sets\n\nIn terms of construction possibilities, Science sets don’t hold a candle to the decent (though mechanically modest) [SPIKE Essential](https://www.robocamp.eu/en/blog/lego-spike-essential-review/) or the fantastic [SPIKE Prime](https://www.robocamp.eu/en/blog/lego-spike-prime-review/). BricQ Motion is also richer in construction elements – there you have sails, weights, fan blades, many types of gears and beams, pins and all sorts of connectors. **Science includes fewer construction bricks, and they are less universal.**\n\n**Science electronics are modest** and less useful didactically compared to SPIKE Prime and SPIKE Essential – although this matters less if you’re not interested in teaching programming at all.\n\nScience’s main advantage seems to be **the ability to work offline without a screen.** But note – this is also possible with SPIKE Prime! Each Prime hub comes with factory-loaded demo programs that, with the addition of teaching materials and printed building instructions, could easily become a tool for screen-free work. It’s a pity LEGO did not think of selling such an add-on separately for the sets that already exist.\n\nA real advantage of Science electronics is **the lack of cables** connecting the components in a model – and yes, it does look nicer. It potentially removes some construction constraints for builders, but they are not the main target group. The need to charge all these elements, however, can quickly become tiresome.\n\n**Because of the intrinsic limitations of the line, students have fewer opportunities to learn through play during lessons.** Science does not allow them to run their own tests and experiments – there’s neither enough bricks nor time. The lessons don’t really include room for creativity beyond adding a few decorations.\n\nCompared to the capabilities of other LEGO Education products, it is hard to shake the impression that **the Science line focuses more on teacher expectations than on student potential.**\n\n### Price and value of LEGO Science\n\nThe price of a Science set ranges from 329.95 USD to 499.95 USD. To cover the full student journey (ages 5–14), you need to buy all 3 sets, which comes to 1,229.85 USD.\n\nSPIKE Essential costs 329.95 USD. SPIKE Prime is 399.95 USD. Together they cover a similar, longer age range (6 to 16+) and cost 729.90 USD in total.\n\nBricQ Motion sets are the cheapest – both BricQ Motion Prime and Essential cost only 159.95 USD, but they don’t include any electronics.\n\n(Price comparison: LEGO Science vs LEGO SPIKE)\n\nThe overall **value of LEGO Science is debatable**. The contents of the box don’t really justify such a high price, especially when you consider that the lesson plans and teaching outlines are freely available to everyone on LEGO’s online platform. It’s possible that part of the cost of developing the lessons and the Teacher Portal has simply been built into the set price. Or perhaps this product is intentionally designed to be **high-convenience rather than low-cost**.\n\n**Science “pays off” when your top priorities are: truly screen-free work, easy teacher onboarding and ready-made lessons aligned with NGSS.** It makes less financial sense when your main focus is the development of engineering skills, mechanics or coding – in that case, the price-to-capability ratio is clearly better in the SPIKE line.\n\nSince the series has only just entered the market, we don’t yet know whether it will turn out to be a long-term investment. We can only hope that, like other LEGO Education sets, these kits will prove durable – some WeDo 1.0 robotics sets from 2009 are still being used in schools today.\n\nLEGO Science is an interesting product that brings several noteworthy innovations. **Its real strength lies in how easy it is to implement in school and how tightly it integrates with the American NGSS science curriculum**, which is not necessarily an ideal match for all educational systems around the world. **In terms of capabilities, educational value and price-to-content ratio, the Science series loses to LEGO Education sets that are already on the market.**\n\nIt’s also striking that **LEGO Education Science often seems to contradict itself**. The set is meant to be used primarily by children, yet the marketing and design decisions appear to focus more on adult expectations. It promotes screen-free lessons, while quietly releasing a programming app in the background. It claims to foster student creativity, while clearly limiting their options for building and coding. It looks visually modest, yet is currently the most expensive LEGO Education set.\n\nEven so, the Science line will certainly find its fans. The ability to skip programming, avoid managing tablets and roll out ready-made, screen-free lessons quickly can convince a completely new group of teachers to try LEGO bricks in the classroom for the first time.\n\nFor schools that want to introduce LEGO Education gradually, **Science can be a low-risk first step**: start with structured, offline science lessons and only later move on to SPIKE when staff and students are ready for coding and more open-ended engineering. In this role, LEGO Science becomes less a competitor to SPIKE and more a **gateway to richer STEM and robotics tools**, especially in schools where technology access, teacher confidence or preparation time are still limited.\n\nIn other contexts, LEGO Science will simply be the **“good enough” answer** – a way to tick the boxes of hands-on STEM, NGSS alignment and screen-free activities without reshaping the timetable or investing in new infrastructure. For schools that already use SPIKE or BricQ Motion, it will more likely remain a niche add-on than a central tool.\n\nThe key is to see Science for what it really is: **not a universal solution for robotics and programming, but a specialized kit for fast, ready-made science lessons with LEGO bricks**.\n\n<br>",
      "summary": "The conclusion summarizes Science as strong at delivering 40 ready-made NGSS-aligned lessons for screen-free, offline learning, while highlighting a rigid system, high price, and a suboptimal group-work model as key drawbacks. It positions the product as appealing to early primary math and science teachers and school budget decision-makers because it bundles bricks, electronics, and teaching materials without needing extra devices, yet it warns that limited building and the default exclusion of programming restrict broader engineering creativity. In comparisons, Science is described as weaker than SPIKE Essential and SPIKE Prime for construction and programming potential, with its primary advantage being offline operation and cable-free electronics alongside the burden of charging many components. The value section contrasts total Science costs for ages 5–14 with SPIKE and BricQ Motion price points and argues that Science makes sense when convenience, onboarding, and truly screen-free delivery matter most, while its price-to-capability ratio is less favorable versus existing LEGO Education sets.",
      "primary_questions": [
        "What are the top three pros and top three cons listed for LEGO® Education Science in the conclusion?",
        "Which teacher profiles and school decision-maker needs are described as best matched to the Science line?",
        "Why does the conclusion describe Science as a rigid system and how does that affect student creativity and broader use?",
        "How does Science compare with SPIKE Essential, SPIKE Prime, and BricQ Motion in construction and didactic capabilities?",
        "What offline advantages are claimed for Science and what operational drawbacks (such as charging) are emphasized?",
        "How do the prices of the three Science kits compare to SPIKE Essential, SPIKE Prime, and BricQ Motion sets?",
        "Under what priorities does the chapter argue that Science “pays off,” and when is the SPIKE line the better fit?"
      ],
      "canonical_url": "https://www.robocamp.eu/en/blog/lego-science-review/#conclusions-is-lego-science-for-you",
      "last_updated": "2025-11-14"
    }
  ]
}
